[{"id":"GWplr9","title":"HP V223ve FHD Monitor, 1080p VA Display,75Hz Refresh Rate, 21.5-inch Computer Screen,TÜV certified Low Blue Light Mode, Ergonomic Tilt,3000:1 Contrast Ratio,HDMI & VGA Ports,VESA Mounting (2021),Black","imageUrl":"https://m.media-amazon.com/images/I/61+R6lkowKL._AC_SX466_.jpg","price":"$69.99","description":"About this item\nAN EVERYDAY MONITOR – Answer emails, check your social feeds, and watch the latest shows on a tilt-adjustable monitor that delivers stunning picture quality in a highly affordable style.\nFULL HD DISPLAY – Be prepared for brilliant visuals on this 21.5-inch Full HD display (1); enjoy colors that pop and superb black levels thanks to its 75Hz refresh rate, a contrast ratio of 3000:1, and a dynamic contrast ratio of 5M:1 (2).\nSHARE THE PANORAMIC VIEW – Get vibrant detail from practically any position with wide, 178-degree viewing angles on a VA panel.\nMODERN CONNECTIVITY – Easily connect additional devices, storage drives, or monitors through the HDMI and VGA ports.\nEASY ON THE EYES – The TÜV certified Low Blue Light Mode subtly shifts your display’s colors to a warmer spectrum while making whites more natural for greater comfort and less eye strain.\nERGONOMIC ADJUST – Find your best viewing position and stay comfortable during your next binge-watch or marathon project by tilting the screen up to 5 degrees forward or 22 degrees backward.\nNARROW BEZEL DESIGN – Optimized for both looks and efficiency, your monitor's narrow bezel lets you enjoy more of your screen.\nShow more","reviews":[{"name":"Ariel Surprises","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Crisp Color and Image Quality","review":"This is the 2nd monitor that my daughter's added to her PC setup. She's so frustrated b/c no matter what she does she can't get the colors to match on both screens - she was very specific & clear that it's not a flaw with the monitor (the other monitor is not equal in quality, 2+ years old). She likes this monitor quite a bit. In fact, I think she's planning on buying a 2nd monitor so they will match & cuz she loves it!"},{"name":"Rafael Rodriguez","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great for Home Office","review":"I have a work issued 14\" laptop. This monitor plugs into the HDMI port and is ready to go. Makes life so much easier."},{"name":"Kira Williams","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great value for what you pay for","review":"These are great so far for playing games! I did have to buy a HDMI to Display Port cable but for games like Monster Hunter Rise and Dyinglight 2 the graphics have been great so far!"},{"name":"ladeybugg","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Excellent quality monitor!","review":"Great monitor. Bought this to use for a second screen while teleworking. I love it! May get a second one, made me realize how lousy my laptop screen is. 😁"},{"name":"Zadok","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great Work Monitor","review":"I use this monitor 8 hours a day at work. Very clear and doesn’t seem to fatigue my eyes much. Overall, it just does what you want a monitor to do."},{"name":"Dani","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Needs CPU","review":"Idky I thought the whole computer was in the box... like the CPU was in the screen. This is just a monitor like it clearly says it is. Lol\nGreat quality for the price. My son uses for gaming. He loves."},{"name":"Kam Labyrinth","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Affordable, and Suited my needs.","review":"Dunno how these do for videos, or gaming, as I got them for work, but my spreadsheets look fine."},{"name":"Greg Laurich","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" My wife loves it","review":"We had to buy a new monitor so my wife could work from her parent's house. She was able to get it up and running with no problem. She really likes it and it makes work so much easier for her to accomplish. It was literally plug and play."}]},{"id":"MjvbkS","title":"SAMSUNG S33A Series 24-Inch FHD 1080p Computer Monitor, HDMI, VA Panel, Wideview Screen, Eye Saver Mode, Game Mode (LS24A336NHNXZA), Black","imageUrl":"https://m.media-amazon.com/images/I/71HzQ-dvztL._AC_SX450_.jpg","price":"$139.99","description":"About this item\nMounting Type:Wall Mount (Size mm) 75.0 x 75.0.Aspect Ratio 16:9","reviews":[{"name":"Bear","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Husband likes","review":"My husband is using this as a moniter for his computer and say's it works great! Coming from someone who is always on one at the office!"},{"name":"Angela","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very wide","review":"When ordering I did not notice it was so wide. It’s a screen, does what it needs to do"},{"name":"Candice Machuca","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Nice","review":"Nice size screen. Clear picture. Works great"},{"name":"Dale Avery","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" So far they are doing just what i hoped they would.","review":"works fine and price was reasonable."},{"name":"n. murphy","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Worth buying!","review":"Great buy for the money. Was able to pick up at our local Best Buy. Easy to set up with our wi-fi,  acct. and Alexa. Would buy again!"},{"name":"fuel98rider","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Good for using with a laptop","review":"I bought this for my son to use in his dorm rather than struggling looking at his laptop screen. For that purpose, it is perfect. It is not a high-end monitor for gaming, and for me that was not its purpose. It is a good quality monitor for use in normal computing tasks. I will by another one for my daughter when she leaves next summer for college."},{"name":"Matt S.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" HDMI port is the only port that works on both monitors I bought","review":"HDMI port is the only port that works. Bought 2 at same time and both have the same issue. Only need one port but having to wait and buy new cords and splitters so I could use all 3 of my monitors was pretty annoying. Sitting there stuck with 3 monitors in front of me but only being able to use 1 is really the only reason I wrote this. Good picture quality though!"},{"name":"Paula","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" As advertised","review":"Wish it had a speaker or USB ports on it. I should have looked for that in description."}]},{"id":"3oDtVm","title":"LG 22MK430H-B 21.5-Inch Full HD Monitor with AMD FreeSync, Black","imageUrl":"https://m.media-amazon.com/images/I/81XIyc6RjcL._AC_SY450_.jpg","price":"$106.99","description":"About this item\nConnectivity Technology: Hdmi\n75 hertz","reviews":[{"name":"Jmodrak","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Beautiful monitor.","review":"For 90$ this is probably the best value and looking monitor for this price. My main monitor (380$) is also an LG and it''s 1440p,144hz, IPS, and this cheap 90$ monitor looks almost as good. Seriously a couple of tweaking in the settings and this monitor looks gorgeous.\n\nOut of the box it looked great, but for the best settings: put up the sharpness to 80, brightness to 100, and make sure to change to 75hz refresh rate. You might be confused on how to get to 75hz because it doesn't show up in NVIDIA control panel. In order to change the refresh rate to 75hz you have to right click on the desktop, go to display settings, then advanced display settings, then display adapter properties for display (1 or 2), then click the monitor tab and you can only change it there.\n\nAbsolutely worth the money."},{"name":"Just a customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" IT SILENCES YOUR COMPUTERS AUDIO - Here's what you need to know","review":"This can save you a lot of troubleshooting that leads only to a dead end.\n\nThere are NO SPEAKERS in this monitor - HOWEVER IT STILL TAKES OVER (shuts down) YOUR AUDIO. Plug it in and you'll have no volume out of your computer (or monitor) - whatsoever. And to keep you confused to the max, there are volume settings in the monitor's settings - and LG's online \"help\" (videos and web pages) tout these volume controls as your answer. Great decoy to keep you thinking the monitor in fact has speakers. Complete waste of time.\n\nSO KNOW THIS - these volume settings are ONLY for the headphone jack on the back of the monitor. So by plugging in this monitor, you give up your computer speakers for the monitor's headphone jacks. Really??? This is a feature???? Wired headphones overrides all??? Is this still the 1980's??? Anyway.....\n\nWHAT YOU CAN DO:\n1) Use the monitor with headphones for sound. I'm not a big fan of wired headphones. Too easy to choke on them.\n2) Send it back if you wanted speakers on the monitor. I didn't, and I was OK with the computer's speakers.\n3) In Windows, change your computer's default audio device back to the computer's speakers.\na) For Windows 10 Click Start\nb) <type \"Sound\" then ENTER>\nc) Under Sound, select the computers speakers. On my laptop, it was called \"Speakers (High Definition Audio Device\"\n\nBest of luck......"},{"name":"Music Lover","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" It works and provides great value","review":"I bought this monitor three months ago when my employer sent me home to work and I realized that I hadn't grabbed my work monitors.\nWhen it arrived, I took it out of the box, attached the mount, and plugged the HDMI cable into the monitor and my laptop. It just works and has given me NO trouble at all.\nI do a ton of writing and some work with Adobe InDesign, and this monitor's picture is crisp and clear. I don't play games so I can't speak to its gaming quality. For reading and writing, though, it's perfect.\nOh, the mount is not adjustable and I needed the screen to be higher. So I put a book underneath it and everything is fine!"},{"name":"BPotts","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" About Six Months in and Working Perfectly!","review":"I purchase two of these and have a total of three monitors for work. I am NOT a gamer and suspect gamers would not like these, but for home and business use they are great. The picture is very clear and the functions are easily accessible and user friendly. I have all hooked up through a docking station."},{"name":"electronics critic","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Excellent color quality and contrast","review":"Excellent color quality and contrast for the money. I've tested monitors that cost over $150 and cannot compete with this LG 22MK430H for $80. Its great for productivity, is large enough to have two windows open side-by-side, and works well for gaming. I've tested it on FPS and Racing games and looks great with no ghosting. The only downside is that the brightness is not excellent, but it works well enough in a sunlit room, as long as it's not in direct sunlight. For $80 grab one."},{"name":"Angelica Maldonado","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great picture quality, Would absolutely buy again","review":"This is a very cheap computer monitor. I'm using this to test my computer and am surprised and how crisp the images are. I like that it has a little joy stick instead of buttons. I would have liked 2 HDMI port's but because this is so cheap I can get 2! But the only downside about this product is that it can't move it's screen it's just facing forward, luckily it has vesa compatibility with computer arms and wall mounts. I'm satisfied with this product and again would buy this again"},{"name":"John Waters","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Works with Vampire V4SA (amiga clone)","review":"I procured this monitor on a hunch that it would work with my new Amiga (Apollo Accelerators' Vampire V4 StandAlone). This was a bit of a gamble since many of the video modes required are either old or not exactly standard. This display has handled everything that my Amiga has thrown at it. If you are looking for a display to handle RTG and SAGA output then this is for you. At least for the FPGA cores released so far. If you are using some other retro device that outputs to HDMI it's probably safe to assume that this has a good chance of working."},{"name":"Tommy Homeyer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great picture, & great I can get The Sound out of it, unlike the last monitor I had","review":"It's a great monitor... there may be no speakers built in, but significantly, it has on the back, a Sound Out (3.5mm for headphones, or hook it to a stereo- with a cable- 1 end 3.5, the other end, RCA's- right & left [red & white]). Or just get a Logitech stereo system, and plug the 3.5mm wire & jack to this (I got mine- with an HDMI cable from the PC to this) long story. But, doing it that way, I would not use the VGA/D-Sub input; the VGA cable can only transmit Video, with no Sound; though there is ways to get sound using VGA, thru a PC, with a 3.5mm cable; I've done the past 15 years. The VGA (Video Graphics Array) port is being phased out..."}]},{"id":"bR6K3Q","title":"Dell S2721HS Full HD 1920 x 1080p, 75Hz IPS LED LCD Thin Bezel Adjustable Gaming Monitor, 4ms Grey-to-Grey Response Time, 16.7 Million Colors, HDMI ports, AMD FreeSync, Platinum Silver","imageUrl":"https://m.media-amazon.com/images/I/61OI-wQse5L._AC_SY450_.jpg","price":"$69.99","description":"About this item\nBEAUTIFUL LOOK: Elegant thin bezel design with a delicate textured pattern infuses any living space with the sensation of a perfect balance of exceptional elegance and quality\nSEAMLESS SWITCHING: Built-in connectivity HDMI ports keep your devices always plugged in and let you effortlessly switch between streaming, video editing, and console gaming\nCLEAR VIEWS WITH LESS DISTRACTION: With a three-sided ultrathin bezel design, you can enjoy exceptional screen clarity in Full HD resolution of 1920 x 1080\nCONSISTENT COLORS: With In-Plane Switching (IPS) technology, you can enjoy incredibly smooth views with uniform colors across a wide 178°/178° viewing angle\nDELL SERVICES: 1 Year Advanced Exchange Service and Premium Panel Exchange. Find one “bright pixel” and Dell will provide you a free monitor exchange during the limited hardware warranty period","reviews":[{"name":"litho17","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great for its value","review":"In my opinion, this monitor is flawless when considering its price at $200, its adjustability (e.g., height and viewing angle), and its picture quality. However, I would say that when displaying 1080p on a 27 inch monitor, the image feels significantly more pixelated when compared with displaying 2k on a 27 inch monitor. But this is not a problem of this monitor."},{"name":"JD","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" For the price, this is an amazing monitor.","review":"Clarity is excellent. Color reproduction is also outstanding. I do a lot of photo editing for my wife's internet shop's listing and this monitor makes those projects a piece of cake. Even when I enlarge the photos to do very intricate adjustments the picture is still remarkably clear. I have used Dell equipment in the past and have always been more than satisfied."},{"name":"Meghin","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Greta computer monitor","review":"Computer monitor is exactly what I needed for work. Makes my setup great and easy to work on."},{"name":"Fred","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Inexpensive but awesome","review":"I received this product with a timely delivery and it isn't the best, but it definitely does the job. I would buy it again."},{"name":"Ralph Valdez","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Nice replacement","review":"Had to replace another Dell screen a cat knocked off my desk. This was a nice upgrade. Very happy with this monitor"},{"name":"Matt Lashua","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Good Value","review":"I see a few others mention that they did not get a 27\" monitor. Mine came and measured diagonally at 27\" just like described. Great monitor so far, and good picture, and exactly what I expected."},{"name":"Adnan Masood","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great monitor for home office","review":"They are great monitors in a budget friendly price. I have setup two of these and they are serving me pretty good. The picture quality is bright and the text is crisp clear. I don’t know how they works with gaming and streaming as I am using them primarily for my work."},{"name":"jazman","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great monitor","review":"very satisfied"}]}]