[{"id":"AO6TcF","title":"Lexar Hades 16GB Kit (8GBx2) RGB LED Lightning, DDR4 3600 MHz DRAM Desktop Memory for Gaming (LD4BU008G-R3600UDLH)","imageUrl":"https://m.media-amazon.com/images/I/61pLrvL8n8L._AC_SX450_PIbundle-2,TopRight,0,0_SH20_.jpg","price":"$69.99","description":"About this item\nVibrant RGB colors let you enjoy an interactive gaming experience\nLevel up your gaming experience with DDR4 overclocked performance\nLexar RGB Sync allows you to synchronize your RGB lighting controls\nOptimized with latest Intel XMP 2.0 and supports AMD Ryzen platform, heat dissipation to keep things cool\nLifetime limited product support","reviews":[{"name":"Ovaltine Jenkins","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" 3200mhz working on the Alienware Aurora R6","review":"This ram kit is JEDEC 3200mhz (so 1.2V at 22CL), not XMP. This means on some motherboards, especially OEM motherboards, this will run 3200mhz out of the box, assuming that both the motherboard/chipset and the CPU supports the higher memory speed.\n\nI tested this on a Alienware Aurora R6 w/ a i7-7700. It works with 3200mhz out of the box, which is surprising given that 3200mhz ram didn't become mainstream until 8th gen Intel, but hey, at least it works on the Aurora R6 (which when I tried upgrading the ram refuses to post with any XMP ram kit)"},{"name":"Tirronan","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Flawless in both installation and in performance","review":"Best price on the market at the time and worked flawlessly"},{"name":"Frank B. Church","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great","review":"Ordered for a omen 30L and worked great with no problems with bios. As long as u get right speed that matches u can upgrade a AMD . Everyone said u cant upgrade AMD but as usual they know very little. Great buy"},{"name":"Anvar","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Good price/performance","review":"Packaged good.\nCl16 for 3600"},{"name":"Carlos","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Fácil de instalar","review":"Es fácil de instalar."},{"name":"john morgan","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" It seems stable and fast.","review":"I'm using this memory in an HP Victus 16.1. Mine came from the factory with 8 GB, so I removed that kit of 2 4 GB sticks and installed this kit of 2 8 GB sticks. It has been a month. The laptop's been rock solid. No errors or other weirdness at all while running Windows 11. I don't overclock, so can't tell you anything about overclocking potential."},{"name":"Kaine","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Just what the doctor ordered","review":"Easy installation and set up. Even a novice and install additional memory into their devices."},{"name":"Comppaul","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Works right the first time","review":"This is a decent kit for my new build. It gives me plenty of room for opening various programs without resorting to virtual memory. Worked right with the correct settings."},{"name":"Fernando Luis","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Padrão jedec","review":"3200 MHz no padrão jedec com compatibilidade para 2666MHz caso você use um processador com controlador de memória mais limitado."},{"name":"Ng","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Excellent","review":"Worked right out of the box with a Ryzen 5 3600 and X470 Prime\nLooks good too, better in person than online reviews"},{"name":"Jorge","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Super","review":"Las encontre en un super precio y sin problema corren a 3600mhz en una placa z490 con el perfil XMP"}]},{"id":"PmBjOF","title":"G.Skill Trident Z RGB Series 16GB (2 x 8GB) 288-Pin SDRAM (PC4-25600) DDR4 3200 CL16-18-18-38 1.35V Dual Channel Desktop Memory Model F4-3200C16D-16GTZR","imageUrl":"https://m.media-amazon.com/images/I/61l4EStxhnL._AC_SX450_.jpg","price":"$75.99","description":"About this item\nTrident Z RGB Series, compatible for AMD Ryzen Series; Intel Z170 and newer.\n16GB kit containing 2 x 8GB modules, DDR4-3200, 288-Pin, CAS Latency CL16 (16-18-18-38) at 1.35V\nBrand: G.Skill, Series: Trident Z RGB, Model: F4-3200C16D-16GTZR\nECC: No, Dual Channel Kit, Recommended Use: High Performance or Gaming Memory\nXMP 2.0 profile support to reach up to the rated overclock speed, or run at default JEDEC profile speed\nRated XMP frequency & stability depends on MB & CPU capability\nCheck G.Skill QVL or RAM Configurator on the G.Skill website for validated motherboards","reviews":[{"name":"ken schimmoller","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" works with AMD!!!","review":"This is for  G.SKILL TridentZ RGB Series 16GB (2 x 8GB) (PC4 25600) F4-3200C16D-16GTZR  compatability fix with AMD!\n\nFor anyone having issues, as I have seen comments, issues, concerns about it not working with ryzen/ AMD motherboards at posted speeds.\nFor some, not getting it to post at the 3200 advertised speeds... and maxing at 2933.\n\nPlease make sure that your BIOS is up to date!\n\nThis was a issue that I had ran into, and was a SIGNIFICANT increase to what I was using originally, but was stuck at 2677 (or whatever that speed is). Once I got it to the new BIOS, it posted (with a quick change) to the 3200.0!!\n\nSo no more having to worry or freak out about not working with ryzen.\nPlus they just look BAD ASS in your rig!!\n\nP.S.\nI run a MSI X370 SLI PLUS\nAMD ryzen 7 1700\n\nJust please make sure you are running the latest BIOS ladies and gents!"},{"name":"CactusKiller","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" These work great with MSI AM4 mobo's","review":"These work great with MSI AM4 mobo's. I bought these for my wifes build. They look figgen awesome! Once you get the app to work correct. Which when you download it DO NOT unzip the file. First right click and select properties. Then in the general tab go to the bottom and check the unblock. If you don't do this you will get an error from the app for some reason because it can't detect the memory. After I did this I was able to launch the app."},{"name":"Charles Prince","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Exceptional RGB RAM, plays well with AMD/Ryzen builds","review":" First product from G. Skill, definitely impressed! Fast RAM, the RGB lighting effect is awesome!\n\nPROS: High quality product, easy installation. RGB lighting is top notch and a real head turner. Works well with AMD/Ryzen builds (*see note below).\n\nCONS: Control software is questionable, will lighten your wallet a bit.\n\n*FOR AMD/RYZEN BUILDS: You will need to have the latest bios update for your motherboard (AGESA 1.0.0.2a) to get full RAM speeds, as well as enable XMP or manually set timings/voltage in the bios. I have this RAM running with a Ryzen 5 1600 on a MSI B350M Bazooka mobo, with the latest bios update and XMP set to profile 2. I'm getting 3200 Mhz with no issues. Having the latest motherboard bios update is critical, you may not get the full memory speed without it.\n\nYou can download the RGB control software from G. Skill's website, but be forewarned that some users have had problems with it causing crashes and memory corruption. G. Skill specifically states on their website that the software should not be used in conjunction with other RGB control programs like MSI Mystic Light and ASUS Aurora. I deleted Mystic Light before trying the software and was able to run it just fine. The software gives you excellent control of the light effects and has many options for customization. Be aware that even if you don't use G. Skill's control software, the RGB lighting on the RAM sticks will still function fine, they default to a rainbow pulse effect."},{"name":"Matthew C","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Best looking RAM on the market and works with MSI motherboard","review":"I'm using this on the MSI B350 Tomahawk Arctic and it works fine, color presets and all. Even though it's made for Asus motherboard I think. You just need to go to TridentZ's website to install the program to control the RAM color. My motherboard can run these at 3200 MHz no problem and I'm using the Ryzen 2400g. Having it pulse with the music is pretty sweet too."},{"name":"CoryKickzAss","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Stable and Running Strong","review":"I bought these two sticks a few months ago and installed them to match another 16GB kit of the same RAM already in my PC. I installed the 2 extra sticks and have run it w/o any issues (now I have 32GB). The XMP profile is active and I play a lot of Rust and heavily modded Skyrim and/or Fallout4. So they're quite heavy on RAM use, but I have had no issues even with the RGB software running in the bg.\n\nI love the set and would recommend it to anyone on the fence. Price wasn't bad and its been pretty stable for me.\n\nEdit: It is about 9-10 months later and my PC is still running strong. I play a lot of Cyberpunk, Rust and Rocket League.. and I've had zero problems. Still love the colors too (fully controllable)"},{"name":"Jared Armbruster","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great RAM for Ryzen based systems","review":"So first of all this RAM is fairly easy to install, as it should. Just make sure you place each DIMM in every other slot so that it runs in dual channel. It takes some tinkering with A-XMP profiles to get the advertised speed. Also, you may want to save the settings in BIOS first, shut down the PC, then start it again from a cold boot. Hitting Save and Reboot after increasing the RAM speed in the BIOS may cause a boot loop. Again, set the RAM speed in the BIOS, save settings, power the PC off, then power it back on again. Either way this RAM pairs great with Ryzen CPUs once you get it stable. Ryzen processors almost always have higher performance with faster RAM, even with more CPU cores and threads. This is also some of the most visually appealing RGB RAM on the market, and for less $100 at the time of purchase.\n\nOverall if you're looking for fast RAM to pair with any Ryzen CPU, I would highly recommend this."},{"name":"KillaBeeWess","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Beautiful ram","review":"Easy as can be, synced with aura on first startup. Exactly what I needed for my rgb build.\nRunning: Asus ROG Strix z370 e rgb mobo\nI7-8700k cpu\nAorus 1080ti gpu\n6 Corsair LL RGB Fans\nCorsair led strips\nCorsair 240mm liquid cooling\nCorsair pro controller\nCorsair 570x case\nCorsair 850w gold psu\nI tried Corsair vengeance pro rgb but iQue gets into a fist fight with Asus aura over RAM slot rgb they are not comparable. I am now a g.skills guy for life.\nMy entire rgb build only needs Aura and IQue for all of my light setting and they work very well together as long as you don’t get Corsair RAM. When I did try vengeance rgb pro it shorted out my mobo rgb but the ram did work. Seeing both up close and personal within the last couple days I don’t care that the Corsairs had a problem. These g.skills look even better"},{"name":"Tabitha","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Pretty and functional","review":"Love these, the RGB's are really something! They sync well with my Asus Aura software. I have these on a Crosshair Hero VI mobo. I bought the wrong type (I needed the ones for AMD not Intel) but they seem compatible thus far."},{"name":"Blaze","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Fantastic 'vanity' memory","review":"These things look quite nice, as you might expect, with a reasonably high RGB LED density under the light diffuser, two-tone heat spreaders and pleasing design. The memory itself is also high perfoamance, running at 3200MHZ with tight latency timings. Note that you will have to go in to your motherboard settings and manually set up the memory speed, either directly or through the XMP profile.\n\nPlease note, however, that I run a Ryzen system - I wasn't aware of this before I made this purchase and had to do a lot of troubleshooting, but Ryzen systems (particularly 1st gen) do not play nice with high speed memory. After much tweaking and overvolting, mine runs stable but only at 3066Mhz.\nI am not factoring this in to my review score, as this was a lack of research and user error on my part - but if you are buying this for a Ryzen system, consider saving money and buying the 3000Mhz kit instead. Most ryzen systems flake out above a memory frequency of 2988Mhz or so, so buying a 3200Mhz set of memory is likely to not work properly at its rated speeds unless they are made specifically for Ryzen - which these are not.\nThe silicon lottery does factor in to this, so you might be able to get high speed memory to work fine for you, but I could not."},{"name":"The Quick Stop🛑","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Lo que no me pase a mi...","review":"Lo último!...\nLa cara de palomo que se me ha quedado cuando abro el paquete de las memorias (precintado y con pegatinas de gskill) y me encuentro esto. UNA PLACA DE METAL!!!... Es una broma?, un timo? Producto vendido y gestionado por . Esto no me ha pasado en 15 años de compras por internet. Y yo que pensaba que lo de comprar un iPad y que te enviasen una piedra solo pasaba en segundamano. Mi última compra en Amazon, y el Prime... pues lo va a renovar sup****madre!!!\n\nEn cuanto al producto en cuestión tengo otras memorias de esta marca y son de lo mejorcito que hay, trabajan a 3200 MHz activando DOCP en placas Asus y XMP en gigabyte. Probado en ambas con procesador Ryzen."},{"name":"Lee","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great compatibility with X470 / 2700X","review":"The kit I received uses Hynix chips, this was a bit of a surprise as I had assumed they are mostly Samsung B Die, however no issues at all reaching 3200mhz with XMP and beyond on X470 with a 2700X.\n\nI'm currently running them at 3466mhz with the basic 16-18-18-38 timings at 1.376v and it passes prime95+Heaven running together for several hours.\n\nOverall they are a little pricey, but performance is great and the look great, when I have more time I'll try messing with tighter timings."},{"name":"Fruity","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" They run like lightning and the lighting is beautiful","review":"Works wonders, great RGB lighting, and totally good value for money.\n\nThe installation was very easy, did have to take them out once or twice due to them not making contact very well at the start. A bit difficult to pull out if they are side by side. Other then that, they work wonders. Upgraded from 2133 mhz RAM's to these 3200's. So many FPS gains.\n(Gamer :P)"},{"name":"Eren Kotan","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Quality RAM. You certainly get what you pay for","review":"I bought two of these kits for 32 GB of RAM for my MSI Z390 motherboard and Intel 9700K CPU. These DIMMs look beautiful and feel sturdy, they're very well made. They're not the cheapest on the market, but they're excellent quality. No trouble hitting the advetised speed just by enabling XMP mode in the BIOS. Stress tested using OCCT, memtest, y-cruncher and some Doom Eternal for hours and they passed with no errors. RGB LEDs work as advertised and I can control them using my motherboard's own RGB lighting control software, which is very convenient. Highly recommended."}]}]