[{"id":"Hz3qYk","title":"Micron 5210 Ion SSD | MTFDDAK7T6QDE | 7.68TB | Qlc | SATA 6GB/S | 2.5-Inch Enterprise Solid State Drive","imageUrl":"https://m.media-amazon.com/images/I/413yAwtc92S._AC_SX450_.jpg","price":"$1,079.95","description":"About this item\nCompatibility: 2.5-Inch form factor size for capacity-dense storage, SATA III 6G interface\nPerformance: storage space of 7680GB, qlc NAND flash Type for endurance & Performance\nApplications: real-time analytics, big data, AI data lakes, machine and deep learning\nFeatures: AES 256-bit encryption, power Loss protection, end-to-end data path protection\nReliability: 24x7 availability, long-term lifespan, full Micron Warranty can be claimed through point of purchase","reviews":[{"name":"The_Biffster","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" We put 24 of these in a single Dell server, and...","review":"As the review title states, we bought a total of 49 of these from  back in January, 2020 -- 48 for two different 24-bay Dell R730xd servers (split backplane configuration) and one for a cold-spare.\n\nFirst, these are SATA, so still a consumer-oriented interface with zero MPIO capability.\n\nSecond, these are (intentionally) *slow* write performers, so they won't break any speed records. Also, one reviewer was incorrect -- 7.68TB SAS and SATA SSDs have been out for many years now, but these are -- by a country mile -- the cheapest unit available (as-of this writing). Samsung has had 7.68TB *and* 15.36TB SSDs (SAS) for a few years now, and their new line also has 30.72TB units (at ridonkulous prices, but they pummel these slow Microns in every measurable benchmark).\n\nThese units are great for LOW-DUTY usage. Do NOT consider HPC environments or extreme write or even mixed read/write environments. While endurance is OK for even mixed environments, performance it likely to disappoint. We're running these in 12x2 split backplane off of dual H730p 12G SAS RAID controllers, which yields a theoretical max throughput of about 96Gbps (approximately 10GB/s). For sustained, big-block media streaming these work fairly well, but don't expect SAN performance, and they're MASSIVELY short of NVMe, even in large RAID configurations (we tested RAID-0, just for kicks, and it was still wanting somewhat).\n\nThese are great for replacing disks, since 2.5\" spinning disks are small and slow by comparison. If that's your benchmark, you'll be ecstatic with these 7TB IONs. If you're accustomed to enterprise flash, you'll have to calibrate your expectations down to what you'd otherwise expect out of an $800 SATA SSD spec'd at 0.8 DWPD.\n\nBut OH! That price!"},{"name":"N. Smith","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" If you have a 10G network you need this!","review":"Finally SSD over 4TB at a sub $1,000 price! Not as fast as M.2 but 4x faster than a spindle drive. Well worth the price, especially if you run a 10GB network at home or work.\n\nPlan on about 7TB of usable space. I consistently get 350MB/sec write speeds from a PC with an m.2 drive to a server share using this drive over a 10GB network.\n\nCheck out Asus NIC's and switches for 10GB SOHO use."},{"name":"Lai Cheong Sang","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Holy Smokes, I have over 1000 steam games installed at the same time!","review":"Solved the 1st world problem of what games should keep installed on my system. Works and size as advertised."},{"name":"George Carlin's ‘Stuff’","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Works great in my CUK N950VR Gaming Laptop and in my SATA to USB 3.1/eSATA external enclosure.","review":"Works great as my multi-media storage drive in my CUK N950VR (Clevo N95TP6) Gaming Laptop and in my MiniPro 2.5” SATA to USB 3.1/eSATA external enclosure. I wouldn’t use it as a main hard drive in a PC or laptop since it’s not really meant for it, but it works great for a large storage device. My 2 Samsung 970 Evo Plus 2TB M.2’s do most of the RW work. Sometimes the Micron 5210 slows down for a while, not slow enough to disrupt gaming or streaming, I just noticed it when I have something up that measures it’s throughput, and I suspect that maybe it’s reaching a thermal index since it isn’t too far from the CPU. But that’s only when I’m running it very hard for hours like encoding with Handbrake."},{"name":"Dareshiranu","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Finally an SSD \"almost\" able to compete on price vs HD.","review":"Value. I had two 2TB Micron SSDs in a RAID until the latest Microsoft update when my drivers were de-authorized.\n\nI switched to a Barracuda and started having problems. So I got this to solve them and realized after decades of builds I had a RAM module fail.\n\nAfter sorting out my issues it works great and is a far better value than any other SSD I've found by far. And I have experience with the brand so no qualms. Plus, no RAID and almost 8TB."},{"name":"Andrew J. Waggoner","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" I love these and I'm looking forward to more from Micron","review":"Converted my NAS from traditional drives to something that could be used on the road. This was a very expensive change but Micron leads the pack with these SSD's in terms of prices and form factor for SATA driven servers.\n\nThey perform completely as expected and are a welcome change from typical HDD's. Just remember that these are QLC so they shouldn't be used for very actively written filesystems. Performance test yielded perfectly against what was expected on the spec sheet for all my drives. No surprises with these, which is exactly what I want from my server hard drives.\n\nThey also look lovely. Completely aluminum."},{"name":"Ivan","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Go for it","review":"Fantastic bang per buck. Good reliability, plenty of space, a very well-established manufacturer with good customer support in rare cases.\nThe drive performs as expected and doesn't have any issues."},{"name":"Timothy Wayne Ezell","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" works great for ps4 pro","review":"I bought this to seriously upgrade my ps4 pro. i wanted speed in uploading as well as enough storage for my over 200 digital games. this seriously fills the bill. after installing it onto my ps4 pro. you are left with 6.9tb of usable storage space. which is more than enough for what I need. but seems a bit much was reserved from what the actual item was initially intended to be (7.68tb) can't imagine it took about 2/3 of a tb just for the operating system to be installed. but as I said it's more than what i need. and i feel this is a software issue, not a hardware issue. for that point I still give this item 5 full stars."},{"name":"RORO","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" FALLO GENERAL DEL SSD TRAS UNOS MESES DE INACTIVIDAD","review":"Compre en octubre 2020 este SSD, desviando de mi línea de compra habitual, pero ayer, al realizar una actualización en mi ordenador, dejo de funcionar del todo.\nHe hecho una reclamación al vendedor… A ver que pasa. Lo probé antes de comprar 10 mas pero veo que de momento seguiré mirando otra alternativa."}]},{"id":"9oIX66","title":"SanDisk Professional 2TB G-Drive PRO SSD - Ultra-Rugged Portable External NVMe Solid State Drive, Up to 2800MB/s, Thunderbolt 3 (40Gbps) - SDPS51F-002T-GBANB","imageUrl":"https://m.media-amazon.com/images/I/51XDHa6gfiL._AC_SY450_.jpg","price":"$573.82","description":"About this item\nEdit, render and transfer faster with accelerated rates up to 2800MB/s read and 2400MB/s write (1 MB/s = 1 million bytes per second. Based on internal testing; performance may vary depending upon host device, usage conditions, drive capacity, and other factors.)\nUltra-rugged design with 3M drop protection and 1000lb crush resistance. (On carpeted concrete floor.)\nThunderbolt 3 (40Gbps) connectivity\n5-year limited warranty\nReady to go with Mac (HFS+). Works with Windows via reformat.","reviews":[{"name":"eman@USMC Retired","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Super Fast","review":"Wow, what a difference. This drive should be called hyper drive. Well worth the money."},{"name":"jeff","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" Not impressed for the money at all…","review":"I expected from the reviews that I could run 4K footage off this Ssd drive and edit it in real time… what I bought it for. But I edit on davinci resolve and it still lags hard when editing, unless there is something I haven’t done for the performance to get better. It says the it can handle 8k footage fine but yet 4K braw footage is having problems. :("},{"name":"Ahmed Elshamy","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Real Fast reliable drive from SanDisk","review":"Excellent fast drive from my sound library for use with music production. I got about 2400 MB/s read and 2000 MB/s write with AFS encrypted (which should slow down things a bit to encrypt/decrypt). Which is close to my internal drive on my 2019 Macbook Pro.\nPros:\n- Very fast drive\n- Elegant look\n- Solid TB 3 wire to the computer\nCons:\n- A bit bulky\n- Lost the nice drive icon after formatting with AFS encrypted\n\nWith M.2 SSD became faster and available at 7000 MB/s I was looking for an enclosure that uses Thunderbolt to get that speed for an external drive. All I found was unreliable enclosures claiming reaching 40 GB/s speed, but reviews were not that great. Till I found this drive from SanDisk and another one from Samsung that was not available in stock at the time. I took the risk trusting SanDisk, and I'm very happy with the purchase."},{"name":"The ROK","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Arrived broken, PC would not recognize drive, refunded.","review":"Arrived broken, PC would not recognize drive, refunded."}]},{"id":"K8Wc0a","title":"Samsung Electronics 870 EVO 2TB 2.5 Inch SATA III Internal SSD (MZ-77E2T0B/AM)","imageUrl":"https://m.media-amazon.com/images/I/911ujeCkGfL._AC_SX450_.jpg","price":"$69.99","description":"About this item\nTHE SSD ALL-STAR: The latest 870 EVO has indisputable performance, reliability and compatibility built upon Samsung's pioneering technology\nEXCELLENCE IN PERFORMANCE: Enjoy professional level SSD performance with 870 EVO, which maximizes the SATA interface limit to 560/530 MB/s sequential speeds*, Accelerates write speeds and maintains long term high performance with a larger variable buffer\nMORE COMPATIBLE THAN EVER: 870 EVO has been compatibility tested for major host systems and applications, including chipsets, motherboards, NAS, and video recording devices****\nUPGRADE WITH EASE: Simply plug 870 EVO into the standard 2.5 inch SATA form factor on your desktop PC or laptop and let the renewed migration software takes care of the rest\nSAMSUNG MAGICIAN SOFTWARE: Make your drive work smoothly with enhanced Samsung Magician 6 software that helps you easily manage your drive, keep up with the latest updates, monitor the drive's health and status, or even enhance its performance****","reviews":[{"name":"Just Saying","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" It's a Samsung SSD","review":"Clicked on add to cart in the morning, downloaded the samsung migration software from their website.\nBacked up my disk . At 5:30 PM it arrived. Started the backup. After dinner the computer was shutdown, removed the old SSD and put this one in it's place, and boom - up and running with a bigger SSD. Piece of cake."},{"name":"C. Cox","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Works great!","review":"I purchased this to replace an aging and error prone mechanical disk in my mother's old laptop. After finally getting her original drive to clone over, everything has been great. The installation was as simple as replacing the drive and turning on the computer. It starts up and shuts down very quickly, and the programs start up a little quicker as well.\n\nIf you are trying to replace your drive and copy all your files over, make sure you have or purchase a SSD to USB cable. This just has the drive in the box with some less than stellar instructions.\n\nThis is the best upgrade option in an aging system without having to buy a brand new computer."},{"name":"Deejay G.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Purely Excellent!","review":"Thus far, The Samsung 870 EVO 1TB is working flawlessly. I upgraded from the 850 EVO 500GB I purchased 5 years ago. I noticed the 850 drive performance started to diminish, not a lot; but noticeable. Once I use the Samsung Migration Software to transfer my Operating system to the new 870 EVO, the performance was night & day; purely excellent! Fast boot up time, averaging 18 seconds from a cold boot."},{"name":"Zunicat","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great SSD but Samsung copy program did not work.","review":"Drive performance is great. Better than a new PC with HDD. I replaced a spinning HDD in an ASUS all in one PC, 2016 vintage. I tried 2 different versions of the Samsung copy program. They both appeared to run the copy. Than I replaced the old C drive with the SSD and no Windows 10. Initially went to the Samsung site listed with the drive. It did not have any downloads for the 870 SSD. So I used the generic version. I searched and found another Samsung site that did have a copy version specifically for the 870 SSD. Neither worked. Finally used Acronis. It took half the time and made the copy with no problem. The original HDD was a 3.5 inch. Possibly the copy problem was caused by going from 3.5 to the 2.5 size."},{"name":"JarrodKatie","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Best SATA SSD on the market right now!","review":"After researching and reading many reviews, I knew this was the SSD I needed. My old hard drive died right after I ordered this (conveniently) and am very impressed by the performance. Read and write speeds are insane and the space it saves in the case is welcomed. Same storage space as my old HDD, but everything transfers over in no time and boots to the desktop in about 10 seconds. Highly suggested to anyone looking for an upgrade."},{"name":"Mark N","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Braindead Installation","review":"This is ~5th Samsung SSD installation over the past 5 years. All have been really straightforward installations. Assuming you've already verified that this disk fits in your laptop via 's or going to the Samsung's website or going to your laptop's HP/Dell/Lenovo website and look at the size and SATA interface type (or their offering for replacing your disk). YouTube is GREAT for finding out how to open up your laptop. Before buying the disk, I recommend that you watch the installation video FIRST to make sure it is within your skillset and toolset. The scary ones are the ones that require you to pry the shell open and I always worry that I'll break the tabs off or that I'm pushing when I should be pulling. Anyway, besides the worry, all my installations have gone well. The migration software is pretty simple. I use a USB-SATA cable (~8) to hook up the new drive. You choose the old drive, you choose the new drive, then hit GO. All in all, I highly recommend the Samsung SSDs. Make sure you install the Magician software. I really don't do much with it other than check the performance. These are solid disks with expected speed and longevity and ease of installation. I have NO negative issues with it. Oh, last minute reminder; test your old disk's speed before replacing it. Stopwatch how long it takes to get to the first logo, time to get to the windows desktop and (somewhat subjectively) time to get an app (like a browser) to paint it's opening page. The opening page times changed from 2 mins 10 secs to 41 secs. Some of these laptops are older i3 laptops so that aren't as fast as my i7 laptop that boots in < 10 secs, but they all run WAY FASTER. Buy one. Good and cheap!"},{"name":"Alicia Van Hecke","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Incompatible Disk - Wrong Sector Size!","review":"Update: Returned this drive and got the older 860EVO. This transfer really does appear to be impossible with the new 870 EVO. Samsung tech support couldn't do it. Multiple other copy/cloning companies fell short and/or replied to my queries in the negative. It looks like it may be partly tied up with the UEFI on my computer being unable to understand 4096 Byte sectors (even though once booted into Windows it can read/write). Even a fresh Windows install fails to boot. (The boot media was 256Byte, the Windows PE understood the drive - and apparently wrote to it just fine, but then UEFI was baffled once I tried to boot from it). I'm surprised that there hasn't been more outcry from folks who are trying to spruce up older computers like me and my Dell 3010.\n\nOriginal: I bought this to upgrade my HDD. But it is impossible to clone my OS to it. The original HDD has 512 Byte sectors. But this SSD has 4096 Byte sectors. Windows sees it. I have written and read from it just fine. But I have tried multiple software tools and ALL of them reject it. Samsung's own Data Migration tool says \"Not enough disk space\". Macrium Reflect says \"Incompatible Disk Selected\". Clonezilla is REALLY hard to figure out! I've written to Aomei and they say they won't do it. I've chatted with tech support at Samsung and two of their people failed to get it working. I sent them an email (as directed by one of the chatmasters) and simply got NO response at all. And the answer I got to my  question was breathtakingly thick. I'm up a creek since my Windows is tied to Dell and Microsoft doesn't provide a way to move it that I have found. Ready to return this disk. It should have been fabulous. But nobody can tell me how I can use it. Don't let this happen to you!!"},{"name":"Chris C.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" No warranty in Canada for Samsung products as they say it is the responsibility of ","review":"Below is the response from Samsung regarding failed SSD\nGreat SSD until it fails and the it's\n\nHello Customer,\nThank you for your response. Unfortunately, we were unable to process your warranty request. Your SSD 870 EVO 2TB is a Canadian model (Serial#:S620NG0R303301R ). In Canada, all warranty support for Samsung memory products (SSDs, SDs, HDDs, USBs) is the responsibility of the retailer, at the point of purchase, including online purchases. We apologize for the inconvenience this has caused you. Please take the warranty letter below to your place of purchase for further assistance.\nCanada Warranty Letter:\nssd_warranty_letter.pdf"},{"name":"Dave","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Samsung warranty not honored","review":"I had this drive for 6 months and it died. It was stated there was a 5 year warranty on this. I contacted Samsung support and after talking to 3 people, they told me,  was responsible for the complete manufactures warranty. First time I ever heard of a retailer being responsible for a manufactures warranty. They even sent me a letter to present to Amazon. Amazon was a little confused over this but has been nice enough to refund it. This is the first time I ever had to deal with Samsungs customer service. I will not deal with it again. Very suspicious practice from a large company like that."},{"name":"Chris Pollard","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Can't go wrong with Samsung.","review":"If you're upgrading an older laptop, or just replacing a spinning HDD in something fairly new, this is a solid value SATA SSD. Samsung SSD have always proven to be fast and reliable.\n\nRemember that fresh SSDs often don't appear as a drive in Windows until you do into disk management and format it! It's recognized, it just doesn't show up as a drive until you complete that step. At that point, if you're using it for new storage, it's ready to go. If you're replacing your boot drive, make sure to clone the old one first. After cloning, swap them out, reboot, and it's like nothing changed except the speed that everything loads in!"},{"name":"Gromit","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" Fast, but not reliable","review":"Updated 27 Jan 2022\n\nThe drive is 11 months old and has 6.2TB writes. It's started showing reallocated sectors, and uncorrectable errors, so I am very displeased.\n\nSamsung did some troubleshooting with me, and determined that drive had failed.\n\nRather than honouring the warranty themselves, they sent me a letter saying that it is the retailer's responsibility, and told me to send it to .\n\nI have sent this to Amazon and await their response. It seems very odd, but reading the lower star reviews, it seems that several people have had this happen. I will update again when I hear back from Amazon.\n--------\n\nReplaced an 850 EVO with this.\nMy motherboard is ancient, so I'm not getting the full benefit, but it is fast enough.\nThe 'old' 850 is now in my laptop.. 5 years old and never any issues, so I purchased this one on the basis of that reliability."},{"name":"Owilde","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" OLD Mac runs better than ever.","review":"Installed this in a 2010 MacBook Pro. WoW. It's was like the dead coming back to life. Easy install took about 20min. The transferring of data on the other had was LONG. But once done my Mac runs better than when I first got it. More than happy with its speed and size. A great investment if you're havingng space or speed issues with an older device."}]}]