[{"id":"NmCFU0","title":"MONOZO Gold Initial Bracelets for Women, Dainty 14K Gold Filled Layered Beaded Letter Initial Bracelet Personalized 26 Alphabet Disc Monogram Charm Bracelet Jewelry Gifts for Girls","imageUrl":"https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/71errqQgxyL._AC_UY395_.jpg","price":"$14.99","description":"About this item\nSIZE: Layered Gold Initial Bracelet 6”inner diameter +2\" Extension chain, with a satellite beaded chain bracelet make a layered Gold Bracelet or to simply to wear on its own.\nMATERIAL: Dainty Initial Bracelet is 14k gold filled, nickel and lead free, sturdy and durable. Never fade ,rust and tarnish. Gold initial bracelet never turn skin green.\nWOMEN BRACELET: Gold disc letter bracelet is packed with love in a lovely Jewelry Velvet bag, ready for gift giving on every occasion, Birthday, Wedding, Mother's day, Thanksgiving Day, Valentine's day, Christmas day, and Anniversary, gifts for bridesmaids, Wife, Girlfriend, Mother, Daughter, other women and girls.\nINITIAL BRACELET: This unique gold bracelet is made of hand stamped personalized initial disc charm. you can choose letters to signify your name, favorite initials, parent's names, children's initials, special phrase, or anything else meaningful.\nAFTER SERVICE: 100% Satisfaction! No Hassle, Full refund or exchange within 90 days of receipt of purchase.","reviews":[{"name":"Sharon","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Bracelet is so cute","review":"This bracelet is soooo cute! I got this for myself with my boyfriends initial on it and I love it! Definitely my style I just wish it didn’t move around a lot even when you put it to the tightest setting and I wish the bracelet was just one big piece instead of two separate bracelets because then it kinda tangles. But it’s prefect!"},{"name":"Limor","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Nice gift , very gentle and cute","review":"I liked the gentleness, came with a nice box and a cute card."},{"name":"karen","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Sweet!","review":"Delicate and classy. Adjustable too!"},{"name":"Larry Woods","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" My daughters loved them","review":"My daughters loved them, they both said they would cherish them forever."},{"name":"g","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Pretty","review":"The packaging was very well done and the bracelets came out better than I thought they would !"},{"name":"Nana","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very pretty","review":"This is a present for my granddaughter it’s very pretty I know she’ll like it."},{"name":"Reader lmf","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Cute and inexpensive","review":"For a jr high (or younger) girl, really cute. Nice small gift for Christmas. Will it last forever? No. Would an older girl or woman wear it? probably not."},{"name":"Robert & Debbie Chatman","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" So cute","review":"Dainty and so cute. Love these little gold bracelets. Perfect gift for ladies of all ages."}]},{"id":"QuC7r0","title":"14KWhite Gold Plated Initial Heart String Bracelets for Women Men Teen Girls Boys Handmade Rope Braided Bracelet Minimalist Jewelry Matching Couple Bracelets","imageUrl":"https://m.media-amazon.com/images/I/51zd5YlseSL._AC_UX385_.jpg","price":"$0.95","description":"14KWhite Gold Plated Initial Heart String Bracelets for Women Men Teen Girls Boys Handmade Rope Braided Bracelet Minimalist Jewelry Matching Couple Bracelets\nBeautiful 26 letter bracelets are perfect for matching belly dance outfits\nThe bracelet is the perfect gift for your family, lover and friends. Perfect for the beach, pool, surfing or any other occasion in summer, it's sure to give you compliments\nMaterial: copper\nThe bracelet accessories are made of copper and Braided rope, the surface is electroplated, and the color: vintage letter bracelet, durable and durable, very beautiful and shiny\nChain length Size: 30cm (adjustable Length is 8-15cm）\nThis can represent your name, but it can also represent your lover and family. Bracelet is still the highlight of clothing collocation.\nColor:\nwhat you get: 1 × bracelet","reviews":[]},null,{"id":"fkUvTH","title":"NINE WEST Women's Boxed Necklace/Pierced Earrings Set, Silver/Blue, One Size","imageUrl":"https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81M9zZH2xwL._AC_UY500_.jpg","price":"$20.00","description":"","reviews":[{"name":"Jordan Torres","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Very Good","review":"The Necklace and earrings are very pretty and my Grandma loved it as a christmas present. Though, i payed more attention do it and if looked like the diamond was close to falling out. So Pretty much this won’t last about a month."},{"name":"Lisa Swain","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Bright","review":"Love the trio. Earrings can be worn with hair down and they will be seen as they shine so bright"},{"name":"Eric","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" NINE WEST Women's Boxed Necklace","review":"i been Tight on money and i got this as a gift for my mom for Christmas and it looks really good this necklace has really good craftsmanship and for the money its a really good product"},{"name":"linda hively","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" They’re beautiful","review":"It was a gift for my ggdaughter, she loves it."},{"name":"mattman","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Jewelry Set","review":"Jewelry Set at a fair price."},{"name":"Carole L. Reed Talbert","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Works for every woman!","review":"These were gifts & they were the Bomb! Beautiful !"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great gift","review":"Shipped quickly, very pretty."},{"name":"Donna R Johnson","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very nice","review":"Very nice set and great value"},{"name":"Top.C","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Save your money","review":"Really cheaply made. Looks like its spray painted silver. Looks good from far. No where near worth the price its at. Returning to get something better."},{"name":"Sue","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Tacky","review":"Way too shiny and fake looking. I can’t wear it. Looks like something a child might like to wear. I don’t recommend this for any adult."},{"name":"VERONICA MENDEZ ZAMORA","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Es un buen producto para regalar,","review":"salió defectuoso, me comunique y dijeron que no lo iban a cobrar pero en mi estado de cuenta sí aparece el cobro, no lo regresé porque faltaban dos días para el evento en que lo iba a obsequiar y les comente que lo iba a mandar a reparar."},{"name":"LaLocaDeLasGatas","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Un detalle para tu outfit","review":"Son un bonito regalo o auto-regalo. Ojo: no son de oro, ni tampoco tienen piedras preciosas. Pero se ven muy bonitos, y son ligeros. Por el precio, están súper bien. Además, son duraderos: no se les caen las piedras ni se rompe la cadena."},{"name":"Mel M","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Bueno para regalo","review":"Lo compre a muy buen precio y lo utilizaré para un regalo"}]},{"id":"5yMC7V","title":"HELPFLOWER CH Handmade Fairy Simulation Butterfly Wing Earrings Foil Rhinestone Earring Romantic Jewelry","imageUrl":"https://m.media-amazon.com/images/I/61mmIJXwl4L._AC_UX385_.jpg","price":"$6.89","description":"","reviews":[{"name":"Momma3","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Cute","review":"I can’t give it 5 stars because one was broken I think it will be an easy fix but this should have been checked prior to shipping and was not damaged in transport it was packaged well. It is cute though"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Prettier in person","review":"These are just lovely in person! I will be looking to get other colors in the future!"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Excited but sad","review":"Very excited to get these. They’re gorgeous, but showed up broken. I will be keeping them and just supergluing the broken part on. Other than that, I love them"},{"name":"Destiny","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Not quite what I expected","review":"The pictures make them look more delicate and vibrant. They are cheap and plastic. They served their purpose but not what I was expecting."},{"name":"Nayeli","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" fragile","review":"These earrings are sooo pretty but very cheap/fragile. Mines fell on the floor and it broke so therefore be very gentle with them!"},{"name":"Lennys Mom","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Not sure of durability but….","review":"These earrings are adorable! I am a bit wary of the fragility but they are so gorgeous!"},{"name":"Alea Laughery","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Just what I was looking for","review":"These feel chunky, but they are really light. I dressed as the Ant Queen from Bug’s Life and wanted wing earrings to represent her wings. These were perfect. Just haven’t found other things to wear them with in my day to day life, so that’s the only negative."},{"name":"Emma Gold","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Magical!","review":"I already liked them when I saw them on the website. But when I got them in person I was about to cry (happy tears). They are so lightweight, carefully designed with detailed rhinestones and glitter and they look elegant. I bought them to wear to a fantasy-themed event. But, to be honest, I’ll wear them with jeans and a cute top as well! :)"}]},null,null,{"id":"kiNSQU","title":"36 Pairs Gold Earrings Set for Women Girls, Fashion Pearl Chain Link Stud Drop Dangle Earrings Multipack Statement Earring Packs, Hypoallergenic Earrings for Birthday Party Christmas Jewelry Gift","imageUrl":"https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81ho8aIItXL._AC_UX425_.jpg","price":"$17.99","description":"","reviews":[{"name":"Doni","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Good variety","review":"Great purchase for the variety. Quality to be expected with the price but you get some great pairs. This pack would also be good for those with double piercings !"},{"name":"Ivy","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect fashion jewelry","review":"Love the styles. Doesn't feel cheap. Good value for amount you get. I wasn't expecting much because of how cheap they were but I'm more than pleasantly surprised. We'll just have to wait and see how they do over time."},{"name":"Isandrina","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Muy nice","review":"Me gustaron los aretes."},{"name":"Elizabeth OBrien","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" THE BEST EARRINGS!","review":"I love love love these! Such cute styles and SO many options! Love that it comes with extra backs as well. The only downside is they don’t stay gold if you wear them often but what can you expect for the price point."},{"name":"Gheeti Nusrati","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" LOVe these","review":"I LOVE these earring sets!! They’re so cute and great for sensitive ears! The packaging and hand written note were a great touch!!!"},{"name":"Antwine jordan","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" GET THEM","review":"Love these earrings I paid 12$ for 36 pairs in love with all of them! Obviously fake but they are so cute ! 10/10🥰"},{"name":"Stephanie","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Heck of a deal!","review":"Lots of pretty earrings for a fraction of the price! Would buy again"},{"name":"Vallan Marie Lewis","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Super Cute","review":"They’re super cute but they fade fast so clear polish them"},{"name":"Jeremy Gaylor","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Exactly what you pay for!","review":"I was sooo unsure about purchasing these because it seemed unbelievably cheap for the amount of earrings you get, but, I Absolutely love every pair! Amazing deal if you’re looking for a variety of fake/cheaper gold earrings for a good price!! also came in a cute bag with this sweet hand written note :) really really happy! Thank you!"}]},{"id":"C4bmne","title":"Dainty Layered Initial Necklaces for Women, 14K Gold Plated Paperclip Chain Necklace Simple Cute Hexagon Letter Pendant Initial Choker Necklace Gold Layered Necklaces for Women","imageUrl":"https://m.media-amazon.com/images/I/513jmV-V1aL._AC_UX385_.jpg","price":"$14.99","description":"SIZE: Size of the gold paperclip chain initial necklaces is 18\"+2\" extension, and the layering paperclip chain necklace is 14\"+2\" extension, perfect dainty layered necklaces initial necklaces for women girls wear.\nMATERIAL: Made of high quality brass material, 14K real gold plated, nickel free and lead free, no harm to skin.\nLAYERING INITIAL NECKLACES: Gold layered paperclip chain letter initial necklaces set with hexagon charm, engraved with initial and heart in back and front, large initial pendant dainty necklaces for women teen girls jewelry.\nPERFECT GIFTS: Comes with an elegant free gift necklace box, perfect gifts jewelry for women girls teen girls wear....\nAFTER SALE SERVICE: 180 Days after sales service and exchange, reply you within 24 hours to solve your problem.","reviews":[{"name":"Peyton","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Gorgeous","review":"Rose gold is probably my favorite thing in the entire world. So when I saw this, I knew I needed to have it. I’ve worn it 24 seven for about two weeks now and it has not turned my skin green or faded in color at all. I’ve even worn it in the shower, and it is still fine. I wouldn’t recommend showering with it, but I’m just saying that I do and the necklaces haven’t been affected. I have received many compliments on it, and was very satisfied with my purchase."},{"name":"Hillary","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" AMAZING AMAZING AMAZING!!","review":"I had actually ordered from this company before and got the gold initial bracelet (which is also very amazing). The quality of this necklace is unbelievable. It feels so expensive and looks amazing. I have worn the necklaces of course together as well as separate and I absolutely love it! It comes so nicely packaged. Hands down 10/10 recommend! It is so so so nice! Does not look cheap at all, does not feel cheap, nothing about it says cheap. So if you are giving it as a gift, it comes in a cute little black box and then each necklace is in its own back and then those bags are places in another bag. A small shinning cloth is in the box as well. It's incredibly nice. Love this company!"},{"name":"Brianna","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Good for price","review":"I’m very skeptical buying stuff off  especially jewelry and clothes. The color is very yellow gold and the material feels cheap almost like plastic. However for the price I love it. It adds a lot to a lot and I would recommend.\nI also got sent the wrong letter and this company sent me the right one immediately."},{"name":"nicolle clark","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect","review":"I bought this to wear to a wedding and have worn it everyday since the wedding. I get compliments on it all the time. I shower with it on and it has not changed or tarnished. Amazing for the price. Love wearing the smaller chain by itself too."},{"name":"Lacey","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Durable, but looks nice","review":"I have gotten soooo many compliments on my necklace. People were asking me where I got my necklace because they had paid a lot of money for theirs and theirs broke within the same day/week. I have a 9 month old boy who pulls on my necklace multiple times a day, and still staying strong with no issues. I love it and it is such little cost for this! And it looks so nice!"},{"name":"EiMadeULook","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Trendy","review":"The gold is deceiving - looks a tiny bit more rose gold than other gold necklaces I have, which makes it hard to mix and match with other necklaces. I do like that they are separate necklaces and not attached."},{"name":"Laura young","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Cute necklaces","review":"I will say these necklaces are very cute! However, if you have sensitive skin, they may not be for you. I do not like taking necklaces on and off again, and this necklace tends to leave me with rashes because of it. Otherwise, good quality necklaces."},{"name":"Taylor C","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Doesn’t rust","review":"I’ve had this necklace for a while. It’s great for Layering and it hasn’t rusted yet hoping it never rust would buy another if I lost it"},{"name":"Anita Bock","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Lovely","review":"Love this necklace set, seems to be lasting well without discolouring so far"},{"name":"Shirley Heng","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Good quality Jewelry. Value for the the spend.","review":"As advertised. Looks like the pic provided. Good quality and came nicely packed. Will be great as gift. A lot of details put into this precious handmade Jewelry."},{"name":"Anonymous","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Amazing quality, I’ve had so many compliments!","review":"I love love love these necklaces!"},{"name":"Molly","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Beautiful necklace","review":"So lovely, great quality.\nWorth the money have bought more necklace's from this collection."}]},{"id":"GTFi6S","title":"fxmimior Dainty Boho Gold Silver Chain Bracelets Set for Women Adjustable Fashion Beaded Chunky Flat Cable Chain Punk Bracelets Jewelry for Women Girls Gift Set of 4 (Silver)","imageUrl":"https://m.media-amazon.com/images/I/61uBt8606zL._SY355_.jpg","price":"$8.60","description":"","reviews":[{"name":"Sam","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Cute","review":"Cute👍"},{"name":"elizabeth","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Good gift idea !!","review":"I am satisfied w/ the quay for the cost of the gift !!"},{"name":"Gary runion","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Worth the money","review":"Very pretty"},{"name":"alicia","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" No like","review":"El tamaño es pequeño, la calidad no es muy buena ."},{"name":"Barbk65","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Very cute!","review":"Very cute on, but very hard to get in and off. Wish there was an easier way!"},{"name":"JDizzle1001","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" I'm in love","review":"Very light weight and stylish. Also came with long extenders. Not exactly what I expected but it'll work!"},{"name":"Maria Lisa","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Boho Bracelets","review":"I ordered in silver and I just wasn't thrilled...gold probably looks much better. One bracelet was missing. Had to return as I don't wear gold."},{"name":"doccom","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" Looks cheap","review":"This is the first article of jewelry that I've bought from  that I don't like"}]}]