[
	{
		"id": "5yubcC",
		"title": "MAIBAOTA 10 Pcs Crystal Necklace Healing Amethyst Crystals Carnelian Chakra Necklaces Evil Eye Necklace Vintage Hippie Wiccan Boho Rose Quartz Obsidian Moon Sun Jewelry Heart Gemstone Aventurine Turquoise Pendant for Women Wholesale",
		"imageUrl": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/71aynpoPjkL._AC_UX385_.jpg",
		"price": "$17.99",
		"description": "★10 Pcs Crystal Necklace Set Originally designed by Mai Baota Jewelry Store★★10 Piece Crystal Necklace Set in a {gifted} velvet bag and Mai Baota unique gift box★if you have any product questions, you can always contact us via  contact us.\nThe 10-piece healing crystal necklace 7 chakra necklace, evil eye necklace, vintage sun moon necklace, amethyst necklace, rose quartz necklace, rose quartz heart necklace, carnelian necklace, obsidian green aventurine necklace. A variety of vintage style hippie boho fashion necklaces that are very beautiful you can match with different styles of clothing.\nThese crystal pendant necklaces in different shapes and fashion styles are suitable for mom, girlfriend, wife; perfect surprise gift for birthday, christmas, mother's day, valentine's day, anniversaries, etc.\nNatural energy healing crystal necklace pendant, can make you feel calm and relaxed, help you focus, keep your mind clear, relieve stress and anxiety, lift your spirits, get rid of dullness and boredom, and also bring you good luck and health.\nHealing Crystal Necklace Jewelry is made of stainless steel alloy and energy crystal, it is sturdy quality, very stylish, not too heavy, very easy to put on and take off.",
		"reviews": [
			{
				"name": "clokanut",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Better than expected",
				"review": "These are great! For the price, the quality is definitely better than expected. Personally I'm not a fan of the string/necklace options they sent but I just switch out the pendant on my favorite string anyway so it works perfect. These are great for work and play and there's one to match every outfit!"
			},
			{
				"name": "Crystal Beysselance",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Two if the silver chains were broken when they got here.",
				"review": "Christmas gifts for my daughters however the chains obviously make some nice crystals look cheap."
			},
			{
				"name": "Sara",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " I love them",
				"review": "I got them for Christmas for both myself and my mom/friends and they are SO CUTE"
			},
			{
				"name": "doreen munson",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Excellent products and customer service",
				"review": "Love all products ordered. Will definitely\nContinue to order from !!!"
			},
			{
				"name": "David Michael Smith",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great Gift!",
				"review": "This was a birthday gift for my granddaughter and she loved it. Very nice packaging. Beautiful stones."
			},
			{
				"name": "Toy",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Really cute 🥰",
				"review": "Cute crystals...I let them sit in the sun for a few hours...watched them kinda change colors and it brought out some flakes and highlights..."
			},
			{
				"name": "Chris hill",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Prefect gift",
				"review": "My daughter love these necklaces and wears two or more a day. She hasn't missed a day without her crystals since getting them."
			},
			{
				"name": "joseph arcuri",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Very nice!",
				"review": "What a great deal. Looks great not cheap stuff. Very well made and the chains are better than expected."
			},
			{
				"name": "KFjeld",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Very nice!",
				"review": "I love this product, would have given a 5star, only one thing missing. A description of each crystal and the healing power behind them would be great for people who are new to Crystals"
			},
			{
				"name": "LESLI CHRISTIE",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " A gift for your heart ♥️",
				"review": "I’ve just come back from the post office.\nI went outside in the fresh air and sat underneath my Tree. (I wanted to charge my crystals in todays sunlight.) I sat down on the crunchy fall leaves, smiled, breathed deeply, and opened the beautiful red box. Inside was a Heartfelt note to me. It felt personal and I smiled as I read it. I then flipped the card over and read it again. These are Very pretty talisman 😍(in my opinion) and I love the care put into the packaging. Thank you so much! What a bargain for the joy it brings."
			},
			{
				"name": "Linda Vespera",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful",
				"review": "I buy this stuff all the time and this id one of the most beautiful sets ever! You simply cannot beat the price!! I absolutely love it and will buying this as gifts in the future!!!!"
			},
			{
				"name": "Purple Lavender",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "2/5",
				"reviewTitle": " Arrived broken",
				"review": "The pendants are cute but the black cords arrived broken which is disappointing."
			},
			{
				"name": "Monica Frigon",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " beautiful",
				"review": "well made, only one is fake. (the white one)"
			}
		]
	},
	{
		"id": "neZEiK",
		"title": "PAVOI 14K Gold Plated Crystal Birthstone Bar Necklace | Dainty Necklace | Gold Necklaces for Women |",
		"imageUrl": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/51QZVt8RWoL._AC_UX385_.jpg",
		"price": "$13.95",
		"description": "",
		"reviews": [
			{
				"name": "Alazae",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Very surprised!",
				"review": "This is a really good necklace. I’ve had it for on for a good while and there is no green around my neck what so ever and I have forgotten to take off at time and I have it on with me in the shower sometimes. It’s very durable and Is very classy and simple. I most definitely will be buying my mom and sister one for Christmas."
			},
			{
				"name": "Carolina Mead",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Cute thing",
				"review": "Very cute!!! I loved it."
			},
			{
				"name": "maggie13",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great so far!",
				"review": "I bought this to replace my “through thick and thin” friendship necklace from another brand because the finish was worn on the other necklace. The price of this necklace was great, and it seems to be of good quality so far!"
			},
			{
				"name": "PR",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Perfect dainty necklace",
				"review": "I refuse to hop on the initial letter necklace train. This is perfect, can wear it with anything. Very dainty and simple. Could easily wear with other necklaces. Seems like great quality for the price! Easily a personable giftable gift for someone. I love it."
			},
			{
				"name": "MorganB",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Long lasting.",
				"review": "Has not turned my neck green. Minor to no scratches. Can wear in the shower."
			},
			{
				"name": "La",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Worth it",
				"review": "I'm allergic to fake jewelry but this one is worth it! It's a little small but it is worth it"
			},
			{
				"name": "Chrissy C",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Nice quality",
				"review": "This would make a great gift for a young girl. It's cute and dainty. The gold is a beautiful color and looks real. Very well made. My only complaint is that it is too light weight for me. If you are on the thinner side then this necklace will fall around your neck perfectly. If you are on the chunkier side, then it won't lay correctly and you may end up trying to adjust it all day long which can be annoying. But overall a great product, quality and very beautiful. I've gifted this item to 2 young girls and they loved it :)"
			},
			{
				"name": "SilvyaK",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Elegant and classy",
				"review": "This is my new favorite statement piece. You can adjust the length to fit your fashion. Trendy and classic!"
			},
			{
				"name": "Jennifer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Bonito",
				"review": "Muy bonito delicado y sutil, se ve muy bien y llegó rápido."
			}
		]
	},
	{
		"id": "sLViS4",
		"title": "PAVOI 14K Gold Plated 3mm Cubic Zirconia Classic Tennis Bracelet | Gold Bracelets for Women | Size 6.5-7.5 Inch",
		"imageUrl": "https://hbr.org/resources/images/article_assets/2019/11/Nov19_14_sb10067951dd-001.jpg",
		"price": "$15.45",
		"description": "About this item\nTennis bracelet featuring round 3mm AAA+ cubic zirconia stones in four-prong basket settings. Measures 7.0 inches in Length\nCubic Zirconia set in Lead-free, Eco-friend and hypoallergenic setting. This stunning bracelet is then Gold Plated to ensure a long-lasting and brilliant finish.\n✦ MADE WITH LOVE ✦ This unique and heartfelt product is beautifully packaged and ready for giving. Makes a sentimental surprise for any awesome lady. Great gifts for Mom or Grandma on Mother's Day, anniversary, birthday, or wedding celebration.\n✦ 90 DAY GUARANTEE ✦ To Ensure Your Complete Satisfaction, We Offer a 90 Day No-Questions-Asked Money Back Guarantee. All the metals we use are lead free, nickel free and hypoallergenic. Excellent customer service. PAVOI 100% guarantees your satisfaction.\n✦ PROUDLY AMERICAN OWNED ✦ We are an American owned and operated company! Please search PAVOI on  for more of our designs!",
		"reviews": [
			{
				"name": "Ashley",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Love it :)",
				"review": "I love how simple and dainty this bracelet is! My boyfriend got it for me as a graduation gift and it seriously is so cute! I have worn it in the shower, while doing dishes, washing my hands, etc., and it hasn’t tarnished at all. I have super small wrists, so it is a little loose on me even though I have the XS size. It doesn’t bother me that it’s loose though. If you are looking for a gift for someone, this is a great option! It matches well with other jewelry and is a staple piece."
			},
			{
				"name": "Clara",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Wow",
				"review": "If you’re thinking about buying it, buy it. If you’re thinking it’s going to be poorly made, look cheap, gaudy, or costumy; it doesn’t. It’s beautiful, really well made, exactly as shown- actually it looks better in person. I’ve never heard of this company before, but I will be buying more pieces from them. I’m blown away by how nice this bracelet is when I paid so little. It’s a heck of an  find !"
			},
			{
				"name": "Maria",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Very pretty, but not long lasting",
				"review": "I think this is a great bracelet because it is very pretty and wasn’t too expensive. I wore it a lot this summer, but after a few months I noticed that the gold metal was starting to rub off and stain the skin on my arm blue. This is probably my own fault because I would often wear it while swimming or taking a shower, so maybe try not to get it wet."
			},
			{
				"name": "Jazmyn Cuellar",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Barely fits me as a 13-year-old runs very small",
				"review": "I would love this if it would fit but unfortunately it doesn’t so I will be returning it but it would be an awesome gift for your friends or family members just remember it runs small."
			},
			{
				"name": "Meri Michelle",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Wow!",
				"review": "This is absolutely stunning! It's definitely a quality bracelet, so sparkly. I wasn't expecting much at this price point, but I am pleasantly surprised! I can't wait to see my daughter's face when she receives it for Christmas."
			},
			{
				"name": "lives in Washington",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Great size for smaller wrists",
				"review": "Everything is good about this bracelet except the clasp, I think other reviewers mentioned the same. They were right, super super tight, you definitely won't lose it but you might break your fingers opening and closing it. Almost sent it back but it was so reasonably priced and hit all my boxes for everything else, size, length, shine. Time will tell how it wears, can't review that yet, and if the clasp loosens up. Overall good, certainly not for older fingers."
			},
			{
				"name": "Linda L Skroch",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " I like it 👌",
				"review": "It was a birthday gift for me!"
			},
			{
				"name": "dwiffiee",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Gorgeous…",
				"review": "Absolutely gorgeous. It says to take off before bathing, washing hands or dishes or putting lotion on. I would if I could but the clasp is sooo hard to open, I will take my chances."
			},
			{
				"name": "Cliente ",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Perfect!",
				"review": " Stunning! I’ve been searching high and low for a tennis bracelet but didn’t want to break the bank plus these often come in very big sizes and my wrists are small, this one fits me perfectly (6,5 inch) hope it holds up nicely over time :)"
			},
			{
				"name": "Yuliana",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Very sparkly!",
				"review": "Read lots of good reviews about this bracelet and decided I need it also. It's very very sparkly! Not sure though about it looking like read diamonds as one lady wrote about silver one...\nOn photos I took on Pandora bracelet for comparison, as for me smaller stones would look better on this bracelet. It's bit not my taste so presented to my sister and she loves this bracelet!"
			},
			{
				"name": "weepollypocket",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Absolutely stunning tennis bracelet",
				"review": "Absolutely stunning tennis bracelet. The clarity and sparkle that comes from it beautiful.\n\nI've worn it everyday, even worn it in bed overnight and my wrist has no funny colours on it like other cheap imitations."
			},
			{
				"name": "Angela",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great quality and sparkly",
				"review": " Excellent quality, well made and very sparkly. Looks sparkly and complements my jewellery"
			},
			{
				"name": "tanith",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Wow!",
				"review": "What a find! Wanted an everyday bracelet that was a touch a glamour without being over the top. Got the white, 7.5in wrist - perfect, not too OTT, nice movement, easy clasp, believable size, great price. If the reviews are anything to go by, this will be a winner and will definitely get another."
			}
		]
	},
	{
		"id": "DcxI_0",
		"title": "Cubic Zirconia Hypoallergenic Stud Earrings for Women Men Girls Statement Cartilage Fashion Surgical Steel Helix Earrings 5 Pairs",
		"imageUrl": "https://hbr.org/resources/images/article_assets/2019/11/Nov19_14_sb10067951dd-001.jpg",
		"price": "$8.49",
		"description": "",
		"reviews": [
			{
				"name": "Taryn",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Very comfortable when sleeping in them",
				"review": "These earrings are very comfortable to sleep in. You don’t even know you have them in. I have a difficult time with anything but 100% silver or gold earrings. My ears will hurt and turn red. These earrings are not only comfortable, but they do not affect my ears at all. There’s no redness or pain. The flat backings are screwed onto the post of the earrings. It’s a catch 22, what makes them comfortable is also difficult to screw on to the post because they’re so small, as pictured. I have not removed them since I put them in and every other day I will confirm the backings are still tight."
			},
			{
				"name": "Samantha",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Awesome earrings except for small drawbacks",
				"review": "Great earrings that work as advertised with twist on backs! I just had to take a star for the few drawbacks which included one of the pairs being so tightly screwed on that I cannot physically remove the backs at all to wear the earrings, and also it being quite difficult to screw on the earrings blindly by feel (especially with the smallest pair). Once I got them on, no issues though.\n\nPhoto is of smallest pair and 2nd largest pair. The middle size pair is the one that I can’t get unscrewed at all :/"
			},
			{
				"name": "Dianne M. Rollo",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Pretty good- backing is tough",
				"review": "Just got them so I don’t know if they will turn my ears colors yet.. the back is very hard to get on- you have to twist the backing to get it on.. very hard for my top cartilage hole. They are pretty though and many sized stones"
			},
			{
				"name": "Jo",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " no irritation",
				"review": "My piercings are about 6 months old so I am still trying to put decent metal in them. These have given me zero issues. The variety of sizes was very helpful to figure out what looks best on me.\n\nThey have a nice sparkle to them and the backs have stayed in place"
			},
			{
				"name": "Shally F 🌱",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Simple and cute",
				"review": "Got these for my daughter grateful it seems to be good quality , the backs for the earrings threw me for a loop because I’m so used to the original ones but they’re much more secure especially for a wolf sleeper or someone who is often losing the backs to their earrings ."
			},
			{
				"name": "Melissa Foster",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Flat back",
				"review": "The back can be a little difficult to put on because you have to screw them in. I workout, shower, and sleep with these in."
			},
			{
				"name": "A",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Missing pair.",
				"review": "These were just delivered and there is a pair missing. Packaging wasn’t damaged, just the one pair seems to have been missed."
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Difficult to get the backs on.",
				"review": "Very pretty. Very comfortable. Great for those whose piercings close up. Only problem, and a bit of a big one, is getting the earring backs on and off. The backs are so smooth and tiny that it is very difficult to grip them and twist. Takes a long while to finally get them on. Having magnetic backs (that also twist into place) would be much easier to work."
			},
			{
				"name": "Dani",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Love these earrings! Flatback labrets for life!",
				"review": "These earrings are fantastic, this is the 5mm and 3mm I have in. My ears have always been very easily irritated and I have had these in 24/7 for 3 weeks and not an ounce of irritation. They are also extremely comfortable to sleep in because they are flatbacks. The back unscrews rather than the front so they are easy to put in."
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Better quality than expected",
				"review": "For the price, I wasn't expecting much. But these are actually really lovely! They're well made, strong and secure, the gem is very sparkly. There's a good variety of different sizes.\nI've used two pairs so far (in 2+ months) and slept, showered, exercised etc with them in. There's been no discolouration and the screw end has stayed tight!\nThey are quite fiddly to get the back on, so don't do it in a rush or when you're stressed. But worth it when they're in and you don't have to worry about them again for a while!"
			},
			{
				"name": "MissPRae",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Good product",
				"review": "I have worn this in my ears now for months (four earrings). No issues with the backs coming off and I wear them in bed and showers.\n\nI do not recommend these if you intend to take them out daily as the backs are fiddly\n\nSome of the backs I received did not work and the threading had gone so they spun and did not tighten.\n\nYou have to screw them on at the right angle or they won't stay on. Once out on correctly they don't budge.\n\nAs you get so many for the price I feel it's very good and a couple of backs not working did not bother me as majority did.\n\nAlso they look expensive and I have no reaction. I am severely allergic to nickle and no reaction at all to these so very happy"
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Rose gold studs",
				"review": "I love these earrings, I have very sensitive ears , I can only wear sterling silver or 9ct gold, I got these earrings as it said surgical steel and hypoallergenic, said I'd give them a go I have them in my ears nearly a week and I am not allergic to them. And I can also sleep with them in and they don't jag me as they have screw back on."
			},
			{
				"name": "Jon Bridges",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " No worry stud earrings",
				"review": "Bought this for my girlfriend, her words...\nI have been suffering with infected ears for years. I stopped wearing any and as a result my earring holes had to be pushed through every time I wanted to wear some. I needed a solution to keep the earring holes open but without infection and this product really delivered. I have been wearing them for weeks now and no infection. Popping them in for the first time was a bit fiddly but it is true that you are better off doing it without the mirror. I tighten them once in a while but they stay put even so I shower everyday, had several pool days and work out 5-6 days a week."
			}
		]
	},
	{
		"id": "XqGkFD",
		"title": "Dainty Layered Initial Necklaces for Women, 14K Gold Plated Paperclip Chain Necklace Simple Cute Hexagon Letter Pendant Initial Choker Necklace Gold Layered Necklaces for Women",
		"imageUrl": "https://hbr.org/resources/images/article_assets/2019/11/Nov19_14_sb10067951dd-001.jpg",
		"price": "$14.99",
		"description": "SIZE: Size of the gold paperclip chain initial necklaces is 18\"+2\" extension, and the layering paperclip chain necklace is 14\"+2\" extension, perfect dainty layered necklaces initial necklaces for women girls wear.\nMATERIAL: Made of high quality brass material, 14K real gold plated, nickel free and lead free, no harm to skin.\nLAYERING INITIAL NECKLACES: Gold layered paperclip chain letter initial necklaces set with hexagon charm, engraved with initial and heart in back and front, large initial pendant dainty necklaces for women teen girls jewelry.\nPERFECT GIFTS: Comes with an elegant free gift necklace box, perfect gifts jewelry for women girls teen girls wear....\nAFTER SALE SERVICE: 180 Days after sales service and exchange, reply you within 24 hours to solve your problem.",
		"reviews": [
			{
				"name": "Hillary",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " AMAZING AMAZING AMAZING!!",
				"review": "I had actually ordered from this company before and got the gold initial bracelet (which is also very amazing). The quality of this necklace is unbelievable. It feels so expensive and looks amazing. I have worn the necklaces of course together as well as separate and I absolutely love it! It comes so nicely packaged. Hands down 10/10 recommend! It is so so so nice! Does not look cheap at all, does not feel cheap, nothing about it says cheap. So if you are giving it as a gift, it comes in a cute little black box and then each necklace is in its own back and then those bags are places in another bag. A small shinning cloth is in the box as well. It's incredibly nice. Love this company!"
			},
			{
				"name": "Emma Dendy",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great inexpensive necklace set!",
				"review": "I wear one or both of these necklaces all the time now. They have become a go to because they are so versatile. I will note that I have added my own extender to the shorter, paper clip style, necklace to make it fit better. I feel like these are surprisingly good quality given how affordable they are. I have had no quality issues, however, I do not sleep or shower in these necklaces. I would highly recommend this set as a great addition to anyone’s jewelry collection. I have gotten a lot of compliments."
			},
			{
				"name": "Sparky926",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Trendy and Looks exspensive!!!!",
				"review": "I love this necklace set! I get so many compliments on it! I wear it daily then take it off at night and I don’t shower with it and it still looks brand new after a few months!! I have seen many woman with this same necklace. It’s trendy and versatile. I can wear them separately and both have adjustable length. One of my favorite purchases from  ever!"
			},
			{
				"name": "Kgraves'08",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Favorite piece(s) of costume jewelry",
				"review": "I find myself reaching for this on many day to day casual occasions, and a little more dressy occasions as well. I like the weight. Holding up well over time, so far. Minimal tangling and easy to de-tangle. Sits well on the collar bone/upper chest."
			},
			{
				"name": "Dee",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " So cute",
				"review": "Wanted something to wear and not have to worry if i lost it or if it got stolen. Once I put it on I havent taken off…its so comfortable to wear and the color of the necklace has stayed the same even through showers…great idea for a gift too."
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Vogue Recommended",
				"review": "I read about this necklace in Vogue so I ordered several and it just so happened it was on special. It is really nice quality - sturdy - and a nice gold tone. Two separate pieces so versatility."
			},
			{
				"name": "Alayia Fuentes",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " LOVE THIS.",
				"review": "soooo worth the money. i’ve worn these in the beach, chlorine pools, salt pools, spray perfume with them on, in the shower, etc. they are perfect and can be layered with other pieces as well."
			},
			{
				"name": "Veronica Salgueiro",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Makes a great gift!",
				"review": "Got this for my friend and she loved it! I love that it’s versatile and she doesn’t have to wear both chains if she’s not feeling it."
			},
			{
				"name": "Anita Bock",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Lovely",
				"review": "Love this necklace set, seems to be lasting well without discolouring so far"
			},
			{
				"name": "Shirley Heng",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Good quality Jewelry. Value for the the spend.",
				"review": "As advertised. Looks like the pic provided. Good quality and came nicely packed. Will be great as gift. A lot of details put into this precious handmade Jewelry."
			},
			{
				"name": "Anonymous",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Amazing quality, I’ve had so many compliments!",
				"review": "I love love love these necklaces!"
			},
			{
				"name": "Molly",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful necklace",
				"review": "So lovely, great quality.\nWorth the money have bought more necklace's from this collection."
			}
		]
	},
	{
		"id": "mKnOVu",
		"title": "Hidden Message Bracelet - Meaningful gifts for Women, Great Friend Gifts, Unique Friendship Jewelry, Perfect Birthday Gifts for Women Freind BFF Sister..",
		"imageUrl": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/61xPBOms2JL._AC_UX522_.jpg",
		"price": "$14.89",
		"description": "",
		"reviews": [
			{
				"name": "Spruillie03",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Wish I Had Gotten it for Myself",
				"review": "I bought this as a gift. Not only did she love it, but I really want one for myself. It's super sturdy and heavy, but still dainty"
			},
			{
				"name": "Tiffany Steinmetz",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Very pleased! My best friend will love this!",
				"review": "It seems pretty sturdy, and it's what is fitting for my best friend. Fast shipping! Thanks!"
			},
			{
				"name": "Kylie Simms",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Perfect gift!",
				"review": "Bought this for my sister and she loves it! Definitely buying one for my best friend. I will agree with some of the other reviews, they are very small. I have a nine inch wrist and there’s no way I could ever wear one."
			},
			{
				"name": "suzzy weaver",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Made a great gift for bff",
				"review": "Gave it to my best friend as Christmas present. She loved it"
			},
			{
				"name": "Brittney Van Winkle",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Better quality than I expected to be honest. Beautifully made and came in a cute box with card",
				"review": "Got this as a gift and am super happy with it."
			},
			{
				"name": "Daisy Ortiz",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great little gift",
				"review": "Saw this and could not purchase it fast enough as a holiday gift for my sister. I can't stand the bitch, but I would gladly do time for her."
			},
			{
				"name": "Carry Copeland",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Friend loved it.",
				"review": "My friend absolutely loved this"
			},
			{
				"name": "Jennifer Jenkins",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Small wrist",
				"review": "This will stretch out but is made for a petite wrist"
			}
		]
	},
	{
		"id": "2zXogw",
		"title": "Swarovski Attract Trilogy Crystal Necklace and Earrings Jewelry Collection",
		"imageUrl": "https://hbr.org/resources/images/article_assets/2019/11/Nov19_14_sb10067951dd-001.jpg",
		"price": "$81.98",
		"description": "",
		"reviews": [
			{
				"name": "SAV",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Fit & sparkle",
				"review": "Unlike some small diamonds or moissanite I've bought, these had a good sparkle w/o looking fake from side due to setting.\nWill look nice with any dressy outfit - formal or semi-formal. The hooks are a little quirky - goes through ear hole but is a tad shorter than I'd like ; once you get it through it is lightweight and lays nicely."
			},
			{
				"name": "Larissa Ibarra Lamilla",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Hermosos",
				"review": "Se los regalé a mi madrina el día de mi boda y le quedaron fabulosos."
			},
			{
				"name": "Victoria",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful",
				"review": "They're very sparkly and pretty! Good Christmas present."
			},
			{
				"name": "Ryntintyn",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Beautiful and stay in well, but hooks are a bit thick",
				"review": "I wore these for my wedding. They were the perfect look and were really beautiful. The hook is kind of thick, so it was a bit hard to get into my ear, which meant my ear lobes were all red by the time I was done getting them in, but they settled down in time for the ceremony. AND the clips on the back make sure they stay in for dancing and everything. Overall, I'm very happy with them!"
			},
			{
				"name": "forrest lynch",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " value for the price",
				"review": "nice Christmas gift"
			},
			{
				"name": "Christopher Browne",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great gift.",
				"review": "It is a beautiful gift to give and get. Well worth the money it cost."
			},
			{
				"name": "Catherine Schitea",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " My birthday gift",
				"review": "Perfect for dressing up!"
			},
			{
				"name": "JILL",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Length",
				"review": "Was not long enough. I looked at description before ordering and could not find a length. I needed to add links myself. Seems more to be a size for a child."
			},
			{
				"name": "Sara Asti",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " CONTRAFFATTI!",
				"review": "Delusissima, metterei zero stelle se potessi, sono CONTRAFFATTI, in foto potete vedere l'originale che è quello mostrato su  e il contraffatto a sinistra che differisce per peso, misura, materiale. Non è un pessimo orecchino ma non puoi vendere un falso mascherandoti dietro swarovski... Inoltre anche il cartellino e la scatolina seppur fatti bene riportano differenze che un usuale acquirente del brand nota.\nNon ci son scuse, io questa la chiamo truffa."
			},
			{
				"name": "Kindle Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "2/5",
				"reviewTitle": " Think about buying this?",
				"review": "Bought the earrings first then bought the necklace . Thought the necklace was poor value for money S the stones are very small. You get two sets of stones in the earrings and obviously one set for the necklace . I assumed as the cost was similar the necklace stones would be bigger?"
			},
			{
				"name": "Linda",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful",
				"review": "Love these. I don't like drop earrings that flop about and these dont and are great. Came boxed and with warranty/label. They look great. Very pleased."
			},
			{
				"name": "Liv",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great product, highly recommend",
				"review": "Beautiful earings. I wore these for my wedding as I had a very similar necklace I wanted to wear. These earings were cheaper here on  than the actual Swarovski website so absolute bargain."
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " This pendant could take you anywhere!",
				"review": "I bought this beautiful necklace for myself with some birthday  vouchers I had received. A simple classic style that you could dress up or down. With jeans and a crisp white shirt or an evening dress. It arrived promptly and there it was twinkling away at me from the lovely gift box when I opened it. Much admired and I know I will wear this a lot. Very pleased with this purchase."
			}
		]
	},
	{
		"id": "7_1D19",
		"title": "fxmimior Dainty Boho Gold Silver Chain Bracelets Set for Women Adjustable Fashion Beaded Chunky Flat Cable Chain Punk Bracelets Jewelry for Women Girls Gift Set of 4 (Silver)",
		"imageUrl": "https://m.media-amazon.com/images/I/61uBt8606zL._SY355_.jpg",
		"price": "$8.60",
		"description": "",
		"reviews": [
			{
				"name": "elizabeth",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Good gift idea !!",
				"review": "I am satisfied w/ the quay for the cost of the gift !!"
			},
			{
				"name": "Gary runion",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Worth the money",
				"review": "Very pretty"
			},
			{
				"name": "alicia",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " No like",
				"review": "El tamaño es pequeño, la calidad no es muy buena ."
			},
			{
				"name": "Barbk65",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Very cute!",
				"review": "Very cute on, but very hard to get in and off. Wish there was an easier way!"
			},
			{
				"name": "Maria Lisa",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Boho Bracelets",
				"review": "I ordered in silver and I just wasn't thrilled...gold probably looks much better. One bracelet was missing. Had to return as I don't wear gold."
			},
			{
				"name": "JDizzle1001",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " I'm in love",
				"review": "Very light weight and stylish. Also came with long extenders. Not exactly what I expected but it'll work!"
			},
			{
				"name": "doccom",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "2/5",
				"reviewTitle": " Looks cheap",
				"review": "This is the first article of jewelry that I've bought from  that I don't like"
			},
			{
				"name": "Tanya T",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Cheap",
				"review": "Bracelet are not what expected. I only wear one out of the set. They are very cheap looking."
			}
		]
	},
	{
		"id": "95zTOf",
		"title": "NINE WEST Women's Boxed Necklace/Pierced Earrings Set, Silver/Blue, One Size",
		"imageUrl": "https://m.media-amazon.com/images/I/81M9zZH2xwL._AC_UY500_.jpg",
		"price": "$9.99",
		"description": "",
		"reviews": [
			{
				"name": "Eric",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " NINE WEST Women's Boxed Necklace",
				"review": "i been Tight on money and i got this as a gift for my mom for Christmas and it looks really good this necklace has really good craftsmanship and for the money its a really good product"
			},
			{
				"name": "Mir Ali",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " all good",
				"review": "all good"
			},
			{
				"name": "Ellison",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " very good quality I wear it all the time",
				"review": "I love I will buy again in a different color"
			},
			{
				"name": "tori",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Worth it",
				"review": "Was absolutely gorgeous it's going to be a wonderful gift"
			},
			{
				"name": "Melissa",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Luv it",
				"review": "Christmas gift for my daughter"
			},
			{
				"name": "Veronica Sidibe",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great value.",
				"review": "Expensive looking but at an affordable price!"
			},
			{
				"name": "Aura Reyes",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Excellent",
				"review": "Beautiful 👌"
			},
			{
				"name": "Patricia Tapia Echegaray",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Excelente producto",
				"review": "Excelente producto"
			},
			{
				"name": "Top.C",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Save your money",
				"review": "Really cheaply made. Looks like its spray painted silver. Looks good from far. No where near worth the price its at. Returning to get something better."
			},
			{
				"name": "Sue",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Tacky",
				"review": "Way too shiny and fake looking. I can’t wear it. Looks like something a child might like to wear. I don’t recommend this for any adult."
			},
			{
				"name": "VERONICA MENDEZ ZAMORA",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Es un buen producto para regalar,",
				"review": "salió defectuoso, me comunique y dijeron que no lo iban a cobrar pero en mi estado de cuenta sí aparece el cobro, no lo regresé porque faltaban dos días para el evento en que lo iba a obsequiar y les comente que lo iba a mandar a reparar."
			},
			{
				"name": "LaLocaDeLasGatas",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Un detalle para tu outfit",
				"review": "Son un bonito regalo o auto-regalo. Ojo: no son de oro, ni tampoco tienen piedras preciosas. Pero se ven muy bonitos, y son ligeros. Por el precio, están súper bien. Además, son duraderos: no se les caen las piedras ni se rompe la cadena."
			},
			{
				"name": "IVONNE MIRELES",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " excelentes",
				"review": "muy bonitos y lucen de calidad"
			}
		]
	},
	{
		"id": "iH1je5",
		"title": "MONOZO Gold Initial Bracelets for Women, Dainty 14K Gold Filled Layered Beaded Letter Initial Bracelet Personalized 26 Alphabet Disc Monogram Charm Bracelet Jewelry Gifts for Girls",
		"imageUrl": "https://hbr.org/resources/images/article_assets/2019/11/Nov19_14_sb10067951dd-001.jpg",
		"price": "$19.99",
		"description": "About this item\nSIZE: Layered Gold Initial Bracelet 6”inner diameter +2\" Extension chain, with a satellite beaded chain bracelet make a layered Gold Bracelet or to simply to wear on its own.\nMATERIAL: Dainty Initial Bracelet is 14k gold filled, nickel and lead free, sturdy and durable. Never fade ,rust and tarnish. Gold initial bracelet never turn skin green.\nWOMEN BRACELET: Gold disc letter bracelet is packed with love in a lovely Jewelry Velvet bag, ready for gift giving on every occasion, Birthday, Wedding, Mother's day, Thanksgiving Day, Valentine's day, Christmas day, and Anniversary, gifts for bridesmaids, Wife, Girlfriend, Mother, Daughter, other women and girls.\nINITIAL BRACELET: This unique gold bracelet is made of hand stamped personalized initial disc charm. you can choose letters to signify your name, favorite initials, parent's names, children's initials, special phrase, or anything else meaningful.\nAFTER SERVICE: 100% Satisfaction! No Hassle, Full refund or exchange within 90 days of receipt of purchase.",
		"reviews": [
			{
				"name": "Sharon",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Bracelet is so cute",
				"review": "This bracelet is soooo cute! I got this for myself with my boyfriends initial on it and I love it! Definitely my style I just wish it didn’t move around a lot even when you put it to the tightest setting and I wish the bracelet was just one big piece instead of two separate bracelets because then it kinda tangles. But it’s prefect!"
			},
			{
				"name": "g",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Pretty",
				"review": "The packaging was very well done and the bracelets came out better than I thought they would !"
			},
			{
				"name": "Nana",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Very pretty",
				"review": "This is a present for my granddaughter it’s very pretty I know she’ll like it."
			},
			{
				"name": "Robert & Debbie Chatman",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " So cute",
				"review": "Dainty and so cute. Love these little gold bracelets. Perfect gift for ladies of all ages."
			},
			{
				"name": "Reader lmf",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Cute and inexpensive",
				"review": "For a jr high (or younger) girl, really cute. Nice small gift for Christmas. Will it last forever? No. Would an older girl or woman wear it? probably not."
			},
			{
				"name": "Peggy",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Christmas Gift",
				"review": "Better quality than expected!"
			},
			{
				"name": "SJ",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Decent for the price",
				"review": "I’ve had this for a few weeks. I wear it in the shower and to work out. It hasn’t tarnished yet. Doesn’t look like will last forever but is decent for the price. Will prob last a lot longer if you don’t put it in water but I’m too lazy to take it off every day"
			},
			{
				"name": "Adriancy",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Bonitas",
				"review": "Me encanta se ve muy linda"
			}
		]
	},
	{
		"id": "0aJvGb",
		"title": "Tasiso Dainty Pearl Necklace for Women Tiny Pearl Pendant Necklaces Half Pearl Paperclip Toggle Necklace Barque Pearl Pendant Necklaces Pearl Chain Choker Necklace Simple Bridesmaid Jewelry Gifts",
		"imageUrl": "https://hbr.org/resources/images/article_assets/2019/11/Nov19_14_sb10067951dd-001.jpg",
		"price": "$13.99",
		"description": "",
		"reviews": [
			{
				"name": "Haley Johnson",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Exactly as expected!",
				"review": "I love pearls and wanted to incorporate them into my engagement photos. It worked out! This necklace is dainty and didn’t take away anything from me or the outcome of the images. Will certainly be wearing it again!"
			},
			{
				"name": "Priscila Rodriguez",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful",
				"review": "My sister bought me this for my graduation and it one of my favorite necklaces I absolutely love it"
			},
			{
				"name": "Victoria",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Super cute!",
				"review": "It’s super cute and just the right length. The only thing I would change would be the size of the pearls, they just seem a little on the larger side."
			},
			{
				"name": "kelsey",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " So cute",
				"review": "I bought this for my boyfriend, and he absolutely loves it. It’s definitely masculine enough for him to wear, but I could also wear it too. The quality is high and comes exactly as pictured."
			},
			{
				"name": "W. M.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Sweet gift",
				"review": "Perfect for young girls; sweet gift for June birthdays"
			},
			{
				"name": "KenidiR",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great necklace",
				"review": "Very pretty, has not tarnished, exactly as pictured"
			},
			{
				"name": "Lady Diane",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Very Kate Middleton, Princess of Wales (early days)",
				"review": "I love this immalist satellite necklace. It is light weight. You can wear to the office, job interview, special event, or just every day. Also, a great starter piece to layer other necklaces with. This necklace reminds me of the Tiffany bracelet Kate Middleton, Princess of Wales use to where in her early days as a royal. She is my fashion icon ( I am a fan of the other royal women's fashion as well.). Reasonably price. It arrived in a short amount of time. It would make a great gift. I would recommend this vendor."
			},
			{
				"name": "Chelsea",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Perfect for bridesmaids!",
				"review": "I got these necklaces for all of my bridesmaids to match at my wedding and they were perfect! Really good quality and very cute! All of the girls really love them and still wear them over 2 months later with no issues."
			},
			{
				"name": "Eva",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Muy lindo",
				"review": "Se ve muy bonito. Espero que la cadena no se haga fea con el uso. Recién lo compré."
			}
		]
	},
	{
		"id": "8U6Gv4",
		"title": "AROIC 38 PCS Gold Jewelry Set with 4 PCS Necklace,10 PCS Bracelet,24 PCS Layered Ball Dangle Hoop Stud Earrings for Women Girls Jewelry Fashion and Valentine Birthday Party Gift",
		"imageUrl": "https://m.media-amazon.com/images/I/71Z3faTjbUL._AC_UX385_.jpg",
		"price": "$26.99",
		"description": "【VARIOUS STYLES】：The set has 4 gold necklaces,10 gold bracelets,24 gold layered ball dangle hoop stud earrings. Light weight, good quality, no harm to your body.\n【PERFECT DESIGN】：Made of high quality alloy. High color endurance. Very environmental protection. Each of them is very light and will not put any burden on your ears, neck and arm.\n【EASY MATCH】：The set has various styles and they are very matched, which can be used in the various occasion in parties, wedding wearing, daily life, work, school, holiday etc. Can match your different colors skirts, dresses, shirts, coats. Make you more charming every day.\n【NICE GIFTS】：This is the perfect gift for any woman or girl who loves beauty. So many styles can meet the needs of most people. It can surely add Birthdays, Anniversaries, Valentine's Day, Mother's Day or any other festivals surprise.\n【HIGH QUALITY SERVICE】：No matter you have any questions in the purchases, do not hesitate to contact us, we will have professional customer service one-on-one for your service, until solving your problems.",
		"reviews": [
			{
				"name": "Maury",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Joyas",
				"review": "Me encanto su variedad y cumplió su propósito en la fiesta de acción de gracias."
			},
			{
				"name": "Arturo M. Hernandez",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Confianza",
				"review": "Muestra de gratitud"
			},
			{
				"name": "Saundrette Vaughn Jones",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Cheap but it's a lot",
				"review": "Its very cheap coste jewelry . It broke me out afte the first night used. Wouldnt recommend unless needed for a quick fix type of need (which is why I bought it in the first place)"
			},
			{
				"name": "NaNa Rae",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " It turned my granddaughters fingers, neck and wrists instantly green.",
				"review": "The jewelry was so fake that it turned her green wherever she had it on."
			},
			{
				"name": "Marilyn DeMoss",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Lightweight and beautiful.",
				"review": "The jewelry is very pretty. I have given several pieces as a gift."
			},
			{
				"name": "Lokyngrid198",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Cheap",
				"review": "The designs are cute but it doesn’t last you long"
			},
			{
				"name": "RJ Vigil",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Costume jewelry at its best",
				"review": "Cheap costume jewelry at a cheap price that looks good."
			},
			{
				"name": "MarS.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Costume/Fast Fashion jewelry",
				"review": "Understand this is costume jewelry, you get what you pay for. It's inexpensive and not made to last, perfect for tweens and teens first go into jewelry ownership. I gave this as a \"adopt a family\" gift for 17 year old girl.\nIf you're wearing the earrings, you can coat the posts with some clear nail polish if you find your ears are sensitive to the metal-tone or use plastic post covers."
			}
		]
	},
	{
		"id": "tBC2Zx",
		"title": " Collection Sterling Silver Black and White Diamond Infinity Pendant Necklace (1/3 cttw), 18\"",
		"imageUrl": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/719OapKYSgL._AC_UY695_.jpg",
		"price": "$110.50",
		"description": "Sterling silver necklace featuring two-tone twisted infinity pendant set black and white diamond rounds\n\nThe  Curated Collection\n\nDiscover the Amazon Curated Collection of fine and fashion jewelry. The expansive selection of high-quality jewelry featured in the Amazon Curated Collection offers everyday values that range from precious gemstone and diamond pieces to the latest fashion designs.\n\nThis hand-selected assortment features an array of diamond, gemstone, and precious metal designs that receive a quality inspection, including from Amazon’s staff graduate gemologist, to ensure they meet Amazon’s high standards. All diamonds featured in the Amazon Curated Collection are certified by our suppliers to be conflict free, and IGI, GIA, or AGS certifications are provided on white diamonds of .75 carats or larger on all stud earrings, rings, and pendant necklaces.\n\nPieces from the Amazon Curated Collection come packaged in a custom box, making them wonderful gifts. In addition, we offer free one-day shipping within the continental U.S. on items over $500. International shipping options for friends and family overseas are available for an additional fee.\n\nThe Amazon Curated Collection offers a specialized customer service team that is available seven days a week to answer any product questions before, during or after the purchase. If you’re not satisfied for any reason, you will receive a full refund and free return shipping within the U.S. if you return your purchase within 30 days.\n\nFind a special gift for a loved one or a beautiful piece that complements your personal style with jewelry from the Amazon Curated Collection.\n\nDiamond Clarity:\n\nNo two diamonds are alike. A diamond's most distinguishing characteristics are its inclusions, marks that are often invisible to the naked eye. However, under a jeweler's magnifying loupe or microscope they can look like crystals, tiny rivers, or clouds. A diamond's clarity is determined by the presence or absence of inclusions--fewer inclusions mean better clarity--and how visible they are. The greater a diamond's clarity, the greater its brilliance and value. A diamond categorized as internally flawless will have no inclusions, but this is extremely rare.\n\nDiamond Color:\n\nThough diamonds come in a wide range of colors, colorless diamonds have traditionally been considered the most valuable. Most diamonds are graded on a scale using the letters of the alphabet, from D (colorless), the best grade, through Z (a light yellow). It is difficult for the untrained eye to notice such variations in color unless stones are being compared side by side.\n\nDiamond Carat Weight:\n\nA diamond's weight is measured in carats, with one carat being equivalent to 100 points. You will often see a diamond referred to as a 3/4-carat stone or a 75-point diamond. Larger stones are often more highly valued, but size should not be the only consideration--high brilliance, which varies according to clarity, cut, and color grade, is highly desirable in a diamond.\n\nDiamond Certification:\n\nA diamond certificate represents independent verification that the stone purchased has all the qualities of cut, color, clarity, shape, and weight expected. It is a further indication of the condition and value of that diamond as represented on our site. Such certificates are issued by several agencies employing highly trained gemologists and provide an unbiased and accurate evaluation of the diamond. These gemologists scrutinize each stone to analyze its dimensions, clarity, cut, color, finish, symmetry, and other details.\n\nDiamonds purchased from the Amazon.com Collection may be certified by the Gemological Institute of America or the International Gemological Institute. The type of certificate provided will be noted in the product specifications of your jewelry purchase; if you do not see a certificate type noted, one will not be provided.\n\nOur Diamond Policy:\n\nAmazon.com sources high-quality diamonds from some of the world's largest suppliers. All our diamond suppliers certify that to their best knowledge their diamonds are not conflict diamonds.\n\nDiamond Care:\n\nDiamonds, as the hardest substance on earth, are resistant to damage. However, diamond jewelry is set in different metals, and care will vary from piece to piece. Diamonds should be cleaned in a solution of one part ammonia to six parts water, using a gentle scrubbing brush to remove any dirt. It is a good idea to have them cleaned once a year by a professional jeweler, at which time the security of the setting can be checked as well. Diamond jewelry should be stored in a soft cloth pouch to ensure that the stone will not scratch other jewelry.",
		"reviews": [
			{
				"name": "Rhonda Dossey",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful",
				"review": "Gift for daughter. Her favorite color is black so the black and white diamonds should make her happy. Infinity design how much I love her."
			},
			{
				"name": "Nucky Thompson",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " That your services are there in a pinch when need it like right now . Thats what I like about you",
				"review": "Gift"
			},
			{
				"name": "Cynthia Yarborough",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " How good it looks",
				"review": "I dislike the weight of it"
			},
			{
				"name": "Nicholas meador",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Wife loves it",
				"review": "Wife loves it. Happy Wife Happy Life"
			},
			{
				"name": "JPBollig",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Looks nice",
				"review": "Got it for my wife, she seems to like it. Wears it regularly with no issues in craftsmanship."
			},
			{
				"name": "Gregory Floyd",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Beautiful pendant but…",
				"review": "The chain is cheap but the pendant is very attractive. Packaging is terrible, in a plastic baggie with a computer sticker. Prepare to have to present it as a gift that looks inexpensive."
			},
			{
				"name": "Mike W.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " my wife loves it!",
				"review": "good value\nlooks great\nmy wife loves it\na good length---doesn't hang too low, which she likes"
			},
			{
				"name": "N. B.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Nice design",
				"review": "Bought this for my wife Beautiful Has earrings and a ring that matches this Maybe a little pricey but a very nice item"
			},
			{
				"name": "Nader",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Replacement.",
				"review": " Received the replacement thank you\nMuch better and professional packaged\nThank you."
			},
			{
				"name": "JordanD",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "2/5",
				"reviewTitle": " overpriced",
				"review": "Dose not come in the box shown in pictures"
			},
			{
				"name": "Brad Scharnatta",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " It’s a beautiful necklace but packaged terribly",
				"review": "Didn’t like the way they packaged and got it for Christmas present"
			},
			{
				"name": "Linda",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Gorgeous, especially for the price!",
				"review": "Love the sparkle and simplicity of it!"
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful",
				"review": "Beautiful design and quality"
			}
		]
	},
	{
		"id": "YUje3P",
		"title": "Turandoss Dainty Layered Choker Necklace, Handmade 14K Gold Plated Y Pendant Necklace Multilayer Bar Disc Necklace Adjustable Layering Choker Necklaces for Women",
		"imageUrl": "https://hbr.org/resources/images/article_assets/2019/11/Nov19_14_sb10067951dd-001.jpg",
		"price": "$14.99",
		"description": "LAYERED NECKLACE: Dainty layered choker necklaces with Pearls, Bar, Hammered Disc. Layered Necklace, in Gold Plated Y necklace.\nPRIME MATERIAL: 14K gold plated minimalist choker necklace, nickel free and hypoallergenic, safe to wear. Which makes it stands out among all other plain necklaces.\nPACKAGED: Comes with an elegant free gift jewelry bag, pearls beaded necklace, bar necklace, hammered disc pendant necklace. 3 pcs necklace, you can wear one of them or all of them.\nPERFECT GIFTS: This special layered necklace can be sent to your friend relatives in festival, Valentine's Day, Wedding, Engagement, Christmas Class, Dating, Home, Office and Daily Life.\nAFTER SALES SERVICE: 60-Day No-Risk Return Policy, reply you within 24 hours to solve your problem.",
		"reviews": [
			{
				"name": "Tawnia",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Nice necklaces",
				"review": "I bought these necklaces to wear to a wedding, unfortunately, all the lengths were a bit too long for what I was envisioning so I didn't end up wearing any of them. However, they're very pretty necklaces and I look forward to being able to in the future! The lengths aren't bad, by the way, just weren't what I wanted once I got the dress on.\n\nFrom my brief try-on of them all, they seem well-made, and the styles aren't overly obnoxious, just simple and dainty. They also stack quite nicely as well!"
			},
			{
				"name": "Kathleen V.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " This necklace looks like real gold! Great quality! Super impressed!",
				"review": "Love the quality of this inexpensive necklace. Looks like real gold, has great weight to it; not flimsy at all! Very versatile. Recommend as a gift or for yourself."
			},
			{
				"name": "theresa schultz",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Value",
				"review": "I was not hopeful that these 3 necklaces would work for me because I am sensitive to plated gold and/ or silver. I break out with a rash around my neck. With that said for the price of 3 necklaces I thought these would be an item I wouldn’t be able to use. To my surprise the quality of these 3 pieces were really good. The necklace catches the light and feels light when wearing them, very happy with the purchase"
			},
			{
				"name": "YS",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Overall ok",
				"review": "One of the three is quite nice. The other two are less giftable, perhaps for a small child"
			},
			{
				"name": "Jordyn",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Cute as expected",
				"review": "Easy to get tangled as all jewelry\nThey come as different pieces"
			},
			{
				"name": "Cheri L",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " would buy again",
				"review": "each necklace has a good length, and look great together or separate"
			},
			{
				"name": "Renee Bloom",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Looks like pic",
				"review": "Really cute.... definitely for the price"
			},
			{
				"name": "Angela Lovell",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Great price for product",
				"review": "This was so cute to wear all at the same time. Then i kept one and gave one to each of my girls now we all can share a part of this cute ensemble"
			},
			{
				"name": "Lin",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Compliments!",
				"review": "This little necklace really looks like real gold! I love it and wear it often. Haven't worn the \"bar\" necklace yet. I'm not crazy about the round disc, but the choker was well worth it! Enjoy!"
			},
			{
				"name": "Elenita",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " bien para el precio",
				"review": "los 3 lucen bien solos o juntos, los compré en oferta"
			},
			{
				"name": "acoyani contreras",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Cumple con todo lo descrito",
				"review": "Son muy bonitos"
			},
			{
				"name": "Rosalía Garcia",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Supe prácticos",
				"review": "Buena calidad por el precio"
			}
		]
	},
	{
		"id": "Jn7iwS",
		"title": "Genuine Birthstone Necklace for Girls Women, Heart Love Necklace for Tween & Teen, Birthstone Jewelry Gifts",
		"imageUrl": "https://m.media-amazon.com/images/I/61T-aSZ6vFL._AC_UX342_.jpg",
		"price": "$9.97",
		"description": "",
		"reviews": [
			{
				"name": "Joseph J. Truncale",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " A beautiful November birthstone necklace you may want to check out.",
				"review": "A friend whose birthday is in November was coming up and I was searching online for a little gift and found this item on  (NOVEMBER Birthstone jewelry for women, heart necklace from Citrine Jewelry for women) on Amazon and decided to purchase it.\n\nAs always, the delivery was prompt. I am very pleased with my purchase. If you know someone into birthstones, you may want to check out this product on Amazon. They carry birthstones for every month of the year.\n\nRating: 4 Stars. Joseph J. Truncale (Author: The mighty pen: Your self-defense friend: Tactical se of the pen for self-defense).)"
			},
			{
				"name": "Che Che",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " This is beautiful!",
				"review": "The turquoise stone is my Granddaughter's birthstone, it is a vibrant blue, crystal clear stone that she will love for years to come, and the chain is a delicate gold. I am very happy I found this for her, Thanks !"
			},
			{
				"name": "Brenna",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful for a little girl",
				"review": "Great price. Very nice for a young girl. Came in nice display box and was shipped quickly"
			},
			{
				"name": "Martha Cruz",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Quality",
				"review": "I like the quality of this necklace and charm. My granddaughter loved it."
			},
			{
				"name": "Elizabeth Taft",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Gift",
				"review": "Beautiful"
			},
			{
				"name": "Dean E.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Inexpensive but nice",
				"review": "My wife liked the photo and price of this necklace. It was a long wait to get it, but it still arrived two months early! She put a longer chain on it and loves it."
			},
			{
				"name": "Gigi",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Kid loved it.",
				"review": "Pretty costume jewelry for child! Didn’t look super cheap and only one that hasn’t broken so far."
			},
			{
				"name": "Tonya",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful",
				"review": "My daughter loved this gift."
			}
		]
	},
	{
		"id": "uiYC8g",
		"title": "MEVECCO Layered Heart Necklace Pendant Handmade 18k Gold Plated Dainty Gold Choker Arrow Bar Layering Long Necklace for Women",
		"imageUrl": "https://hbr.org/resources/images/article_assets/2019/11/Nov19_14_sb10067951dd-001.jpg",
		"price": "$13.99",
		"description": "lobster claw closure\nLength of the first layer:13.5\"+2\"extender, second layer length:14\"+2 inches extender.Tips: Due to different monitors, there may be color differences in the product please refer to the actual product received!).\nMaterial of the cute karma choker necklace:18K Gold Plated over brass.Never faded.Lead and nickel free,Hypoallergenic.\nOur dainty necklace is suitable many occasions, etc party, wedding, ceremony, graduation, dating and vocation.\nOur tiny beaded necklace packaged with a delicate gift box and exquisite card.\nMevecco provided 100% satisfaction. If there are any problems with the purchase, please feel free to contact us, we will help to fix the problem or make the full refund.",
		"reviews": [
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great for price, has not tarnished yet",
				"review": "I got the one with the evil eye in the heart. Color does not look cheap, the chain is dainty which was important to me. I’ve even forgotten to take it off in the shower a few times and the chain has not tarnished. I can’t speak to any of the other styles but the heart/evil eye combo has held up well."
			},
			{
				"name": "the Outlandish Fam.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " cute 2 pc gold necklace",
				"review": "i love the o design on my necklace and this layered piece, the gold is fake but it doesnt look terrible. it will fade i have bought these necklaces before but for the money they last for a while. love the affordability and design"
			},
			{
				"name": "Brittney Crenshaw",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Adorable!",
				"review": "Really love the length, the beaded necklace is almost a choker while the circle medallion hangs just a bit lower for a great layered look. Necklaces are completely separate so you can wear separately as well. Seem to be decent quality, although clasps are very small, so somewhat difficult without nails! Would recommend as a huge fan of minimalist jewlery!"
			},
			{
				"name": "Kristen W.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great quality",
				"review": "I have been wearing this necklace nonstop for about a month and it holds up great! I was worried about it turning green, but i haven’t had any issues. I even ended up buying more as gifts."
			},
			{
				"name": "sierra",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Amazing quality for the price",
				"review": "I bought this necklace about a year ago and I’ve never taken it off. I wear in the shower, when I go swimming and when I sleep and it still looks brand new. Super cute too!"
			},
			{
				"name": "Jessica",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Like one not the other",
				"review": "I wear the smaller one a lot but the one with the medallion the circle is larger so I feel like I look funny in it it’s overbearing"
			},
			{
				"name": "Emjay",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Sturdy beautiful piece",
				"review": "I bought 2 earrings & a necklace. Wearing them twice a week. It’s been a year now and it’s still in good condition. I got lots of compliments too.\nI love this brand."
			},
			{
				"name": "Deborah",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Not as delicate as I saw in the picture.",
				"review": "The color is good. Sturdy for the price. I'm keeping. It is two necklaces making it versatile."
			},
			{
				"name": "Tania Quiroz",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Do Not Buy",
				"review": "Do not recommend. The chain completely tarnished after only a couple wears. Do not waste your money. By the second time I wore this I started noticing the chain darken. But the fourth time my neck was completely blue and the chain was almost black."
			},
			{
				"name": "Carla",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Terrible quality",
				"review": "Came patched together, didn’t realize it until had wore it half a day. Took it off after work day and it was tarnished and gold finished rubbed off . Unimpressed and cutting my losses. Thank goodness didn’t pay a lot of it"
			},
			{
				"name": "sj",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Literally perfect in every way",
				"review": "Bought the necklace in early January and have been wearing the absolute hell out of it since then (it is now late June). I’m talking at least 3 times a week since then. Out to school. Work. Daily excursions and shopping.\n\nThe colour has not even tarnished a single bit. The gold is still so shiny and PEEERRRRFFFFEEEECTTTTTTTTT (with exclusion of the extension chain which has tarnished just a teensy tiny bit but that’s to be expected because my neck is sweatier than any other part of my body half or the time)!!!!!!! Plus, the gold isn’t overly yellow so it’s a really luxurious colour that doesn’t look cheap at all :D\n\nTo be 100% honest I’ve mostly only been wearing the pendant necklace but that’s because I fell in love with it and I don’t have many formal occasions that require both layers.. and you can SEPARATE THE NECKLACES!!! The biggest W about this necklace ever—I hate multilayer necklaces that are inseparable because sometimes I want to wear them individually!!!\n\nIt also comes in this cute little teal box that I like to open and close a lot because the top fits right over the bottom which is a detail that has no relevance to the necklace itself but I thought it was pretty neat.\n\nSo to sum up!!!\n\nSeparatable layers? ✅\nGorgeous colour? ✅✅\nSuper duper long lasting and with the durability of a fortress? ✅✅✅✅✅✅✅✅\n\nYouuuu neeeeeeeed this necklace it goes well with literally everything and you will never get tired of it 100% promise I’m going to wear it tomorrow again too"
			},
			{
				"name": "Reema",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Cheap not worth price tarnished easily",
				"review": "Mine didn’t come in a box it came attached to a fashion jewelry piece of cardboard thank god I never sent this as a gift the chain tarnished after wearing it a few times"
			},
			{
				"name": "Bernadette Taylor",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Horrible!!!",
				"review": "The moment I put it on my neck there was a disgusting metallic odour coming from it. Immediately the round pendant started to tarnish. I know it wasn’t expensive but the description makes it sound much nicer and better quality. Would not recommend!!"
			}
		]
	},
	{
		"id": "XvyHCK",
		"title": " Collection Sterling Silver Diamond Accent Knot Pendant Necklace , 18\"",
		"imageUrl": "https://hbr.org/resources/images/article_assets/2019/11/Nov19_14_sb10067951dd-001.jpg",
		"price": "$25.00",
		"description": "",
		"reviews": [
			{
				"name": "MS Tommie",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great for Mom",
				"review": "I saw this necklace and thought it was so pretty, but when I received it I was wrong… ThiS Jewelry Is Beaut💕ful!! This necklace is a great choice as a gift and it’s priced well. I must add that it’s delicate"
			},
			{
				"name": "Bollycats",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Very pretty",
				"review": "Very pretty and a great price. Another reviewer said it didn't lie flat but it does for me. If I'm walking it flops around a little but when I stop it lays perfectly against my chest. Beautiful design and it really sparkles."
			},
			{
				"name": "Janet S. Newman",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " A beautiful necklace",
				"review": "We bought this for our almost-17 year old granddaughter. It is really pretty. My only concern is the delicate chain. I hope she doesn’t break it."
			},
			{
				"name": "Susan G. LeBlanc",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Pendant",
				"review": "Pendant is beautiful but doesn’t lay flat on chain"
			},
			{
				"name": "Deseree",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Nice",
				"review": "Great price\nWears well even when wearing in shower"
			},
			{
				"name": "Patsy",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Tiny and delicate.",
				"review": "I expected this to be sturdier. The chain is so fine you can barely see it. I don't think it'll last very long."
			},
			{
				"name": "Anita Reintges",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " It was exactly as advertised",
				"review": "Very beautiful"
			},
			{
				"name": "pqtricia",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " love it",
				"review": "liked"
			},
			{
				"name": "BELINDA",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Good value",
				"review": "If you cant afford to spend too much then this necklace makes a nice affordable gift."
			},
			{
				"name": "Soon Ja",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "2/5",
				"reviewTitle": " Look at me before you buy",
				"review": "The necklace is very nice and so is the colour but it itches me a lot when it is on. It could also be because I have sensitive skin. The packaging doesn’t really look nice but overall it is okay"
			},
			{
				"name": "Ree",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Nice although small",
				"review": "Nice pendant but a little smaller than I pictured. Works well with my aesthetic."
			},
			{
				"name": "Brian",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Glad I chose this",
				"review": "My girlfriends birthday is coming up, she loves rose gold jewelry. The pendant is perfect size and the chain is pretty good! Was better overall quality than I was anticipating."
			},
			{
				"name": "kimberley cottoy",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful!",
				"review": "Got this for my mom for mothers day, it's beautiful except Chain is smaller than I thought."
			}
		]
	},
	{
		"id": "Nj3GG6",
		"title": "Tiny Gold Initial Heart Necklace-14K Gold Filled Handmade Dainty Personalized Letter Heart Choker Necklace Gift for Women Necklace Jewelry",
		"imageUrl": "https://hbr.org/resources/images/article_assets/2019/11/Nov19_14_sb10067951dd-001.jpg",
		"price": "$13.99",
		"description": "【LENGTH AND SIZE】:Initial Necklace Length:13.8\"+2\" Pendent Size:0.24\"*0.27 Which have a Extension Chain,This length works on practically anyone!\n【MATERIAL】:INITIAL NECKLACE-The necklace engraved with alphabet（from A to Z),14k Gold Plated, 1Pcs charm necklace, minimalism style, small heart pendant necklace.\n【THE MEANING】:Initial Necklace is good Necklace Gift let her know she's always connected to you just like these Letter Name.When she wears this necklace she'll have a reminder of her strength and that you are always there for her.Celebrating family, wife, daughter, granddaughter, women, and girls,Mother,Friend,Let her know you'll love them forever with this elegant pendant. Perfect gift for MOM.\n【TIPS】:Following these easy steps, to keep your jewelry in its original condition for a long time:- avoid contacts with ocean/sea water, cosmetics, perfumes, household products, etc. - not recommended to be worn in shower & gym - use soft jewelry polishing cloth from time to time to prevent tarnishing - keep in an air-proof bag when not in use\n【Services】:Concerns regarding the order will be answered within 24 hours",
		"reviews": [
			{
				"name": "Vanessa",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Tiny but cute",
				"review": "I purchased this necklace for a gift exchange at work. It's listed as a woman's necklace. It's to small for the average woman, more like a child or preteen maybe. It's tiny with a very short chain."
			},
			{
				"name": "Elizabeth rudd",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Tiny",
				"review": "Love this necklace! But it’s really tiny like the size of a dime, but it never really said how tiny it was so if your expecting it to be bigger DONT buy."
			},
			{
				"name": "R. Carlson",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Gift for Granddaughter",
				"review": "It’s okay for kids jewelry, but it was much smaller then I expected. My Granddaughter is 8 years old and had it listed on her wish list and as a Grandpa I strive to fulfill her wishes. I included a photo."
			},
			{
				"name": "marty knoll",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Cute little necklace",
				"review": "Adorable. I purchased for my 7 year old granddaughter….it’s just the appropriate size for her. I would think this is great for ages up to 10 but it is very dainty and smaller than appears in photo. I had the the reviews prior to purchasing so this was expected."
			},
			{
				"name": "Janet",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Small",
				"review": "Good value for $. I’m plan on putting in daughter-in-law Christmas stocking. She’s short and petite."
			},
			{
				"name": "Jacqueline Luna",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Very Small",
				"review": "The picture is quite deceiving unless you actually go through and read everything which with Christmas and birthdays happening I don't have time for. I expected it to be as big as my thumb and it's smaller than my pinky. Luckily I've gotten them foe my 7 and 9 yr old nieces so hopefully it won't seem so tiny on them."
			},
			{
				"name": "Matthew T.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Very small hard to even see the letter on it",
				"review": "Just thought it was a little small for the money can’t really even see the letter"
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " smaller than expedcted",
				"review": "It was smaller than I thought and I did use it for a gift"
			},
			{
				"name": "Amber",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Cute",
				"review": "It's a cute little necklace, keep in mind the charm is SMALL like it's the size of the tip of a pinky finger of a small female hand. But it's still super cute, I wish the chain was a little longer, it's almost choker size, maybe slightly longer then choker necklaces."
			},
			{
				"name": "L Morris",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Fragile",
				"review": "Super cute but not made strong. We bought two and they were both broken within a week."
			},
			{
				"name": "Rachelle M. Dunbar",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " TOO SMALL FOR AN ADULT",
				"review": "it was a little shorter than I anticipated and had to add another extender to it. I would consider this item to be for a child"
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Perfect fit",
				"review": "This was a gift for my granddaughter. It was the perfect size for a 4 year old."
			},
			{
				"name": "Trace",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " My granddaughters loved it",
				"review": "It was a bit smaller than I thought it would be but it was for my little granddaughters and fit them just fine."
			}
		]
	},
	{
		"id": "9mYTKH",
		"title": "Sea Glass Necklace, Wire Wrapped Beach Necklaces with Starfish Pendant, Freshwater Pearls, Sea Glass Jewelry, Handmade Necklaces Gift for Women Girls",
		"imageUrl": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/61F-z5vlCjL._SY500_.jpg",
		"price": "$19.99",
		"description": "[Beautiful Styling] The sea glass necklace is in a beautiful shape, wrapped in mental wire. It comes with 2 pendants - a starfish charm, and freshwater pearl, adding a lovely element to the beach jewelry for women.\n[Adjustable Size ] The chain can be adjusted, length is 19.7\" with 2.1\" extension, sea glass pendant measures about 25mm. Please confirm the size before purchasing.\n[100% Handmade] Each beach necklaces for women is crafted carefully by us. From selection, polished to packaging, every step is done by hand. It will remind you of clear blue water of the sea.\n[Ideal Gift] The sea glass jewelry can be a gift for women, kids, lover and anyone who loves sea, particular like beach lovers and surfers. It is also a thoughtful gifts for Anniversary, Birthday, Mother’s Day, Valentine’s Day.\n[Nice Packaging] Sea glass is well regarded as a symbol of renewal and healing, representing our love for the sea. We have exquisite black gift boxes and “hand made” stickers to package handmade jewelry.",
		"reviews": [
			{
				"name": "K Kline",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful",
				"review": "This beauty made for a wonderful gift for my 10 year old granddaughter."
			},
			{
				"name": "Lidiia",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " beautiful blue pendant",
				"review": "beautiful blue pendant, looks interesting to the touch pleasant"
			},
			{
				"name": "Urmi J",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Excellent jewellery quality",
				"review": "This necklace is very cute and good quality. I liked the length as it's not too long or too short and fits perfectly to pair with outfits. This jewellery is versatile and can be used for western or beachwear outfits. It has a Boho vibe and is fun to wear."
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Very pretty and same as shown in the picture..Absolutely Loving it",
				"review": "I used this product for wearing it as a necklace and it beautifully matches and suits me.."
			},
			{
				"name": "Ashley S.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Even prettier in person!",
				"review": "This necklace is beautiful! The pictures don't do it Justice! Good quality, good price!"
			},
			{
				"name": "mary nell southard",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Nice color",
				"review": "Blue glass fell off necklace. Will try to repair."
			},
			{
				"name": "Anonymous",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Excellent Quality!!!",
				"review": " Just loved it!!! The length as it's not too long or too short and fits perfectly to pair with outfits. This jewellery is versatile and can be used for western or beachwear outfits. It has a vibe and is fun to wear. Color is so pretty !!"
			},
			{
				"name": "Sunshine Mel",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Reminds me of the ocean",
				"review": " I got this necklace for my daughter to remind her of our trip to Hawaii. She absolutely adores it and wants to wear it all the time so she can remember our fun experiences there. It is a wire wrapped sea glass that is all smooth without any sharp edges. This is a good quality necklace and even has two little charmers included – a pearl and a starfish. Such a great present."
			}
		]
	},
	{
		"id": "sy0qF1",
		"title": "FIBO STEEL 6 Sets Bohemian Stackable Bead Bracelets for Women Stretch Multilayered Bracelet Set Multicolor Jewelry",
		"imageUrl": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/9120AgyygML._AC_UX342_.jpg",
		"price": "$22.99",
		"description": "About this item\nMust Affordable Bohemian Bracelet Set--6 sets handmade beaded bracelets come in a order, more choices for you. Bohemian beaded wrap clasp bangle have multi color can meet you everyday need\nBohemian Local Bracelet--This folk bracelet can be seen everywhere on the streets of Bohemia.The locals told us that this bracelet represents the peace and beauty of your heart. In India and Nepal,it is fashion trend that wearing these stackable cuff bracelets.\nMultilayered Bracelet Set--Nice to Mix and match them according to your changing idea. Made of Top material: metal,acrylic beads. Approximately 3\" diameter stretchy. Cute bracelet suit all of you for daily wearing or yoga and dance class.\nBest Gift--6 Sets Beads cuff bracelets perfect to share with your friends as friendship bracelets. Great gifts for girlfriend, wife, sister, daughter, mom, bridesmaid, and friends on graduation, birthday, Mother's Day, Christmas, Valentines Day, wedding anniversary\nWarranty And Service--Promise 90-day Products Exchange or Money Back Guarantee. Just Feel Free to Contact Us If You Have Any Problem,We Will Solve for You Within 24 Hours",
		"reviews": [
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Cute Set",
				"review": "Cute set of boho bracelets. I do find the fit a bit small. I have pretty average wrist size and they fit snug."
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Cute but tight",
				"review": "I love the colors - super cute! Only bad thing is that they are a little too tight. I can only wear them for short periods of time - definitely not all day to work."
			},
			{
				"name": "Sha",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Cute bracelets vibrant colors.",
				"review": "Fair price range, makes a great gift. Not a fan of the wire the ends tend to scratch or snag clothing."
			},
			{
				"name": "nicole",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " didn’t fit",
				"review": "it’s way too big on my wrist, but i would say it’s good quality, i just personally wouldn’t buy agaib"
			},
			{
				"name": "Kathleen Gardener",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Super cute but scratchy",
				"review": "The bracelets are very cute, as pictured. But are a bit scratchy as you wear them. The green stones turned my arm green, but I soaked that bracelet in soapy water and after it dried, no longer she-hulked me."
			},
			{
				"name": "Emmie Joe",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Very cute!",
				"review": "These bracelets are very colorful and stretchy. Great price. Recommend!"
			},
			{
				"name": "neensw",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " A lil uncomfortable",
				"review": "In like them. Love the colors. But they are uncomfortable."
			},
			{
				"name": "April",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Very pretty",
				"review": "My girls loved them"
			},
			{
				"name": "Ms.Demi",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Love these!",
				"review": "I absolutely love these bracelets. I have two other sets stacked with these bracelets. Good quality for the price. A few of the strings did start stripping but that is acceptable as to how much they go on and off. Definitely purchasing again this week but q different color."
			}
		]
	},
	{
		"id": "QVsCnu",
		"title": "NINE WEST Women's Silvertone Crystal Pave Circle Stretch Bracelet",
		"imageUrl": "https://hbr.org/resources/images/article_assets/2019/11/Nov19_14_sb10067951dd-001.jpg",
		"price": "$9.99",
		"description": "",
		"reviews": [
			{
				"name": "SportyP",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Cute bracelet but......",
				"review": "Was too loose, large on my wrist"
			},
			{
				"name": "Loving Our Home",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Very Pretty - Fine for Casual or Classy Occasions",
				"review": "I was a little concerned about reviews saying this bracelet looks nothing like the product photo, but I was pleased that mine did. It is very pretty, easy to slide on, and I could wear this with just about any outfit whether it's jeans or a dress.\n\nGood value and a nice addition to any jewelry collection.\n\nLOH Reviews"
			},
			{
				"name": "Ida Perez",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " It’s very nice for a gift",
				"review": "I really like it I had giving it as a gift and thinking of buying another tot myself"
			},
			{
				"name": "ian",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "2/5",
				"reviewTitle": " Ouch",
				"review": "Cute but It pinches the skin. Too big for wrists. Have to return it."
			},
			{
				"name": "OPGirl",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " VERY NICE!",
				"review": "Very classy and elegant! Very good quality and bargain. Very comfortable easy to get off and on."
			},
			{
				"name": "David S.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great affordable gift",
				"review": "Great affordable gift that arrived on time!"
			},
			{
				"name": "mike z.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " It's cheap for a reason........",
				"review": ".......but my 11yo used his own money to buy this for his girlfriend and she liked it."
			},
			{
				"name": "Katrina mcalister",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Not what I expected",
				"review": "It's stretchy. Not silver braid"
			}
		]
	},
	{
		"id": "KPjkob",
		"title": "IFKM 36 PCS Silver Plated Jewelry Set with 3 PCS Necklace, 12 PCS Bracelet, 7 PCS Ear Cuffs Earring, 14 Pcs Knuckle Rings for Women Girls Valentine Anniversary Birthday Friendship Gift",
		"imageUrl": "https://hbr.org/resources/images/article_assets/2019/11/Nov19_14_sb10067951dd-001.jpg",
		"price": "$17.97",
		"description": "",
		"reviews": [
			{
				"name": "Mukesh",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Bracelet",
				"review": "I really really like this product although when I opened it I found the white bead bracelet broke and I didn’t even wear it I opened the bag it was in and it was just beads all over it but everything else is amazing. It I’ll turn green after awhile though other wise this is a great product!"
			},
			{
				"name": "Mcmul9906",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great for pre teen",
				"review": "Bought these for granddaughter for Christmas. They seem to be ok. Won’t know until she wears them"
			},
			{
				"name": "Vanessa Edwards",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great variety",
				"review": "Purchased as a gift for teenager. I think she will like it. Great variety."
			},
			{
				"name": "MishaK",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Serves it's purpose",
				"review": "This is costume jewelry and it's cute for that purpose. It's not long lasting or real silver."
			},
			{
				"name": "T Carlisle",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Perfect tern gift",
				"review": "My teen loved it"
			},
			{
				"name": "Larico Farmer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great buy",
				"review": "Great buy"
			},
			{
				"name": "Jonathan Esquivel Arce",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " pierde un poco de color",
				"review": "pierde un poco de color"
			},
			{
				"name": "Justice Leamon",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " You get what you pay for",
				"review": "You get what you pay for looks great but I doubt it will have a long life span, it’s definitely worth the price tho. I gifted it to my friend she loved it"
			}
		]
	},
	{
		"id": "EaFbPi",
		"title": "TONY & SANDY Inspirational Bracelets for Women Teen Girls Personalized Jewelry Gifts for Mom Daughter Sister Friends Stainless Steel Mantra Engraved Birthday Christmas Jewelry",
		"imageUrl": "https://hbr.org/resources/images/article_assets/2019/11/Nov19_14_sb10067951dd-001.jpg",
		"price": "$15.95",
		"description": "",
		"reviews": [
			{
				"name": "Barbara",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " My friend absolutely loves it. Great Birthday gift.",
				"review": "It is a beautiful bracelet a lot more then i really figured it would be because of the low price. I bought it for a friends birthday and she absolutely loved it. She won't take it off and she's not here so i can't take a picture of it. It is solidly made and it is engraved with the words be brave, be strong, be a badass. Buy one of these for someone you care about and beleive me you won't be disappointed."
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Perfect for my granddaughter!",
				"review": "I got this for my early teenage granddaughter. I love the quality, the feel,and it looks wonderful. Super happy I purchased it! :)"
			},
			{
				"name": "CJ",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Gift for teenager",
				"review": "It arrived when expected and was very nicely packaged. It is beautiful. Can't wait to give it to my grandaughter!"
			},
			{
				"name": "Dianna",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Cute, well made",
				"review": "Product looked better than I expected, very cute, well-made. Everything I was hoping for, and more. It came all packaged, the gift box is nice. I gave it as a gift to my daughter. I am very pleased with the purchase."
			},
			{
				"name": "Kim Marcello",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Very nice piece of jewelry!",
				"review": "I purchased this as a gift for my young niece. I was very pleased with the quality. It is a nice solid bracelet and very pretty. I’m sure she’s going to love it. I would order again from this company."
			},
			{
				"name": "Renee Felton",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Fun and affordable",
				"review": "I have bought so many of these. I have worn my own for over a year now, and no scratches. Fun inexpensive gift for inspiration"
			},
			{
				"name": "Caryn A. Davis",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Perfect",
				"review": "They are perfect for my twin granddaughters who surf… I think they are going to love them"
			},
			{
				"name": "sonya",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Very beautiful",
				"review": "Nice bracelet and it is very beautiful."
			},
			{
				"name": "HealthAndBeautyGirl",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Makes a great gift!",
				"review": "I ordered 2. One for myself which arrived with scratches on one side of the bracelet. It was quite big on my average sized wrist and took some adjusting to get it to not fall off. It does get caught when layered with other bracelets, so better to wear alone if that would bother you. I also find that it twists around a lot and will not stay with the flat side facing out (the one I have has the engraving on the outside). Other than those issues, the quality seems good.\n\nI also sent one to my Mother for her birthday, the one about mothers and daughters and distance etc.) She said she really likes it and didn't mention any issues with hers."
			},
			{
				"name": "Nici",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Inspirational gift for my Grand Daughter",
				"review": "Beautiful item, recommended to other family members and friends. I will buy from here again"
			},
			{
				"name": "Lady",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Worth the purchase",
				"review": "I purchased 2 for my beautiful girls for Valentine's Day.\nVery very cute."
			},
			{
				"name": "claire",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Perfect!!!!",
				"review": "Love this! Great quality"
			}
		]
	},
	{
		"id": "UiW_gW",
		"title": "ManRiver 26 Letters Rings for Women - Diamond Rhinestone Studded Zirconia Open Adjustable Rings Jewelry Accessory Gifts",
		"imageUrl": "https://hbr.org/resources/images/article_assets/2019/11/Nov19_14_sb10067951dd-001.jpg",
		"price": "$4.99",
		"description": "WELCOME To ManRiver Online Store ! women rings ring gold silver wedding sterling silicone engagement nose diamond women's toe steel rose stackable band men stainless 14k jewelry knuckle thin vintage birthstone finger clearance anxiety ring sterling silver ring spinner bead ring Selling point: Simple and stylish High quality metal Inlaid rhinestones make you more outstanding Suitable as a gift for mom, girlfriend and good friends Suitable for all occasions. Like weddings, parties description: Size: adjustable Material: Alloy Color: golden Attention. The product is open style, can be adjusted by yourself, the product picture is a kind of effect There is no fixed inner diameter for openings like this. When you break it, try not to break the joint, although it is not so easy to break, but that is the most vulnerable place. contain: 1 x ring",
		"reviews": [
			{
				"name": "Diane platte",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Gift",
				"review": "This was a gift and it was liked very much."
			},
			{
				"name": "Izanable",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Everything came in good packing but one my ring’s snapped while adjusting it on my finger",
				"review": "It snapped easily"
			},
			{
				"name": "Kayde Lee",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Pretty but broke in a week.",
				"review": "Loved it and wore it for about a week and then randomly felt something lose on my finger and it broke in half"
			},
			{
				"name": "SAE",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Love it!",
				"review": "Beautiful ring love the sparkle"
			},
			{
				"name": "zella green",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Good buy",
				"review": "The stone fell out the first out the first time I wore it"
			},
			{
				"name": "SHERRY BAGINSKI",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " merchandise to my satisfaction",
				"review": "nothing to dislike, am very satisfied with ring"
			},
			{
				"name": "Ruth Hessaa",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " This fell apart the K came off not worth the money",
				"review": "The K fell off when my daughter wore it"
			},
			{
				"name": "Glenda Johnson",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " I'm in love",
				"review": "I love that it's adjustable"
			}
		]
	},
	{
		"id": "bYzTIb",
		"title": "Anne Klein Earrings",
		"imageUrl": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/512X448tllL._AC_UY395_.jpg",
		"price": "$26.00",
		"description": "",
		"reviews": [
			{
				"name": "Mary E. Abbondandolo",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " These earrings are so pretty! I ordered a pair for my niece. Then I ordered a pair for myself.",
				"review": "These earrings are so pretty! I odder a pair for my nieces birthday. Then I got a pair for myself. A good bargain too."
			},
			{
				"name": "Elaine",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Just Beautiful ❤️",
				"review": "This product was for me"
			},
			{
				"name": "Ysa F.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Very pretty",
				"review": "The only reason I give these four stars is for the craftsmanship. They seem poorly made. I only say that because the dangly Diamond part detached from the actual earring piece and I was able to put it back on but that just makes it seem cheap. Other than that, they are very pretty and they go nicely with any dress on date night or a special occasion."
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful",
				"review": "Very nice and well made"
			},
			{
				"name": "PA-OH girl",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " These were a gift and the recipient loved them.",
				"review": "Very pretty and sparkly."
			},
			{
				"name": "Keisha",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " BEAUTIFUL",
				"review": "So beautiful and elegant. A little smaller than I anticipated but still love it"
			},
			{
				"name": "Mary Chambers",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful accessory!",
				"review": "Very pretty; sparkles like real diamonds."
			},
			{
				"name": "Pam Corley",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great gift for yourself!",
				"review": "These are beautiful and they just sparkle! Not too lightweight but just right. Detail is super. You will enjoy them!"
			},
			{
				"name": "Rocio B.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Muy Bonitos",
				"review": "Están muy bien hechos y Lucen preciosos con vestido de fiesta."
			},
			{
				"name": "Maria Cristina CorreabChavez",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "2/5",
				"reviewTitle": " Como si fueran de avon.",
				"review": "La entrega fue muy rápida y eso es excelente.\nEl brillo de las piedras no es óptimo, se ven 10 veces menos atractivos en la realidad."
			},
			{
				"name": "Gord-Saskatoon",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Very small",
				"review": "Would be good for younger girls or people with small ear lobes"
			},
			{
				"name": "Denisse G",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Decepcionada del producto",
				"review": "No se parece en NADA a la calidad que se percibe en la imagen. El proveedor debería de ser más honesto. El costo muy elevado para la calidad que tienen los aretes."
			},
			{
				"name": "MySecretRoom",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful Earrings",
				"review": "They are very light which I like and look very realistic !"
			}
		]
	},
	{
		"id": "aJ_t66",
		"title": "PAVOI 14K Gold Plated Crystal Solitaire 1.5 Carat (7.3mm) CZ Dainty Choker Necklace | Gold Necklaces for Women",
		"imageUrl": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/61X-F7dVj7L._AC_UX385_.jpg",
		"price": "$12.95",
		"description": "A 7.3mm Cubic Zirconia Crystal is prong set in a rhodium plated setting to complete this small pendant.\nAt 18\" in length with a 2\" extender this white gold jewelry for women will comfortably fit all neck sizes\n✦ 90-DAY GUARANTEE ✦ Your happiness is our number one priority. To ensure your complete satisfaction, we offer a hassle-free 90-Day money-back guarantee. To get in touch, email or chat with us - a member of our team will be happy to help you.\n✦ SUSTAINABILITY ✦ We’re committed to protecting the planet. That’s why every piece of PAVOI jewelry is crafted with 100% recycled materials and we package in 99% recycled and compostable materials. We are proudly carbon-neutral and completely offset our plastic consumption by removing over 275,000 plastic bottles from our ocean annually. Learn more about our sustainability efforts here.\n✦ PROUDLY AMERICAN-OWNED ✦",
		"reviews": [
			{
				"name": "MelanieH",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great value",
				"review": "This is the second time I’ve owned this necklace. I wear it every day and never take it off, I sleep in it, wear it to the gym, wear it in the shower, pool, ocean and it holds up amazingly well for a $12 necklace. I’ve replaced it about once a year as it begins to turn bronze but it takes about that long a while for this to happen. I’m about to purchase a third time so I thought I’d write a review!"
			},
			{
				"name": "Jena",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Would recommend to anyone!",
				"review": "Beautiful, especially for the price. Couldn’t be happier with this purchase! I like the chain length, and the stone is a great size."
			},
			{
				"name": "Vey Torres",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Very dainty.",
				"review": "Design is pretty, I got a lot of compliments. It sparkles when under the light. I just wish it had more adjustments for its length coz I prefer the pendant to sit in between my clavicles. Overall, I love it."
			},
			{
				"name": "TAMIE",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " I ❤️ Love it!!",
				"review": "Looks like an expensive piece of jewelry."
			},
			{
				"name": "Hannah M.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Delicate Necklace!",
				"review": "I love this delicate necklace. Looks pretty real, and goes with everything!"
			},
			{
				"name": "Raechel Black",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Dainty",
				"review": "Super cute and goes with everything! It’s the perfect little detail!"
			},
			{
				"name": "S. White",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " So sparkly!",
				"review": "This necklace was a big hit! I wore it as a guest to the wedding and got so many compliments! I will purchase each color it is available in."
			},
			{
				"name": "YaleRN17",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Cute necklace!",
				"review": "This is a great little solitaire necklace! Good quality for price and looks more expensive!"
			},
			{
				"name": "0shiVn20",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful 🥰",
				"review": "The necklace looks gorgeous and expensive. However the clasp is a bit weak. The packaging is good they also give you a care guidelines for the necklace."
			},
			{
				"name": "Ian",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Fabulous value",
				"review": "A friend bought me the opal version as a gift and I've bought the crystal solitaire for myself and my stepmum. No wear & tear as yet and they look great, terrific value for money. Clasp doesn't swing to the front at all. Packaging is a bit cheap & utilitarian, so I'd recommend getting a pretty jewellery box if it's for a gift so no-one will be any the wiser that you got it for a steal! Highly recommend."
			},
			{
				"name": "Pinkfairy24",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Gorgeous and sparkly",
				"review": "Absolutely gorgeous, a photo doesn't do it justice as it's so sparkly. I love it and would recommend."
			},
			{
				"name": "GEMMALOUISE82GB",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Stunning!",
				"review": "I brought this necklace to accessorise a wedding outfit. The chain is very sturdy and solitaire sits either side of the chain which I thought was a nice design function as often I find the solitaire often travels around the chain and ends up by the catch. Classic design which was perfect for me."
			},
			{
				"name": "Remembrance",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Very pretty necklace",
				"review": "I like this necklace very much and am delighted that it fits me as I do usually need a longer chain. However, with the extension it fits very well and the crystal solitaire is in just the right place. It will look good at the neck of a shirt, dress or blouse. The item arrived in good order and in good time."
			}
		]
	},
	{
		"id": "mAplPT",
		"title": "LOUISA SECRET Love Heart Birthstone Necklaces for Women 925 Sterling Silver Rose Gold Pendant Forever Diamond Jewelry Valentine's Day Christmas Anniversary Birthday Gifts for Wife Girlfriend Mother",
		"imageUrl": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/71ZMhsF4QqL._AC_UX385_.jpg",
		"price": "$119.99",
		"description": "",
		"reviews": [
			{
				"name": "randall c turner",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful.",
				"review": "This is a Christmas gift for my wife. This is a very classy elegant piece of jewelry. It is more beautiful in person than the pictures on line. The packaging is also very high quality."
			},
			{
				"name": "D. Rose",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Simply stunning",
				"review": "I was struggling to find a gift for my niece's birthday until I came across this pendant while browsing on . Normally, I would let my niece pick out what she wanted now that she is in her teens, but I thought I would take a chance and order this for her. I have to say I'm very pleased. My order arrived quickly and I found the gift box to be very nice. So far, so good. Now the time came for the great reveal and WOW... it is simply stunning. The pendant design and birthstone are a good size and easily seen without needing to be up close, but most of all I'm sure it will get noticed and my niece will get plenty of compliments."
			},
			{
				"name": "Laura",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful",
				"review": "This necklace is quiet nice and also beautiful...very well made and the chain length is perfect also. The stone is beautiful and very sturdy on the heart. Love it. Thank you also to the seller for such a nice product and for fast shipping....worth every dollar for this necklace :)"
			},
			{
				"name": "Mandy",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful necklace",
				"review": "This necklace is elegant.\n\nVery shiny and beautiful.\n\nGood quality material.\n\nI highly recommend it.\n\nLove the included gift bag and jewelry box.\n\nPresentation means so much.\n\nThis will last for a long time!"
			},
			{
				"name": "keairraka",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Gorgeous",
				"review": "This necklace is beautiful! I got it for a gift for my grandmother. Her birthday is in October so her pendant is pink and it is shiny and gorgeous!!!!! I'm really hoping she loves it just as much I do."
			},
			{
				"name": "Travis Robinson",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Absolutely BEAUTIFUL",
				"review": "This necklace is stunningly beautiful! Worth the price! The craftsmanship and quality are both top notch. The chain is thin and dainty. It was very well packaged and giftable in the original packaging."
			},
			{
				"name": "Carmel Kisses 💋",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Love it",
				"review": "Very nice and beautiful heart shaped pendant with engraved writing on it. You are allowed to choose the birthstone. It is simply beautiful."
			},
			{
				"name": "Tre",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful Heart",
				"review": "The heart is bigger than what I expected. Not a bad thing at all. I have the sapphire-blue. It's a beautiful piece. Great for gift giving!"
			}
		]
	},
	{
		"id": "sNuWXg",
		"title": "Lcherry Faith Cross Necklace for Women Religious Gifts for Women Christian Jewelry Gifts for Women Christmas Gifts for Women",
		"imageUrl": "https://m.media-amazon.com/images/I/81xZuSQQX8L._AC_UX385_.jpg",
		"price": "$16.98",
		"description": "Being a People of God is a High Calling that Christian People Should Aspire For. A Great Gift for Religious Jewelry. Featuring \"Faith\" Written Inside A Beautiful Cross\nPerfect gift choice:Thoughtful jewelry gift for best friends, daughter, mom, sisters, granddaughter, wife or yourself on Birthday, Christmas, Graduation, Mother's Day, Valentine's Day, Thanksgiving or just send as a best friend gifts for women that special one in your life.\nGift Package With Message Cards And Wishes Words. With Inspirational Reminder Message Card: Faith Does Not Make Things Easy. It Makes Them Possible.\nMaterial: The Necklace Is Made Of High Quality Stainless Steel, It Is An Extremely Durable& Hypoallergenic Metal.The Chain Length is 18 inches+2 inches Extender. Adjustable Necklace Suitable for Most People.\nIf You Have Any Question Please Contact Us. We Will Respond Within 24 Business Hours.",
		"reviews": [
			{
				"name": "Cassidy",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Perfect gift!",
				"review": "I gave this as a gift and it was beautiful!! She absolutely loved!!"
			},
			{
				"name": "Ashley",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Nice",
				"review": "Love it. Wear it everyday ."
			},
			{
				"name": "Marty",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Cute!",
				"review": "I love this necklace and the message behind it! Easy and simple way to share my faith. I just wish they had these necklaces in gold!"
			},
			{
				"name": "Kristin",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful",
				"review": "Purchase this for my daughter for her confirmation and she loves it. Her friend loved it too"
			},
			{
				"name": "J-Lynn",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Gift for my daughter!",
				"review": "She loves it!! wears it everyday, get lots of compliments on it."
			},
			{
				"name": "Kelley Hoyt",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Love!",
				"review": "My mom loved this necklace! It seems extremely well made and sturdy!"
			},
			{
				"name": "Ginger Hamilton",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Pretty",
				"review": "Very pretty, just like the picture. Seems to be nice quality."
			},
			{
				"name": "DIANE M FARBO",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Love these",
				"review": "I've bought a few of these for graduation gifts, they are well received and I will buy more ☺"
			}
		]
	},
	{
		"id": "DG3gmR",
		"title": "HELPFLOWER CH Handmade Fairy Simulation Butterfly Wing Earrings Foil Rhinestone Earring Romantic Jewelry",
		"imageUrl": "https://hbr.org/resources/images/article_assets/2019/11/Nov19_14_sb10067951dd-001.jpg",
		"price": "$6.89",
		"description": "",
		"reviews": [
			{
				"name": "Momma3",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Cute",
				"review": "I can’t give it 5 stars because one was broken I think it will be an easy fix but this should have been checked prior to shipping and was not damaged in transport it was packaged well. It is cute though"
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Prettier in person",
				"review": "These are just lovely in person! I will be looking to get other colors in the future!"
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Excited but sad",
				"review": "Very excited to get these. They’re gorgeous, but showed up broken. I will be keeping them and just supergluing the broken part on. Other than that, I love them"
			},
			{
				"name": "Lennys Mom",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Not sure of durability but….",
				"review": "These earrings are adorable! I am a bit wary of the fragility but they are so gorgeous!"
			},
			{
				"name": "Nayeli",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " fragile",
				"review": "These earrings are sooo pretty but very cheap/fragile. Mines fell on the floor and it broke so therefore be very gentle with them!"
			},
			{
				"name": "Alea Laughery",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Just what I was looking for",
				"review": "These feel chunky, but they are really light. I dressed as the Ant Queen from Bug’s Life and wanted wing earrings to represent her wings. These were perfect. Just haven’t found other things to wear them with in my day to day life, so that’s the only negative."
			},
			{
				"name": "Erin Sonnier",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Stunning!",
				"review": "These earrings are even more beautiful in person!"
			},
			{
				"name": "Emma Gold",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Magical!",
				"review": "I already liked them when I saw them on the website. But when I got them in person I was about to cry (happy tears). They are so lightweight, carefully designed with detailed rhinestones and glitter and they look elegant. I bought them to wear to a fantasy-themed event. But, to be honest, I’ll wear them with jeans and a cute top as well! :)"
			}
		]
	},
	{
		"id": "z9fD2_",
		"title": "Betsey Johnson Pearl Critters Owl Drop Earrings",
		"imageUrl": "https://hbr.org/resources/images/article_assets/2019/11/Nov19_14_sb10067951dd-001.jpg",
		"price": "$25.00",
		"description": "Betsey Johnson® knows how to bring a smile to anyone's face! This New York-designed jewelry collection pops with life, color, and all of the fanciful things life has to offer.\nPart of the Betsey Johnson Pearl Critters Collection.\nOwl you need are these adorable Betsey Johnson® earrings to start your day right.\nGold-tone drop earrings.\nFaux pearl owl with crystal accents.\nLever back.\nImported.\nMeasurements:\nWidth: 7⁄15 in\nHeight: 1 2⁄5 in\nWeight: 0.4 oz",
		"reviews": [
			{
				"name": "Eunice M Mullikin",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Cute owl earrings",
				"review": "I love these earrings and they look just like the picture! They’re lightweight and love that they are NOT a post. They arrived in no time at all and I’m very pleased with them!"
			},
			{
				"name": "from the Apple 55",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Well made",
				"review": "A gift. Very nicely made. They are eye catching and not gaudy. You won't be vanilla plain wearing these!"
			},
			{
				"name": "misschic2",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Wise Owl",
				"review": "I love owls. They are a symbol of wisdom, and I knew I wanted these when I saw them. They are very pretty. They are just the right size to make an impression. They can be given as a gift or kept for yourself."
			},
			{
				"name": "Pamela Dennis",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Pretty earrings",
				"review": "Pretty earrings"
			},
			{
				"name": "Judy doan",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Cute",
				"review": "They are a gift"
			},
			{
				"name": "Edith Shirey",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " They are the cutest earrings I just love them.",
				"review": "Very colorful and light"
			},
			{
				"name": "Michelle L",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " The Perfect Gift",
				"review": "Bought these For an owl lover and she adored them. So detailed and whimsical."
			},
			{
				"name": "Penny U.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Owl earrings",
				"review": "These are adorable. Nice size. Very fun gift to give or keep"
			},
			{
				"name": "Canadian Jane",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Adorable, nice quality, but not hypoallergenic",
				"review": "I was thrilled getting these cuties! I never owned Betsy Johnson jewelry, and these just grabbed my attention and seeing the backing sold me that they would be quality.\nThey arrived perfect in a new unhandled box.\nInspecting them as I always do as a jewelry designer myself, they are perfect for costume jewelry. I did not see stainless or hypoallergenic notes anywhere. I have allergies to metals except precious metals and stainless.\nI wore them all day yesterday to test them. Yes, I reacted immediately to them but stuck wearing them to see how I handled it. I had crusted puss after removal which means these have nickle, cadmium, zinc or copper in them. I pray there is no cadmium.\nToday, after disinfecting 3 times, my ears are tender. I will still wear them. Only I cannot wear them daily. I might glaze clear nail polish over the hooks or swap them for real gold hooks.\nThey have weight and substance which I love. I already got complimented yesterday on the street for them. They do grab attention in sunlight or halogens.\nThe caged back is everything. It just makes them feel like luxury earrings. The plating is perfect. This is not cheap feeling or Ardene quality, this feels like high end costume jewelry.\nI love her jewelry lines, some are cooky, juvenile, fun and some are creepy cute which I lean towards. If these owls were black and sparkly I would love them too.\nGreat gift that will make whoever gets them always think of you.\n4 stars because she can definitely make all her jewelry stainless or brass based rather than something half the planet is allergic to. I know as a designer it's a touch more expensive but we are talking cents in volumes. Absolutely no reason she can't afford to do stainless or brass. Great designs, poor metal bases.\nBut still recommend they are so cute in person."
			},
			{
				"name": "Dizzy",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Very pretty but...",
				"review": "I like them. The sticker on the back says 25.00 price tag yet I paid 30.00?? How does that work?!"
			},
			{
				"name": "Terry Cluett",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Great item.",
				"review": "These are wonderful lovely earrings. I love owl’s and couldn’t resist. Ordering, shipping, receiving, delivery time were all exceptional. Issue I have is that I received them with a sticker price of $25.00 on the and they are asking $31.00 on . I thought they were a little pricey but was willing to pay that. The issue I have is that we’re actually cheaper than they were asking on Amazon and pretty much having my nose rubbed in it."
			},
			{
				"name": "Miguel N.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Completamente dañados",
				"review": "Uno de los búhos llegó completamente suelto del gancho, el aro que lo debería sostener estaba completamente abierto y el otro estaba casi por soltarse. La calidad deja mucho que desear con respecto al precio, apenas llegaron y solicité la devolución enseguida."
			},
			{
				"name": "Bullish1",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful",
				"review": "These earrings called to me, could be because my sister who is no longer with us loved owls. They are so pretty, great weight and length to them."
			}
		]
	},
	{
		"id": "TrBLEA",
		"title": "Disney Womens Minnie Mouse Birthstone Stud Earrings - Minnie Mouse Earrings - Birthstone Jewelry - Disney Jewelry",
		"imageUrl": "https://hbr.org/resources/images/article_assets/2019/11/Nov19_14_sb10067951dd-001.jpg",
		"price": "$22.99",
		"description": "Minnie mouse jewelry and birthstone jewelry meet to form the cutest Disney jewelry for everyday wear. These small stud earrings feature the classic Minnie Mouse head shape, topped with a bow\nMinnie Mouse February birthstone earrings are constructed from silvertone plated metal and a faux amethyst purple crystal embellishment\nBirthstone stud earrings have a post back closure\nMinnie Mouse stud earrings arrive in a Disney gift box for easy gifting\nDedicated to Quality & Style: Founded in 1977, New York-based SallyRose, a premier designer and curator of cross-generational and timeless brands, offers an array of affordable, yet always finely crafted on-trend and classic jewelry as well as gift items for the entire family",
		"reviews": [
			{
				"name": "Dennis",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Look great!",
				"review": "Earrings are as advertised. Look super nice."
			},
			{
				"name": "Debbie",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Well made",
				"review": "These are a gift for my granddaughter. I was very happy with them although they have not been used yet. They are really sweet and look well made. I think she will really like them!"
			},
			{
				"name": "DR",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Gave them as a gift",
				"review": "Very cute. Good color"
			},
			{
				"name": "Adriana",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Earrings are beautiful",
				"review": "Perfect size good for adults."
			},
			{
				"name": "thefox",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " looks good",
				"review": "looks good"
			},
			{
				"name": "Karen",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Perfect for my daughter!",
				"review": "The Mickey Earrings are larger than I thought. I love the double backings (typical clasp and rub back) which makes it less likely for my daughter to lose. The birthstone is an awesome touch, as she is very into gems right now. The value is definitely there. Would definitely order again."
			},
			{
				"name": "Jessica",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful earrings",
				"review": "The box and bag that the earrings come in are a nice presentation. I bought as a gift and they are perfect. Received in a couple days. Very pleased with purchase."
			},
			{
				"name": "Lewis Peery",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Good",
				"review": "Yood qquali5y but because of size hard to determin er"
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful",
				"review": "Loved them made a really nice gift"
			},
			{
				"name": "carol",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Disappointed",
				"review": "The product didn’t come as stated I did not receive the black Disney bag or box extremely let down on this"
			},
			{
				"name": "jean davison",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Earring",
				"review": "Amazing"
			},
			{
				"name": "Giuseppe",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Ottimo prodotto",
				"review": "Prodotto di alta qualità, prezzo ottimo, consigliato"
			},
			{
				"name": "Daniel",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " On time, good price and quality",
				"review": "Quality product that arrived before estimated time and of good quality."
			}
		]
	},
	{
		"id": "5ing3v",
		"title": " Collection Sterling Silver Gemstone Flower Pendant Necklace",
		"imageUrl": "https://hbr.org/resources/images/article_assets/2019/11/Nov19_14_sb10067951dd-001.jpg",
		"price": "$17.00",
		"description": "",
		"reviews": [
			{
				"name": "Rowan Dunning",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Pretty necklace",
				"review": "It's nice. I got it for my mom and she likes it."
			},
			{
				"name": "Felecia Fuller",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great value",
				"review": "This necklace is so delicate and pretty. It's an amazing pr8ce for a special gift."
			},
			{
				"name": "lava phrog",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " very pretty!!",
				"review": "the necklace is very pretty :) the chain is thin, but other than that, its great! <3"
			},
			{
				"name": "Mika Ski",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " beautiful necklace",
				"review": "i loved this necklace, very beautiful and dainty. i highly recommend it, great value for the price!"
			},
			{
				"name": "Fanci moulton",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " My mom loved it.",
				"review": "Beautiful necklace. My mom won't order stuff online so she makes me do it. It looks exactly like the picture and the quality is very nice!"
			},
			{
				"name": "Rylee Jennings",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful",
				"review": "I ordered 6 of these for my bridesmaids to wear with their dresses. I wanted them to each be special to them so I got their birth stones, which works bc none of them has the same birth month. I will say that the blue topaz is much lighter in person. At first I though it was the corundum (Diamond), but I checked my order and I still have one more that will arrive tomorrow that’s supposed to be the corundum.\n\nSo the only negative I have on this is I wish the blue topaz was more blue. 😕 other then that, these necklaces are beautiful! ❤️ if you save these on a list and the When you want goes out of stock give it time and eventually it will come back in stock. I waited about a month for the diamond and green to come back in stock."
			},
			{
				"name": "Kelly E.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Definitely not aquamarine",
				"review": "I like that this necklace is delicate. The chain seems rather cheap so I probably would get a better chain for it. I ordered the aquamarine, and as you can see, it is not at all aquamarine. I think I'll try to return it and reorder and see if the next one is the one it's supposed to be."
			},
			{
				"name": "LoveToShop",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Very small",
				"review": "Bought for my granddaughter for Christmas. I thought it would be bigger, it’s pretty tiny so it might be better for a young girl."
			},
			{
				"name": "Keith",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Looks good",
				"review": "Gift"
			},
			{
				"name": "Brenelle DSouza",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Cute, but terrible presentation and lackluster stones.",
				"review": "It's alright. The chain is very fine and delicate, but the length is perfect. The pendant itself is pretty but the opals are very dull and lackluster. It came in a cheap, see-through plastic pouch (not in the \"Regal Blue Suede-Cloth Pouch\" mentioned in the description). Keep that in mind in case you intend to gift it to anyone. Overall, it's not terrible for the price, but I'm very underwhelmed."
			},
			{
				"name": "Emily Tousaw",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "2/5",
				"reviewTitle": " Very small",
				"review": "It's honestly child sized. The chain was not 18 inches and the pendant itself is about the size of a dime. I'll probably keep it and just swap out the chain, but I'm pretty disappointed in it."
			},
			{
				"name": "Deborah Jones",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "2/5",
				"reviewTitle": " quality lacking ! The chain provided is Very thin ( Flimsy )",
				"review": "Very disappointed with necklace especially for the price ! The chain is very fine and would break easily . I was sent the wrong stone So quality control isn't very good either ! Was supposed to receive the blue topaz but received a clear stone instead"
			},
			{
				"name": "Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful",
				"review": "My mom loves it!!! The box could be much nicer though. I put the pendant on a Singapore chain. This chain here I don’t trust. She wears it daily it’s been months"
			}
		]
	},
	{
		"id": "G3HxKU",
		"title": "Betsey Johnson Woven Mixed Multi-Colored Bead Flower Heart Illusion Necklace",
		"imageUrl": "https://hbr.org/resources/images/article_assets/2019/11/Nov19_14_sb10067951dd-001.jpg",
		"price": "$48.00",
		"description": "Betsey Johnson illusion necklace featuring mixed faceted beads, delicate stone accents, lovely flowers and heart embellished with woven mixed multi-colored charms. Necklace is set in gold-tone metal with a lobster clasp closure.\n\n\n\n\nNew York designer Betsey Johnson has built her long-standing career in fashion by following her own set of rules. Known for her celebration of the exuberant, the embellished, and the over the top, Betsey has been rocking the fashion industry with her unique and original designs since the 1960’s. Her commitment to remain true to her one-of-a-kind vision has afforded Betsey continued success in an industry known for its fickleness. Her ability to change with the times while keeping her designs pure has not gone unnoticed. At the 1999 CFDA Awards, Betsey was presented The Timeless Talent Award created especially for her, which recognized her influence on fashion throughout her career.\n\nBetsey was born in Connecticut and spent her childhood in dance classes. Her aspirations to be a dancer and her love for costumes laid the foundation for Betsey’s creativity and inspiration, which is still evident in her designs today. In 1964, Betsey officially entered the New York fashion scene by winning Mademoiselle magazine’s “Guest Editor Contest.” One year later, she landed the top designer position for Paraphernalia, a clothing boutique that at the time housed the hottest young London designers, including Mary Quant and Paco Rabanne, among others. What would soon become known as Betsey’s trademark look began its formulations here: sexy silhouettes, hippie inspired flowing fabrics, whimsical detailing and, most importantly, a fabulous fit.\n\nNow firmly part of what was considered the “Youth Quake,” Betsey soon found herself in the unforgettable 1960’s Warhol scene. Edie Sedgwick was her house model, while the Velvet Underground’s John Cale took to wearing her designs both on-stage and off. In 1969, Betsey began her foray into retail by opening a new boutique called Betsey Bunki Nini. Directly following the opening store Betsey was offered a job from Alvin Duskin in San Francisco and thus began living a bi-coastal life for the remaining years of the 60’s.\n\nAlong with the new decade came new career opportunities for Betsey and in the early 1970’s, she came into creative control of the label Alley Cat, a label which set the trends for the 70’s rock n’ roll clothing, with bohemian and ethnic styles. In 1972, along with Halston, Betsey won the coveted Coty Award becoming the youngest designer to ever receive the honor.\n\nAfter a decade of designing for other labels, Betsey decided to make a dramatic change in her life and in 1978, she formed a partnership with Chantal Bacon and started the Betsey Johnson label, as it is known today. Designing for herself allowed Betsey the creative freedom to execute her vision to its fullest potential. The same year Betsey and Chantal launched their first retail store in the heart of Soho. In the early 80’s, they were one of the first to open a store on Melrose Avenue in Los Angeles, helping the street to gain its worldwide recognition as one of the best shopping areas of the 1980’s. Today there are over sixty-five Betsey Johnson stores worldwide. International expansion came in 1998 with the opening of the wildly popular London store. In 1999 the Vancouver store opened marking the company’s first move into Canada, where there are now four locations in various provinces. In September 2006, the first Betsey Johnson store opened in Japan. Betsey Johnson clothing is also available in better department stores as well as in specialty stores throughout the United States and numerous countries around the world.\n\nThe year 2003 marked some exciting licensing endeavors for the company, taking Betsey’s signature prints and whimsy to new audiences with categories including handbags and lingerie. She continued this trend and has since added footwear, belts, eyewear, watches, jewelry, swimwear, legwear, outerwear and a fragrance thus effectively emerging as not only a clothing designer but a top American Lifestyle brand.\n\nIn late 2002, Betsey was honored with an induction into the Fashion Walk of Fame, honoring her contribution to American fashion. A bronze and granite plaque containing an original sketch, signature and biography was embedded into Seventh Avenue sidewalk in early 2003. In March 2005, the Signature Awards and NAWBO-NYC committee honored Betsey with the 2005 Lifetime Achievement Award. And following that, Betsey received the Lifetime Achievement Award from the Accessories Council in November 2005. Betsey Johnson was also honored with the Designer of the Year Award at the annual Fashion Accessories Benefit Ball (FABB) in May 2007 and was recently honored with the National Arts Club Medal of Honor for Lifetime Achievement in Fashion in October 2009.\n\nA survivor of breast cancer, Betsey continues to be a strong advocate in the fight against the disease, making public appearances, participating in numerous fund raising events and creating one-of-a-kind items that have been auctioned off to raise funds for many charities. In 2003, the CFDA asked her to be an Honorary Chairperson for the Fashion Targets Breast Cancer initiative, which she graciously accepted. In April of 2004, she was awarded another honor by the National Breast Cancer Coalition (NBCC) for her continuous fight against Breast Cancer at a prestigious ceremony hosted by Ron Perelman. In Spring of 04, she teamed up with Geralyn Lucas, the author of the book “Why I Wore Lipstick...to my Mastectomy,” designing an accompanying t-shirt which was launched in Betsey Johnson stores nationwide in October 2004 at a series of events called “Courage Nights.” Courage Night continued for its second year in October 2005 where CFDA Fashion Targets Breast Cancer and SELF Magazine joined the cause. Johnson continues to support, hosting a charity event each October in her boutiques nationwide and internationally, as well as creating limited edition products from which a portion of the proceeds are donated to various breast cancer related charities.\n\nBetsey Johnson, both the woman and the label, is constantly moving forward and continues to keep a strong foothold in the fashion industry with no signs of letting up anytime soon. Her love of detail and design is evident in everything she does in life and in business. Her enthusiasm, creativity and boundless talent that have kept her at the forefront of fashion for the past 45 years will keep Betsey going for years to come.\n\n“Making clothes involves what I like…color, pattern, shape and movement…I like the everyday process…the people, the pressure, the surprise of seeing the work come alive walking and dancing around on strangers. Like red lipstick on the mouth, my products wake up and brighten and bring the wearer to life…drawing attention to her beauty and specialness…her moods and movements…her dreams and fantasies.” – Betsey Johnson\n\nAs one journalist recently quoted, “If Betsey Johnson didn’t exist, we would have to invent her, simply to remind ourselves that fashion can be fun. She’s the original wild child and set to paint the town pink!”",
		"reviews": [
			{
				"name": "Michelle L. Beck",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " LOVE IT!!!",
				"review": "I love ’s new concept of “try before you buy” even though I have found that I usually buy what I try. This is one of those things that I have had on my wish list for a while, but couldn’t justify spending the money - other bills and things were more important. But the other night, with a little Christmas melancholy and hope, I said “I deserve something whimsical and fanciful this holiday season. I work too hard not to order something every now and then that I want, but don’t necessarily need. Besides, if not now (during these crazy times), then when?” So what could it harm if I click, “try for 7 days before you buy it.” This was really because I thought that MAYBE I would’t really keep it. Guess what, I LOVE IT. It is so unique and fun, that I didn’t even wait on the 7 days to expire before clicking keep/buy.   \n\nThis Betsey Johnson necklace is beautiful. It is a mixture of layers, beads, and fun!! It is colorful - accented by hearts, flowers and beads. It is whimsical and fun. It will match any and everything. This was the perfect purchase with the exception of the packaging. Maybe it was because this was a “try before you buy” item, but this necklace literally arrived in a ziplock baggie. No thrills or frills at all, which was disappointing since this necklace is so pretty. Personally, I think the packaging should match the look of the necklace - nice. With the exception of the packaging, this necklace is 5 stars."
			},
			{
				"name": "Julia Rodeillat",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " It’s beautiful, but pricey and tangles easily",
				"review": "I definitely loved this necklace! I don’t like the fact that it twist and gets tangled. The bead work on it is very beautiful, but I think it’s a little pricey."
			},
			{
				"name": "Damzlfly",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Delighted with this Necklace",
				"review": "Normally, I shop more \"affordable\" pieces, but the design of this necklace caught my eye. It's gorgeous and I have no regrets."
			},
			{
				"name": "Jackie Perry",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " It’s easy to put on if you have arthritic hands and pretty",
				"review": "It’s pretty not heavy and easy to put on had compliments on it. It’s pricey for me"
			},
			{
				"name": "stjuanzyh",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Nice",
				"review": "Love it"
			},
			{
				"name": "Annie Tampa",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " The worst packaging ever",
				"review": "Ok nice necklace I thought it would come in a box protecting it since it’s delicate but NOPE. It was tackily wrapped in plastic wrap in a small plastic baggy. Tangled like crazy this shipper could careless about their product or how they ship it. A pre-schooler could have done better. I spent my time untangling it!!!"
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Seriously beautiful!",
				"review": "I was wanting this necklace for a long time and finally got it for my birthday. The colors make it so fun and it can work with a variety of outfits!"
			},
			{
				"name": "Fee",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " So cute!",
				"review": "I wore this for with a casual brunch outfit. It definitely made the outfit look more expensive than it was. Would wear this many more times when my outfit needs that pop!"
			},
			{
				"name": "Jane H.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " I absolutely LOVE this necklace!",
				"review": "I was searching  for a long necklace but somehow this short one caught my eye, even though it's much quirkier and \"younger\" than my usual style (I'm in my 50s). Because it's by Betsey Johnson from whom I have an adorable little purse that I love and get compliments on all the time, I decided to take a gamble and order it anyway. I'm so glad I did - it's absolutely beautiful and I'm sure I'm going to get lots of compliments on it too. It goes with so many of my different outfits, both work and casual. If you're thinking about buying this necklace, you won't regret it."
			},
			{
				"name": "CJ Cutayne",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "2/5",
				"reviewTitle": " Terrible Packaging",
				"review": "Terrible Packaging. They basically throw it at you in cheap plastic bag like you just bought it at a garage sale. Hopelessly all tangled up of course and took over 20 minutes to get it untangled. Luckily it did not break in the process but we needed tools to get it done."
			},
			{
				"name": "Judith Bird",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Not great quality",
				"review": "Getting great compliments on the design. I personally love it, but unfortunately the metal has turned and tarnished. Happened after only one wear. I still wear it though"
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Don't waste your money",
				"review": "Returned it the day after it arrived, should have been pretty but it looked cheap and damaged. It came in a ball in plastic wrap and was tricky to untangle.\nNo worth the money and certainly did not look as advertised."
			},
			{
				"name": "femme heureuse, homme heureux",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " femme heureuse homme heureux",
				"review": "Tres jolie, delicat et ensemble parfait. Elle l`a aimer du premier coup d`oeil. Merci pour elle. MAINTENANT pour moi une explication serait demise, j`ai payer $62.40 + tx = $71.74 quand l`etiquette accrocher au collier affichait $48.00. Une explication SVP. Merci."
			}
		]
	},
	{
		"id": "t652q6",
		"title": "1 Pair Fashion Women Full Drill Hollow Ear Bone Clip Asymmetrical Jewelry Clip Earrings Accessories Fashion Design",
		"imageUrl": "https://hbr.org/resources/images/article_assets/2019/11/Nov19_14_sb10067951dd-001.jpg",
		"price": "$2.39",
		"description": "Name: Asymmetric Hollow EarringMaterial: Alloy + Color: gold Size: 1*1.2cm / 3.2*1.5cm Package Included: 1pair Women's Ear Bone Clip",
		"reviews": [
			{
				"name": "Frank",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Something different",
				"review": "I bought this for my girl to get her something different. It is only one piece not a pair. It's nice but it's hard to find something to go on the other ear."
			},
			{
				"name": "Crystal Carson",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Beautiful",
				"review": "Very Beautiful, but didn't come with no backs."
			},
			{
				"name": "Barbara Vargas",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Puntual",
				"review": " Bueno🙄los quería para regalo🎁pero los vi👀me gustaron🤗y me los quedé😈sorry for u my friend😁"
			},
			{
				"name": "Hadara Sapir",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Broke in 1 second",
				"review": "Cheap and bad material."
			},
			{
				"name": "Carol Smith",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " This is great quality NICE !!!!!!!!",
				"review": "Just beautiful !!!"
			},
			{
				"name": "Christina",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Simple",
				"review": "Simple and cute. However the material does bend a lot but great for one time use"
			}
		]
	},
	{
		"id": "Z4LFpu",
		"title": "14KWhite Gold Plated Initial Heart String Bracelets for Women Men Teen Girls Boys Handmade Rope Braided Bracelet Minimalist Jewelry Matching Couple Bracelets",
		"imageUrl": "https://hbr.org/resources/images/article_assets/2019/11/Nov19_14_sb10067951dd-001.jpg",
		"price": "$2.99",
		"description": "14KWhite Gold Plated Initial Heart String Bracelets for Women Men Teen Girls Boys Handmade Rope Braided Bracelet Minimalist Jewelry Matching Couple Bracelets\nBeautiful 26 letter bracelets are perfect for matching belly dance outfits\nThe bracelet is the perfect gift for your family, lover and friends. Perfect for the beach, pool, surfing or any other occasion in summer, it's sure to give you compliments\nMaterial: copper\nThe bracelet accessories are made of copper and Braided rope, the surface is electroplated, and the color: vintage letter bracelet, durable and durable, very beautiful and shiny\nChain length Size: 30cm (adjustable Length is 8-15cm）\nThis can represent your name, but it can also represent your lover and family. Bracelet is still the highlight of clothing collocation.\nColor:\nwhat you get: 1 × bracelet",
		"reviews": []
	}
]
