[{"id":"tmRIzJ","title":"14KWhite Gold Plated Initial Heart String Bracelets for Women Men Teen Girls Boys Handmade Rope Braided Bracelet Minimalist Jewelry Matching Couple Bracelets","imageUrl":"https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/51zd5YlseSL._AC_UX385_.jpg","price":"$0.95","description":"14KWhite Gold Plated Initial Heart String Bracelets for Women Men Teen Girls Boys Handmade Rope Braided Bracelet Minimalist Jewelry Matching Couple Bracelets\nBeautiful 26 letter bracelets are perfect for matching belly dance outfits\nThe bracelet is the perfect gift for your family, lover and friends. Perfect for the beach, pool, surfing or any other occasion in summer, it's sure to give you compliments\nMaterial: copper\nThe bracelet accessories are made of copper and Braided rope, the surface is electroplated, and the color: vintage letter bracelet, durable and durable, very beautiful and shiny\nChain length Size: 30cm (adjustable Length is 8-15cm）\nThis can represent your name, but it can also represent your lover and family. Bracelet is still the highlight of clothing collocation.\nColor:\nwhat you get: 1 × bracelet","totalReviewCount":"9 global ratings","averageStarRating":"4.3/5","reviews":[]},{"id":"LasfUk","title":"ManRiver 26 Letters Rings for Women - Diamond Rhinestone Studded Zirconia Open Adjustable Rings Jewelry Accessory Gifts","imageUrl":"https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/51NZqK1YW+L._AC_UX385_.jpg","price":"$6.80","description":"WELCOME To ManRiver Online Store ! women rings ring gold silver wedding sterling silicone engagement nose diamond women's toe steel rose stackable band men stainless 14k jewelry knuckle thin vintage birthstone finger clearance anxiety ring sterling silver ring spinner bead ring Selling point: Simple and stylish High quality metal Inlaid rhinestones make you more outstanding Suitable as a gift for mom, girlfriend and good friends Suitable for all occasions. Like weddings, parties description: Size: adjustable Material: Alloy Color: golden Attention. The product is open style, can be adjusted by yourself, the product picture is a kind of effect There is no fixed inner diameter for openings like this. When you break it, try not to break the joint, although it is not so easy to break, but that is the most vulnerable place. contain: 1 x ring","totalReviewCount":"953 global ratings","averageStarRating":"3.4/5","reviews":[{"name":"Alaisha.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" you get what you pay for!","review":"i liked this product except for the fact that i had to wait a month or two for it to arrive. and when it did arrive it came in good condition. but as for it being a gold ring that is not actually gold, i had to put nail polish in the inside of it where my finger would go. to prevent my finger from turning as we know, “green.” i never really got to enjoy it as much as i would like to because the same day it arrived was the same day i miss placed it. and never seen it again. that was my fault, but overall it was a nice TEMPORARY item!"},{"name":"Izanable","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Everything came in good packing but one my ring’s snapped while adjusting it on my finger","review":"It snapped easily"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" A good value","review":"Great gift for my girlfriends."},{"name":"Kayde Lee","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Pretty but broke in a week.","review":"Loved it and wore it for about a week and then randomly felt something lose on my finger and it broke in half"},{"name":"Diane platte","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Gift","review":"This was a gift and it was liked very much."},{"name":"zella green","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Good buy","review":"The stone fell out the first out the first time I wore it"},{"name":"Ruth Hessaa","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" This fell apart the K came off not worth the money","review":"The K fell off when my daughter wore it"},{"name":"Yessica","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Y","review":"Muy bonito y cómo es abierto emboba muy bien al dedo y buena calidad para el precio lave trastes y no se puso feo !!"}]},{"id":"AIUZ3Z","title":"MAIBAOTA 10 Pcs Crystal Necklace Healing Amethyst Crystals Carnelian Chakra Necklaces Evil Eye Necklace Vintage Hippie Wiccan Boho Rose Quartz Obsidian Moon Sun Jewelry Heart Gemstone Aventurine Turquoise Pendant for Women Wholesale","imageUrl":"https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/71aynpoPjkL._AC_UX385_.jpg","price":"$16.99","description":"About this Item\n★10 Pcs Crystal Necklace Set Originally designed by Mai Baota Jewelry Store★★10 Piece Crystal Necklace Set in a {gifted} velvet bag and Mai Baota unique gift box★if you have any product questions, you can always contact us via  contact us.\nThe 10-piece healing crystal necklace 7 chakra necklace, evil eye necklace, vintage sun moon necklace, amethyst necklace, rose quartz necklace, rose quartz heart necklace, carnelian necklace, obsidian green aventurine necklace. A variety of vintage style hippie boho fashion necklaces that are very beautiful you can match with different styles of clothing.\nThese crystal pendant necklaces in different shapes and fashion styles are suitable for mom, girlfriend, wife; perfect surprise gift for birthday, christmas, mother's day, valentine's day, anniversaries, etc.\nNatural energy healing crystal necklace pendant, can make you feel calm and relaxed, help you focus, keep your mind clear, relieve stress and anxiety, lift your spirits, get rid of dullness and boredom, and also bring you good luck and health.\nHealing Crystal Necklace Jewelry is made of stainless steel alloy and energy crystal, it is sturdy quality, very stylish, not too heavy, very easy to put on and take off.\nSee more\nAbout this Item","totalReviewCount":"1,052 global ratings","averageStarRating":"4.5/5","reviews":[{"name":"Iyonna pearce","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Crystals","review":"I love these necklaces. It turned pretty easy. And it broke a lot but if ur careful and match them well these necklaces can take u a long way. I love them. And I wear mine to this day. My black necklace broke faster but it’s okay I had another one. And I gifted my roommate and my boyfriend one of these necklaces and they love them."},{"name":"Kathy","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Nothing broke, came in a good package with a thank you card","review":"Very high quality packaging, the neckolace quality is something you would get from 5 below, crystals obviously aren’t real, the heart one is about the size of a penny, they give you the string so you can attach each one and choose what string. Received on time"},{"name":"Ace","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great for the price","review":"I put this on my wishlist and got it for Christmas and they are BEAUTIFUL. I wear them almost every day and they are great to accessorize with. They are such great quality for your money and I highly recommend buying them."},{"name":"dara","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great gift","review":"All of the crystals were very nice the necklaces I had to kind of just tighten a little bit at no big deal"},{"name":"Artie Hall","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Absolutely love","review":"Got a day early. I don’t have a photo of all the necklaces but I’m wearing this one rn :0 love these. Great quality especially for price"},{"name":"lori c.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" The stones are very nice!","review":"The stones themselves were surprisingly beautiful and nice quality. I can’t really speak on the chains that are included, as it’s a gift that has t been used yet. Even if the chains aren’t great, the stones are well worth the cost."},{"name":"Amanda","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great gift","review":"I bought this set for Christmas and split them up between a few girls as a little extra gift to go with their main gifts. Great quality and everyone was happy with them."},{"name":"linda hively","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" They are very beautiful and I gave them as a gift.","review":"My daughter loves all of the pieces and she even shares with me."},{"name":"LESLI CHRISTIE","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" A gift for your heart ♥️","review":"I’ve just come back from the post office.\nI went outside in the fresh air and sat underneath my Tree. (I wanted to charge my crystals in todays sunlight.) I sat down on the crunchy fall leaves, smiled, breathed deeply, and opened the beautiful red box. Inside was a Heartfelt note to me. It felt personal and I smiled as I read it. I then flipped the card over and read it again. These are Very pretty talisman 😍(in my opinion) and I love the care put into the packaging. Thank you so much! What a bargain for the joy it brings."},{"name":"KFjeld","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Very nice!","review":"I love this product, would have given a 5star, only one thing missing. A description of each crystal and the healing power behind them would be great for people who are new to Crystals"},{"name":"Linda Vespera","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Beautiful","review":"I buy this stuff all the time and this id one of the most beautiful sets ever! You simply cannot beat the price!! I absolutely love it and will buying this as gifts in the future!!!!"},{"name":"Monica Frigon","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" beautiful","review":"well made, only one is fake. (the white one)"},{"name":"Krystal B.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" I'm not sure?","review":"I'm pretty sure these pendants are all glass? Although very pretty. The cable chains aren't very secure. The first one I put on broke and fell off somewhere? Now I'm scared to wear any of the others."}]},{"id":"osQ3zE","title":"36 Pairs Gold Earrings Set for Women Girls, Fashion Pearl Chain Link Stud Drop Dangle Earrings Multipack Statement Earring Packs, Hypoallergenic Earrings for Birthday Party Christmas Jewelry Gift","imageUrl":"https://m.media-amazon.com/images/I/81ho8aIItXL._AC_UX425_.jpg","price":"$17.99","description":"About this Item\n【Earingings for Women Set】:This women earrings set includes 36 pairs different styles earrings, such as kinds of different stylish chunky hoop earrings, triple earrings, heart earrings, pearl earrings, kink earrings, gold hoop earrings and stud earrings, with different shapes and styles, which will make you stand out every day.\n【Gold Earring Set】A pair of fashion earrings weigh only about 1.5g-5.5g, lightweight and comfortable to wear. Each packing including 9pairs gold hoop earrings, Diameter:11mm,18mm,24mm,25mm,39mm.Please refer to the SIZE photo for the size of each,It will not be your burden but makes you to be a focus in the crowd.\n【High Quality Material】This hoop earring set are made of high quality alloy, crystal, pearls, delicate and eco-friendly, great plating and lasting color retention. without any weight feeling, lead-free and nickel-free, hypoallergenic, not easy to fade. No harmful for your health, they are comfy for your sensitive ears.\n【Pearl Hoop Earrings 】Our pearl earring set made of unique design, it is a good gift for girls, women, girlfriend, wife, best friend, grandmother, mother, family, ect. on Christmas, Birthday, Anniversary, Mother's Day, Valentine’s Day, Graduation or Wedding to express your love and gratitude to them.\n【TOP Brand】 We are a TOP Brand On  We are committed to provide consumers with high quality ,fashion but bargain. Please search \" FAXHION Jewelry \" on Amazon for more of our designs!\nSee more\nAbout this Item","totalReviewCount":"1,716 global ratings","averageStarRating":"4.4/5","reviews":[{"name":"Doni","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Good variety","review":"Great purchase for the variety. Quality to be expected with the price but you get some great pairs. This pack would also be good for those with double piercings !"},{"name":"Ivy","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect fashion jewelry","review":"Love the styles. Doesn't feel cheap. Good value for amount you get. I wasn't expecting much because of how cheap they were but I'm more than pleasantly surprised. We'll just have to wait and see how they do over time."},{"name":"Isandrina","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Muy nice","review":"Me gustaron los aretes."},{"name":"Elizabeth OBrien","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" THE BEST EARRINGS!","review":"I love love love these! Such cute styles and SO many options! Love that it comes with extra backs as well. The only downside is they don’t stay gold if you wear them often but what can you expect for the price point."},{"name":"Gheeti Nusrati","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" LOVe these","review":"I LOVE these earring sets!! They’re so cute and great for sensitive ears! The packaging and hand written note were a great touch!!!"},{"name":"Stephanie","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Heck of a deal!","review":"Lots of pretty earrings for a fraction of the price! Would buy again"},{"name":"Antwine jordan","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" GET THEM","review":"Love these earrings I paid 12$ for 36 pairs in love with all of them! Obviously fake but they are so cute ! 10/10🥰"},{"name":"Vallan Marie Lewis","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Super Cute","review":"They’re super cute but they fade fast so clear polish them"},{"name":"Jeremy Gaylor","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Exactly what you pay for!","review":"I was sooo unsure about purchasing these because it seemed unbelievably cheap for the amount of earrings you get, but, I Absolutely love every pair! Amazing deal if you’re looking for a variety of fake/cheaper gold earrings for a good price!! also came in a cute bag with this sweet hand written note :) really really happy! Thank you!"}]},{"id":"RyhUYl","title":"Dainty Layered Initial Necklaces for Women, 14K Gold Plated Paperclip Chain Necklace Simple Cute Hexagon Letter Pendant Initial Choker Necklace Gold Layered Necklaces for Women","imageUrl":"https://m.media-amazon.com/images/I/513jmV-V1aL._AC_UX385_.jpg","price":"$14.99","description":"Product description","totalReviewCount":"35,787 global ratings","averageStarRating":"4.6/5","reviews":[{"name":"Peyton","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Gorgeous","review":"Rose gold is probably my favorite thing in the entire world. So when I saw this, I knew I needed to have it. I’ve worn it 24 seven for about two weeks now and it has not turned my skin green or faded in color at all. I’ve even worn it in the shower, and it is still fine. I wouldn’t recommend showering with it, but I’m just saying that I do and the necklaces haven’t been affected. I have received many compliments on it, and was very satisfied with my purchase."},{"name":"Hillary","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" AMAZING AMAZING AMAZING!!","review":"I had actually ordered from this company before and got the gold initial bracelet (which is also very amazing). The quality of this necklace is unbelievable. It feels so expensive and looks amazing. I have worn the necklaces of course together as well as separate and I absolutely love it! It comes so nicely packaged. Hands down 10/10 recommend! It is so so so nice! Does not look cheap at all, does not feel cheap, nothing about it says cheap. So if you are giving it as a gift, it comes in a cute little black box and then each necklace is in its own back and then those bags are places in another bag. A small shinning cloth is in the box as well. It's incredibly nice. Love this company!"},{"name":"Brianna","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Good for price","review":"I’m very skeptical buying stuff off  especially jewelry and clothes. The color is very yellow gold and the material feels cheap almost like plastic. However for the price I love it. It adds a lot to a lot and I would recommend.\nI also got sent the wrong letter and this company sent me the right one immediately."},{"name":"Lacey","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Durable, but looks nice","review":"I have gotten soooo many compliments on my necklace. People were asking me where I got my necklace because they had paid a lot of money for theirs and theirs broke within the same day/week. I have a 9 month old boy who pulls on my necklace multiple times a day, and still staying strong with no issues. I love it and it is such little cost for this! And it looks so nice!"},{"name":"nicolle clark","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect","review":"I bought this to wear to a wedding and have worn it everyday since the wedding. I get compliments on it all the time. I shower with it on and it has not changed or tarnished. Amazing for the price. Love wearing the smaller chain by itself too."},{"name":"EiMadeULook","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Trendy","review":"The gold is deceiving - looks a tiny bit more rose gold than other gold necklaces I have, which makes it hard to mix and match with other necklaces. I do like that they are separate necklaces and not attached."},{"name":"Laura young","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Cute necklaces","review":"I will say these necklaces are very cute! However, if you have sensitive skin, they may not be for you. I do not like taking necklaces on and off again, and this necklace tends to leave me with rashes because of it. Otherwise, good quality necklaces."},{"name":"Taylor C","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Doesn’t rust","review":"I’ve had this necklace for a while. It’s great for Layering and it hasn’t rusted yet hoping it never rust would buy another if I lost it"},{"name":"Anita Bock","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Lovely","review":"Love this necklace set, seems to be lasting well without discolouring so far"},{"name":"Shirley Heng","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Good quality Jewelry. Value for the the spend.","review":"As advertised. Looks like the pic provided. Good quality and came nicely packed. Will be great as gift. A lot of details put into this precious handmade Jewelry."},{"name":"Anonymous","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Amazing quality, I’ve had so many compliments!","review":"I love love love these necklaces!"},{"name":"Molly","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Beautiful necklace","review":"So lovely, great quality.\nWorth the money have bought more necklace's from this collection."}]}]