[
	{
		"category": "Jewelry",
		"id": "41i8a0",
		"title": "Betsey Johnson Woven Mixed Multi-Colored Bead Flower Heart Illusion Necklace",
		"imageUrl": "https://m.media-amazon.com/images/I/714BWOnwhZS._AC_UY695_.jpg",
		"price": "$48.00",
		"description": "Product Details\nMaterial\nGlass, Plastic, Metal\nCountry of Origin\nChina\nAbout this Item\nIllusion necklace featuring mixed faceted beads, delicate stone accents, lovely flowers and heart embellished with woven mixed multi-colored charms. Necklace is set in gold-tone metal with a lobster clasp closure.\nGold-tone metal with glass and plastic\nLength: 16\" + 3\" Extender\nFrontal Drop: 3.5\"\nLobster clasp closure\nImported\nDescription\n\nBetsey Johnson illusion necklace featuring mixed faceted beads, delicate stone accents, lovely flowers and heart embellished with woven mixed multi-colored charms. Necklace is set in gold-tone metal with a lobster clasp closure.\n\n\n\n\nNew York designer Betsey Johnson has built her long-standing career in fashion by following her own set of rules. Known for her celebration of the exuberant, the embellished, and the over the top, Betsey has been rocking the fashion industry with her unique and original designs since the 1960’s. Her commitment to remain true to her one-of-a-kind vision has afforded Betsey continued success in an industry known for its fickleness. Her ability to change with the times while keeping her designs pure has not gone unnoticed. At the 1999 CFDA Awards, Betsey was presented The Timeless Talent Award created especially for her, which recognized her influence on fashion throughout her career.\n\nBetsey was born in Connecticut and spent her childhood in dance classes. Her aspirations to be a dancer and her love for costumes laid the foundation for Betsey’s creativity and inspiration, which is still evident in her designs today. In 1964, Betsey officially entered the New York fashion scene by winning Mademoiselle magazine’s “Guest Editor Contest.” One year later, she landed the top designer position for Paraphernalia, a clothing boutique that at the time housed the hottest young London designers, including Mary Quant and Paco Rabanne, among others. What would soon become known as Betsey’s trademark look began its formulations here: sexy silhouettes, hippie inspired flowing fabrics, whimsical detailing and, most importantly, a fabulous fit.\n\nNow firmly part of what was considered the “Youth Quake,” Betsey soon found herself in the unforgettable 1960’s Warhol scene. Edie Sedgwick was her house model, while the Velvet Underground’s John Cale took to wearing her designs both on-stage and off. In 1969, Betsey began her foray into retail by opening a new boutique called Betsey Bunki Nini. Directly following the opening store Betsey was offered a job from Alvin Duskin in San Francisco and thus began living a bi-coastal life for the remaining years of the 60’s.\n\nAlong with the new decade came new career opportunities for Betsey and in the early 1970’s, she came into creative control of the label Alley Cat, a label which set the trends for the 70’s rock n’ roll clothing, with bohemian and ethnic styles. In 1972, along with Halston, Betsey won the coveted Coty Award becoming the youngest designer to ever receive the honor.\n\nAfter a decade of designing for other labels, Betsey decided to make a dramatic change in her life and in 1978, she formed a partnership with Chantal Bacon and started the Betsey Johnson label, as it is known today. Designing for herself allowed Betsey the creative freedom to execute her vision to its fullest potential. The same year Betsey and Chantal launched their first retail store in the heart of Soho. In the early 80’s, they were one of the first to open a store on Melrose Avenue in Los Angeles, helping the street to gain its worldwide recognition as one of the best shopping areas of the 1980’s. Today there are over sixty-five Betsey Johnson stores worldwide. International expansion came in 1998 with the opening of the wildly popular London store. In 1999 the Vancouver store opened marking the company’s first move into Canada, where there are now four locations in various provinces. In September 2006, the first Betsey Johnson store opened in Japan. Betsey Johnson clothing is also available in better department stores as well as in specialty stores throughout the United States and numerous countries around the world.\n\nThe year 2003 marked some exciting licensing endeavors for the company, taking Betsey’s signature prints and whimsy to new audiences with categories including handbags and lingerie. She continued this trend and has since added footwear, belts, eyewear, watches, jewelry, swimwear, legwear, outerwear and a fragrance thus effectively emerging as not only a clothing designer but a top American Lifestyle brand.\n\nIn late 2002, Betsey was honored with an induction into the Fashion Walk of Fame, honoring her contribution to American fashion. A bronze and granite plaque containing an original sketch, signature and biography was embedded into Seventh Avenue sidewalk in early 2003. In March 2005, the Signature Awards and NAWBO-NYC committee honored Betsey with the 2005 Lifetime Achievement Award. And following that, Betsey received the Lifetime Achievement Award from the Accessories Council in November 2005. Betsey Johnson was also honored with the Designer of the Year Award at the annual Fashion Accessories Benefit Ball (FABB) in May 2007 and was recently honored with the National Arts Club Medal of Honor for Lifetime Achievement in Fashion in October 2009.\n\nA survivor of breast cancer, Betsey continues to be a strong advocate in the fight against the disease, making public appearances, participating in numerous fund raising events and creating one-of-a-kind items that have been auctioned off to raise funds for many charities. In 2003, the CFDA asked her to be an Honorary Chairperson for the Fashion Targets Breast Cancer initiative, which she graciously accepted. In April of 2004, she was awarded another honor by the National Breast Cancer Coalition (NBCC) for her continuous fight against Breast Cancer at a prestigious ceremony hosted by Ron Perelman. In Spring of 04, she teamed up with Geralyn Lucas, the author of the book “Why I Wore Lipstick...to my Mastectomy,” designing an accompanying t-shirt which was launched in Betsey Johnson stores nationwide in October 2004 at a series of events called “Courage Nights.” Courage Night continued for its second year in October 2005 where CFDA Fashion Targets Breast Cancer and SELF Magazine joined the cause. Johnson continues to support, hosting a charity event each October in her boutiques nationwide and internationally, as well as creating limited edition products from which a portion of the proceeds are donated to various breast cancer related charities.\n\nBetsey Johnson, both the woman and the label, is constantly moving forward and continues to keep a strong foothold in the fashion industry with no signs of letting up anytime soon. Her love of detail and design is evident in everything she does in life and in business. Her enthusiasm, creativity and boundless talent that have kept her at the forefront of fashion for the past 45 years will keep Betsey going for years to come.\n\n“Making clothes involves what I like…color, pattern, shape and movement…I like the everyday process…the people, the pressure, the surprise of seeing the work come alive walking and dancing around on strangers. Like red lipstick on the mouth, my products wake up and brighten and bring the wearer to life…drawing attention to her beauty and specialness…her moods and movements…her dreams and fantasies.” – Betsey Johnson\n\nAs one journalist recently quoted, “If Betsey Johnson didn’t exist, we would have to invent her, simply to remind ourselves that fashion can be fun. She’s the original wild child and set to paint the town pink!”\n\nSee more\nAbout this Item",
		"totalReviewCount": "4,086 global ratings",
		"averageStarRating": "4.4/5",
		"reviews": [
			{
				"name": "Michelle L. Beck",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " LOVE IT!!!",
				"review": "I love ’s new concept of “try before you buy” even though I have found that I usually buy what I try. This is one of those things that I have had on my wish list for a while, but couldn’t justify spending the money - other bills and things were more important. But the other night, with a little Christmas melancholy and hope, I said “I deserve something whimsical and fanciful this holiday season. I work too hard not to order something every now and then that I want, but don’t necessarily need. Besides, if not now (during these crazy times), then when?” So what could it harm if I click, “try for 7 days before you buy it.” This was really because I thought that MAYBE I would’t really keep it. Guess what, I LOVE IT. It is so unique and fun, that I didn’t even wait on the 7 days to expire before clicking keep/buy. \n\nThis Betsey Johnson necklace is beautiful. It is a mixture of layers, beads, and fun!! It is colorful - accented by hearts, flowers and beads. It is whimsical and fun. It will match any and everything. This was the perfect purchase with the exception of the packaging. Maybe it was because this was a “try before you buy” item, but this necklace literally arrived in a ziplock baggie. No thrills or frills at all, which was disappointing since this necklace is so pretty. Personally, I think the packaging should match the look of the necklace - nice. With the exception of the packaging, this necklace is 5 stars."
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful. Did break but was able to fix it pretty easily",
				"review": "Bought this for one of my older teen daughters who absolutely loves necklaces especially very feminine or vintage-looking ones that are layered and it's a real eye catcher! Exquisite for sure. She's received so many compliments when she wears it. I'd love it for myself, too. If you want to jazz up a look, this is the necklace to do it. The chain part did separate from the round connector after one or two times of wearing it and I was able to very carefully insert it back and take small needle nose pliers and pinch it back together without any issues. Otherwise, very beautiful and a nice gift."
			},
			{
				"name": "D.J.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Disappointed by how it looks in person.",
				"review": "So disappointed by how it actually looks in person - gaudy , bulky and , well, cheap looking . Should have ret'd. Still trying to think of who I can gift it to but can't think of anyone to give it to who would like it. Highly disappointed!"
			},
			{
				"name": "Melissa Guillory",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Improved Packaging",
				"review": "This necklace is beautiful! Even more so in person! I was a little worried about the packaging issues everyone was complaining about, but I received it wrapped in bubble wrap which prevented tangling. It has a little weight to it, but I just love it!"
			},
			{
				"name": "Lesli Hall Jesus",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " A little too short for me I expected it to be longer",
				"review": "It was too short for me expected it to hang down more"
			},
			{
				"name": "Paula C.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Betsy Johnson Necklace",
				"review": "Really loved the necklace, I bought it for my sister as a birthday gift and she loved it."
			},
			{
				"name": "Julia Rodeillat",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " It’s beautiful, but pricey and tangles easily",
				"review": "I definitely loved this necklace! I don’t like the fact that it twist and gets tangled. The bead work on it is very beautiful, but I think it’s a little pricey."
			},
			{
				"name": "Carol A.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Made beautifully!",
				"review": "Given to my future daughter-in-law"
			},
			{
				"name": "Jane H.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " I absolutely LOVE this necklace!",
				"review": "I was searching  for a long necklace but somehow this short one caught my eye, even though it's much quirkier and \"younger\" than my usual style (I'm in my 50s). Because it's by Betsey Johnson from whom I have an adorable little purse that I love and get compliments on all the time, I decided to take a gamble and order it anyway. I'm so glad I did - it's absolutely beautiful and I'm sure I'm going to get lots of compliments on it too. It goes with so many of my different outfits, both work and casual. If you're thinking about buying this necklace, you won't regret it."
			},
			{
				"name": "CJ Cutayne",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "2/5",
				"reviewTitle": " Terrible Packaging",
				"review": "Terrible Packaging. They basically throw it at you in cheap plastic bag like you just bought it at a garage sale. Hopelessly all tangled up of course and took over 20 minutes to get it untangled. Luckily it did not break in the process but we needed tools to get it done."
			},
			{
				"name": "Judith Bird",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Not great quality",
				"review": "Getting great compliments on the design. I personally love it, but unfortunately the metal has turned and tarnished. Happened after only one wear. I still wear it though"
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Don't waste your money",
				"review": "Returned it the day after it arrived, should have been pretty but it looked cheap and damaged. It came in a ball in plastic wrap and was tricky to untangle.\nNo worth the money and certainly did not look as advertised."
			},
			{
				"name": "femme heureuse, homme heureux",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " femme heureuse homme heureux",
				"review": "Tres jolie, delicat et ensemble parfait. Elle l`a aimer du premier coup d`oeil. Merci pour elle. MAINTENANT pour moi une explication serait demise, j`ai payer $62.40 + tx = $71.74 quand l`etiquette accrocher au collier affichait $48.00. Une explication SVP. Merci."
			}
		]
	},
	{
		"category": "Jewelry",
		"id": "7L9B6c",
		"title": "Ring Indoor Cam, Compact Plug-In HD security camera with two-way talk, Works with Alexa - White",
		"imageUrl": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/51ajZq9tiML._SY355_.jpg",
		"price": "$59.99",
		"description": "About this item\nCompact plug-in indoor camera that lets you see, hear and speak to people and pets from your phone, tablet, or select Echo device.\nWatch over your entire home by connecting one or multiple Indoor Cams to all your Ring devices in the Ring app.\nWith a Ring Protect Plan (subscription sold separately), record all your videos, review what you missed for up to 180 days, and share videos and photos.\nWith Live View, you can check in on your home any time through the Ring app.\nEasily setup your Indoor Cam by plugging into a standard outlet and connecting to Wi-Fi.\nPlace on a flat surface or mount to a wall with the versatile mounting bracket.\nFor added peace of mind, pair with Alexa to help you keep an eye on your home. Connect with Alexa to hear motion alerts on your compatible Echo device or see a Live View with an Echo Show, Fire TV, or Fire Tablet. Talk to visitors by saying, “Alexa, talk to the front door.” With a Ring Protect plan (subscription sold separately), Alexa can also make voice announcements and automatically show live video feed on an Echo Show, Fire TV, or Fire Tablet when your Ring Indoor Cam detects a person.",
		"totalReviewCount": "86,416 global ratings",
		"averageStarRating": "4.7/5",
		"reviews": [
			{
				"name": "Chris Kranske",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Very High Quality Picture in a Very Small Can!",
				"review": "You can mount this from the back of the camera or as it is shown in the picture with the mount on the bottom. It is very petite as it is smaller than the small cans of V8..... However, the picture quality is very good and in high definition as advertised. It also has a wide viewing angle. I gave this a 4 star rating only because Ring is very vague when it comes to the cost of the cloud storage system (Protect Plans) and the cost of each plan. For instance, 1 device is $3.99 a month. 2 devices are $7.98 a month. or $79.98 a year. So if you have 3 devices or more it's $100.00 a year or $10.00 a month. You must purchase a plan to store videos. They do make a storage device but from the vague information about that, it appears you must still purchase one of the protect plans."
			},
			{
				"name": "TC",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " I OWN NUMEROUS RING ID CAMS *****NEW UPDATE 11.21.20*****",
				"review": "I own 5 Ring indoor cams, along with a Ring Elite doorbell and a stick up elite POE cam. This is just my input regarding these cams as I have been testing them and using them for quite sometime. First thing is not every indoor cam works the same, some arrive with older firmware and need updating. Plug in close to your router and do the full set up and do your updates. Once you add the cam to the app and it’s working well, unplug it and move it to the area you want to monitor. Do your set up either by mounting it or setting it on a shelf. Get the angle of view your looking for and then set up your motion zone and sensitivity. Make sure you check the “health” box to see your signal sensitivity. If you are using a mesh router network, you should reconnect to the closest link for it, if not you may have to reconfigure to the nearest of it isn’t automatic. Make sure you turn on the snapshot option as well. If you don’t want to have the indoor cams record or send alerts while your home, you can turn that ability on and off with the new quick access buttons in the app. You will get 30 days of free recording for ALL your cams, with each cam you buy. So if you decide to buy one a month, till you cover all your angles in the home, you will literally get an additional 30 days for every cam on your network covering the 50 days of cloud storage for free. Why not use this option while it’s still available. After you cover your needs, opt for the yearly service. I have 5 indoors cams, covering almost 4000 sf. I love that I can drop in and watch over the home as well as hear and talk through the cams. Night vision in a room is great too. Makes a great baby cam as well. I have had 2 indoor cams give me problems in the past, either dropping off my network, or the snapshot option not working. If you have read my ring reviews before, I am well versed in networking and I have found that some ring reps want to always point the finger at every else but their devices. I can say I have found problems in a couple of their devices and once they were replaced, the problem was solved. Don’t allow them to drive you insane, the community forums are good but they only can go so far for help as well. Sometimes a quick swap of the unit with a new one solves the problem.  has always backed me and they are truly behind their customers.\n\n4/2020: I wanted to be able to watch the main entrance and hallway in my home, have an eye level view, no wires at all showing, and nothing that stood out of place. So review the attached pics, maybe this install will gravitate people who are inclined to custom installs, know there is no limit to what you can do. Just plan out your work and never rush. I was able to recess an indoor cam into my wall, and still provide me with all the aforementioned needs. I used a double electrical box as it provided me the necessary room without modifying the box. I used an indoor/outdoor ring power supply and reused the indoor cam plug on the power supply as it fits perfect and locks in. I obtained 120v power from a nearby electrical outlet, and brought my wire into the box from behind the wall. I mounted the ring power supply on the back of the electrical box, and prepped the box to accept the camera. I created a clear acrylic template and was able to use that to cut out the blank wall plate. What’s really nice is I can still unscrew the wall plate and easily remove the cam if I need to do a reset or adjustment. This solved many issues for me and still provided an eye level video shot of persons entering the front door. Since the ceilings are 12’ high, mounting the cam at the ceiling with a downward angle wasn’t conducive in getting a good facial shot. This is just one example of several I have designed myself to combat issues most of us have dealing with wires, angles, placement, etc.\n\n11.21.20: After almost a year of Ring use, I have to say I am disappointed in the Ring community forum, their tech support, and products. Just recently, I had two of the ID cams drop offline. No matter what I did, no luck getting them back to work. I actually unplugged a back up ID can and went to move it, that one also dropped offline and never came back up. Tech support was of no help, and the community forum mod just tells you to call in.\n\nI would think using 10 ring cameras, I know a little about them. Based on my research, they connect to WiFi, but can’t get to the internet. It appears that there is a high probability that my ISP is blocking the camera for possible threats, even though I turned off my firewall, set up a DMZ zone, and just about created a WiFi bridge to push the Ring cameras too, they still won’t work. They don’t play nice since the last firmware update. So as they fail, I am replacing them with another company. Honestly, I don’t care what brand I use, as long as it works. Read the community forums, and see for yourself. Setting up cameras is not really that difficult, troubleshooting isn’t either as long as you have full control of all devices. Ring doesn’t allow for device control outside of normal settings. Also, Ring devices CAN NOT, be wiped clear of stored memory setting for your home network. It’s embedded in the device. Even if you remove it from your home network, and sell it. It still has your network mirrored in its memory. Found this by pure chance. At the very lease you should have the cams IP address to clear out stored info and reset it. Wow"
			},
			{
				"name": "Mary Morelli",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Good For Monitoring Home But Could Use Improvements",
				"review": "Overall these are great cameras but some features could use some improvement.\n\nI bought these specifically to help monitor my home and pets with health issues when I'm away. The motion detection works great on most of them but the camera in my larger living room space never picks up my pet's movements. Since I bought them to help track health problems, not being able to pick up on the movement in that room has been an issue.\n\nThe speakers on these are also not that great. I've tried speaking through them when someone was at my house checking on the animals and they could barely understand me. Since two way talk was part of the selling point on these it's a little disappointing."
			},
			{
				"name": "MP",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great security system on a budget",
				"review": "These cameras are great and have great quality recording. You have the options to pay and be able to see recordings of movement or just buy the camera and see the live view only. We have kids and love to be able to go back and see what happened when a kid comes out crying and no one’s talking. (: would recommend"
			},
			{
				"name": "Kenneth",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great Camera",
				"review": "Great camera, easy setup, great motion detection, and live view with audio and microphone. I attempted to set it up at first in the bedroom window facing out, but the nighttime view is not that great, obviously since this isn't marked as an outdoor camera with night vision or anything. Still monitors indoors great, and outdoors in the daytime."
			},
			{
				"name": "Emily Ballard",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Bought to monitor the comings and going at my aging father’s house.",
				"review": "Love Ring products. We place this camera in the window of my dad’s house to monitor who is coming and going while we are not there. Needed something quick and easy to install. Only complaint is that we sat thins in the window looking out at driveway and glare is an issue. Had to turn night vision off to see anything. Working on a solution."
			},
			{
				"name": "Rick",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Slow to display",
				"review": "Pretty easy to set up and works pretty well. My only issue is that it is very slow to display the image on the app when someone is detected. Kind of misses the point of being able to see and respond quickly when someone is at the door"
			},
			{
				"name": "Bill Richards",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Very sensitive to motion and clear picture",
				"review": "Excellent for the price. Only missing feature is live monitoring. I wish there was ability to do that even for a fee. Alerts are great."
			}
		]
	},
	{
		"category": "Jewelry",
		"id": "w3xV0F",
		"title": "Swarovski Attract Crystal Jewelry Collection, Rhodium Tone Finish",
		"imageUrl": "https://m.media-amazon.com/images/I/61u7aNPgQCL._AC_UY395_.jpg",
		"price": "$69.00",
		"description": "Draw them in with your impeccable looks wearing the Swarovski® Attract Circle Pierced Earrings featuring a silver-tone rhodium plating with white crystal accents throughout.\nPost back.\nPresentation box included.\nImported.\nMeasurements:\nWidth: 3⁄7 in\nHeight: 5⁄7 in\nWeight: 0.01 oz",
		"totalReviewCount": "6,362 global ratings",
		"averageStarRating": "4.5/5",
		"reviews": [
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Really lovely",
				"review": "I ordered these for an ultra-fancy black-tie wedding where most of the women were loaded with diamonds. I actually thought these earrings were prettier than the diamonds worn all around me. Especially for this price, this is a wonderful find."
			},
			{
				"name": "Asheley Gonzalez",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Stunning 😍",
				"review": "So gorgeous these are my every day earrings now absolutely stunning"
			},
			{
				"name": "Jose Carlos Correa",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Excelente",
				"review": "Excelente"
			},
			{
				"name": "Alfie D",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " They are beautiful, delicate, exquisite!",
				"review": "Wished the closure was different & that the pendant can become detached & I easily."
			},
			{
				"name": "Abby",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Beautiful necklace",
				"review": "The necklace is beautiful. The stone is about 1 carat size and very sparkling! The only complaint that I have about this item is that the chain looks flimsy and dull."
			},
			{
				"name": "LUZ BATISTA",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Good!",
				"review": "Excelente para regalar"
			},
			{
				"name": "Stephen Damato",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Girlfriend loved it, good build quality",
				"review": "25 year old male got this for my 20 year old female girlfriend for Christmas.\n\nComes in an okay bag. Did come tangled from  but untangled easy and was able to set it up for a nice gift display.\n\nChain is a little fragile But 4 months and it’s held up fine. Size is a little small but all in all gal was happy"
			},
			{
				"name": "Amy Harris",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Travels but pretty",
				"review": "Crystal doesn’t slide on chain so it travels to the side and back of the neck. It’s very pretty, though."
			},
			{
				"name": "Matteo Immorlano",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " SPROVVISTA DI CERTIFICATO",
				"review": "Ho acquistato questa collana per un regalo di compleanno. Dopo aver comprato una prima collana, ho fatto presente che nella confezione era assente il certificato di originalità, dunque può trattarsi di una collana qualsiasi agli occhi del ricevente. Così ho proceduto ad acquistarne un’altra (rassicurato dal venditore che quella nuova lo avrebbe avuto) e ho proceduto al reso con la prima collana. Oggi ho ricevuto la seconda, ma anche questa sprovvista di certificato. Dunque sarò costretto a consegnare il regalo in vista del compleanno imminente. Sconsiglio l’acquisto, nonostante la buona fattura del prodotto, a chi dovesse fare un regalo"
			},
			{
				"name": "Punzipanz",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " bello ma senza garanzia",
				"review": "gioiello bellissimo ma nella confezione manca la garanzia che di solito è presente in tutti gli artocoli swarovski. come posso averla?"
			},
			{
				"name": "Erika",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Dettagli molto ben fatti",
				"review": "Bellissimo punto luce! Si può tenere anche più largo ma a me piace tenerlo alto. Non lo tolgo mai, neanche sotto la doccia e a distanza di un anno è ancora perfetto! L’ho preso anche come regalo per mia mamma e le è piaciuto tantissimo! Assolutamente consigliato sia come idea regalo che autoregalo 😄"
			},
			{
				"name": "Daniel Gerstner",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Skepsis und mangelnde Qualität",
				"review": "Kette sieht gut aus, aber bezweifle die Echtheit. Es lag kein Zertifikat bei.\n\nUpdate: Nach gut 3 Monaten verfärbt sich die Kette bereits!"
			},
			{
				"name": "Dionysius",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Missing Necklace",
				"review": "I received a Swarowski box but the necklace was not inside! The box was not damaged. Did someone forget to include the Necklace?"
			}
		]
	},
	{
		"category": "Jewelry",
		"id": "dwHrHK",
		"title": "Echo Dot (3rd Gen, 2018 release) - Smart speaker with Alexa - Charcoal",
		"imageUrl": "https://m.media-amazon.com/images/I/61MZfowYoaL._AC_SX425_.jpg",
		"price": "$24.99",
		"description": "Meet Echo Dot - Our most compact smart speaker that fits perfectly into small spaces.\nImproved speaker quality - Better speaker quality than Echo Dot Gen 2 for richer and louder sound. Pair with a second Echo Dot for stereo sound.\nVoice control your music - Stream songs from  Music, Apple Music, Spotify, Sirius XM, and others.\nReady to help - Ask Alexa to play music, answer questions, read the news, check the weather, set alarms, control compatible smart home devices, and more.\nVoice control your smart home - Turn on lights, adjust thermostats, lock doors, and more with compatible connected devices. Create routines to start and end your day.\nConnect with others hands-free - Call friends and family who have the Alexa app or an Echo device. Instantly drop in on other rooms in your home or make an announcement to every room with a compatible Echo device.\nAlexa has skills - With tens of thousands of skills and counting, Alexa is always getting smarter and adding new skills like tracking fitness, playing games, and more.\nDesigned to protect your privacy – Amazon is not in the business of selling your personal information to others. Built with multiple layers of privacy controls including a mic off button.",
		"totalReviewCount": "993,657 global ratings",
		"averageStarRating": "4.7/5",
		"reviews": [
			{
				"name": "Brock",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " White Elephant champion",
				"review": "This christmas season I was invited to a white elephant gift exchange with a limit if 15 dollars. For 14.99 on sale, this fit the bill. I got it in the mail 2 days later, wrapped it up, and off to the party I went. I set it underneath the tree with all the other gifts, had a holiday feast with all my friends and overall there was nothing but good spirits in the air. That was until the white elephant began. First person grabbed the gift opened it up: a blanket. Next: Corny waffle maker. A few more corny gifts go by, I must say its hard to find a good gift under 15 so I appreciated some of the \"haha\" gifts. But then, the echo dot was opened up. And when I say \"all hell broke lose\"...I mean it. It started getting stolen immediately. Followed by fist fights for it. Then arguments about who went over the budget. Knowing I was the one who bought it, I kept my mouth shut and watched in horror. Remember that waffle maker? It became a tool of destruction and violence. That blanket? A suffocation device. After the 4 1/2 hour brawl was over...There was no echo dot left behind. It was destroyed in the chaos. All that was left was bruises and blood. 5 stars is an understatement for this product. A product so good it was worth fighting over. At 14.99 the price to performance ratio is simply off the charts. 6/5 stars."
			},
			{
				"name": "Edward",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " A Versatile and User-Friendly Smart Speaker",
				"review": "As someone who is new to smart speakers, I was a bit intimidated by all of the features and capabilities, but the Echo Dot has been very user-friendly and easy to set up. The setup process was straightforward and I was able to get it up and running in just a few minutes.\n\nOne of the things I appreciate most about the Echo Dot is the versatility of its voice assistant, Alexa. She is able to perform a wide range of tasks, from answering questions and providing information to setting alarms and playing music. I've found her to be very responsive and accurate, and it's been convenient to be able to ask her to do things without having to fumble with my phone or computer.\n\nIn terms of sound quality, the Echo Dot is certainly not the best speaker out there, but it's more than sufficient for most purposes. I've been able to use it to play music and podcasts, and the sound is clear and distinct. The design of the Echo Dot is also sleek and modern, and it fits in well with my home decor.\n\nOverall, I'm extremely happy with my purchase of the Echo Dot and would highly recommend it to others. It's a versatile and user-friendly smart speaker that has quickly become an integral part of my daily routine."
			},
			{
				"name": "T.J.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Game changer",
				"review": "Oh man, the Echo Dot (3rd Gen) is seriously the best thing since sliced bread! Not only can I control all of my smart home appliances with the power of my voice, but the drop-in feature has completely changed the way I communicate with my kids on the other side of the house.\n\nGone are the days of yelling and running through the house to deliver a message. Now, I can just drop in on their room and have a conversation with them as if we were in the same room. It's like magic, except I'm not a wizard (just a tired mom trying to make her life a little easier).\n\nBut seriously, the Echo Dot has been a game-changer for our household. Not only is it convenient, but it's also a lot of fun. We love playing music and using the various voice commands to make our lives a little easier.\n\nOverall, I highly recommend the Echo Dot (3rd Gen) to anyone looking to upgrade their home with some smart technology. It's been a lifesaver for me and I can't imagine going back to a world without it."
			},
			{
				"name": "Kelly",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " I love Alexa!",
				"review": "I never cared to get an Echo Dot before but I saw it on sale for $15 around Christmas so I figured I'd try her out. When I first set her up, I literally had hours of fun messing around with her, setting up routines, looking at her skills and games, etc. Alexa has become very useful. Instead of Googling the weather or news I can just ask her, which is incredibly useful for when I'm doing chores around the house. I can multitask. Her speaker is actually super loud. I was thinking she was going to be pretty quiet because she's small, but but I was wrong. She also has safety features such as \"Guarding\" the house, detecting for specific sounds, like glass breaking. I can also use her on my phone with the  Alexa app. I actually enjoyed my Echo Dot so much I bought a second one for my bedroom! She's very useful for turning off lights, setting alarms and reminders, etc. I would definitely recommend trying an Echo Dot out, especially if it's on sale."
			},
			{
				"name": "LBI Girl",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Use It Multiple Times a Day",
				"review": "Its not only an alarm and timer. I ask it for the weather before I dress; to define and/or spell words, to remind me of tasks, birthdays, etc. to give me movie cast information, to give info on when sport teams are playing on TV or other TV events, to give background info on characters in movies or tv shows, etc. etc. etc. And, I have smart plugs so Alexa can turn things on and off. Of SIGNIFICANCE is the extensions of Alexa into my two bathrooms that, as a senior, give me peace of mind so if I fall or some other event happens and I need help, I can ask Alexa to phone a neighbor or friend or relative (as long as they are listed in your IPhone) to get help. (It cannot however call for Ambulance assistance at this time.) I have used it twice for that purpose. Also love getting music over it. I can ask for almost any song! I LOVE IT!!"
			}
		]
	},
	{
		"category": "Jewelry",
		"id": "UmUzGM",
		"title": "LEGO Marvel Super Heroes Infinity Gauntlet 76191 Building Set for Adults (590 Pieces)",
		"imageUrl": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/81uwk+ags9L._AC_SX425_.jpg",
		"price": "$63.99",
		"description": "LEGO Marvel Infinity Gauntlet (76191) is a challenging construction project that rewards the builder with an impressive display piece that perfectly evokes Marvel’s captivating style. This LEGO brick recreation of the iconic Infinity Gauntlet featured in the Marvel Studios’ Avengers: Infinity War and Avengers: Endgame movies is certain to attract attention and interest wherever it is displayed. With movable fingers, vibrantly colored Infinity Stones and a descriptive tablet attached to a sturdy base, this golden gauntlet provides an engrossing construction challenge and a finished model that will captivate all who see it. Escape the busy world and immerse yourself in the relaxing pleasure of adult LEGO building sets, perfect for anyone with an interest in creative construction or comic-book culture.",
		"totalReviewCount": "8,241 global ratings",
		"averageStarRating": "4.9/5",
		"reviews": [
			{
				"name": "Hazel Grant",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Happy",
				"review": "It was a gift. It is loveable and they enjoy doing it when they are not busy. It helps him to calm his emotions and open up his mind to thinking big."
			},
			{
				"name": "Walker009",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Perfect gift!",
				"review": "Bought this for my son-in-law. He’s a big puzzle and Lego guy. He loved it!"
			},
			{
				"name": "Jeremy S.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Perfect Christmas gift for my 11 year old fan",
				"review": "My son love this Lego kit and put it together in three hours"
			},
			{
				"name": "JBP",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Its cool",
				"review": "Its cool."
			},
			{
				"name": "Hannah",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great gift!",
				"review": "My boyfriend loves this! It’s so nice and fun thing to put together with each other."
			},
			{
				"name": "MJ",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Granddaughter loves this!",
				"review": "Gift for granddaughter"
			},
			{
				"name": "Lacy",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Fun",
				"review": "Fun set to put together. My nephew loved it!"
			},
			{
				"name": "Jacob Dvorchak",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Its ok",
				"review": "The peice on the sides pop out of place and the thumb bends kind of strangely but otherwise good and easily posable"
			},
			{
				"name": "Dan Murphy",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " A soul for a soul",
				"review": "Well my son is quite into Marvel and Lego so this seemed like a perfect fit for me to make him motivated. Naturally I opened up the package with the \"Infinty Stones\" and took them. When he got to the step of attaching them it was then I imformed him that his must go on adventures to retreive them. Examples were things such as establishing a proper circadian rythym to get the time stone, a workout routine to get the power stone, learning constellations to get the space stone, however he was eager and before I could establish a task for the soul stone he tossed his sisters guinea pig out the second floor onto the armour stone rocks. Needlees to say, this put a damper on the whole process but overall it looks great in my den."
			},
			{
				"name": "Gabriel Polleza",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Muito Bonito!!",
				"review": "Um Lego muito bonito para decoração, tamanho legal, cores fiéis as do filme!"
			},
			{
				"name": "Edgar I.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Asombroso",
				"review": "Excelente modelo para armar toma alrededor de 2 horas, el precio es caro tomando en cuenta los siguientes puntos:\n\n1.- Las piezas doradas se despintan (yo use guantes y dejo las areas de contacto manchadas esto indica que se despintara al contacto)\n2.- Le faltan piezas a la bolsa #1 en lo personal me falto un cuadro gris de 4 puntos que no me dejo ensamblar correctamente la vista frontal tuve que sustituirla por otro que tengo en casa.\n3.- Vienen piezas que no necesitas.\n4.- La caja llego dañada.\n5.- Este kit no tiene la herramienta que quita piezas."
			},
			{
				"name": "Victor",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " El articulo viene incompleto. Faltan piezas",
				"review": "En en la bolsa no. 3 dondw deben de venir las partes de los dedos, hacen falta algunas para el dedo pulgar. Siguiendo el instructivo hasta ese momento te das cuenta que faltan las piezas."
			},
			{
				"name": "Courtney",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great Gifft for Marvel Fan",
				"review": "Please keep in mind I gifted this to my 30 yr old boyfriend. He built it in 3 hours. The instructions were easy to follow which made it easy to assemble, and the results matched the product description perfectly. It looks really good and the fingers move! I also purchased a light up kit for the gauntlet."
			}
		]
	},
	{
		"category": "Jewelry",
		"id": "wldcf4",
		"title": "Swarovski Attract Trilogy Crystal Necklace and Earrings Jewelry Collection",
		"imageUrl": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/61T3xla2UPL._AC_UY395_.jpg",
		"price": "$115.00",
		"description": "Product Details\nMaterial\nRhodium plated\nCountry of Origin\nThailand\nAbout this Item\nSimple and elegant: This rhodium plated necklace combines the precision and quality of sparkling Swarovski crystals with the beauty and elegance of eternal love, for an eye-catching accessory\nMinimalist and unique: This mesmerizing pendant features a beautiful trio of clear crystals, that combines the past, present and future into a timeless design on a dainty rhodium plated chain\nDesigned to last: Swarovski jewelry will maintain its brilliance over time when simple care practices are observed; remove before contact with water, lotions or perfumes to extend your jewelry's life\nVersatile and eye-catching: Whether an everyday accent or a unique, conversation-starting accessory, this majestic pendant necklace is a simple piece that will complement any look on any occasion\nItems delivered: 1 x Swarovski Attract Trilogy Collection round crystal and rhodium plated pendant, 14 7/8 inch thin rhodium plated chain, 1/4 x 3/8 inch crystal pendant, with Swarovski necklace box\nSee more\nAbout this Item",
		"totalReviewCount": "3,899 global ratings",
		"averageStarRating": "4.6/5",
		"reviews": [
			{
				"name": "Danyl K Peterson",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Love, love, love!!!",
				"review": "I have sensitive ears and I usually cannot wait to take my earrings out at the end of the day.\nMy husband gave these to me as a Christmas gift and I put them on immediately. I slept in them and have not taken them out. My ears have zero irritation."
			},
			{
				"name": "Krina Hamilton",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great sparkle!",
				"review": "Love the earrings. First day I put them on I had 2 people tell me how pretty and shiny they were. Great gift for someone or yourself."
			},
			{
				"name": "L D",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Post is thick",
				"review": "Lovely earrings, but the post is very thick and I can't get them through my ears."
			},
			{
				"name": "Gary L.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Pretty earnings however, smaller than we expected",
				"review": "Liked the platinum & shine of Crystal's. Smaller than expected."
			},
			{
				"name": "Wildmanct",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Very elegant",
				"review": "Wonderful gift and excellent value"
			},
			{
				"name": "Larry Miller",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Swarski",
				"review": "Elegent\n\nThis was elegant!"
			},
			{
				"name": "Larissa Ibarra Lamilla",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Hermosos",
				"review": "Se los regalé a mi madrina el día de mi boda y le quedaron fabulosos."
			},
			{
				"name": "Ryntintyn",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Beautiful and stay in well, but hooks are a bit thick",
				"review": "I wore these for my wedding. They were the perfect look and were really beautiful. The hook is kind of thick, so it was a bit hard to get into my ear, which meant my ear lobes were all red by the time I was done getting them in, but they settled down in time for the ceremony. AND the clips on the back make sure they stay in for dancing and everything. Overall, I'm very happy with them!"
			},
			{
				"name": "Sara Asti",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " CONTRAFFATTI!",
				"review": "Delusissima, metterei zero stelle se potessi, sono CONTRAFFATTI, in foto potete vedere l'originale che è quello mostrato su  e il contraffatto a sinistra che differisce per peso, misura, materiale. Non è un pessimo orecchino ma non puoi vendere un falso mascherandoti dietro swarovski... Inoltre anche il cartellino e la scatolina seppur fatti bene riportano differenze che un usuale acquirente del brand nota.\nNon ci son scuse, io questa la chiamo truffa."
			},
			{
				"name": "Kindle Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "2/5",
				"reviewTitle": " Think about buying this?",
				"review": "Bought the earrings first then bought the necklace . Thought the necklace was poor value for money S the stones are very small. You get two sets of stones in the earrings and obviously one set for the necklace . I assumed as the cost was similar the necklace stones would be bigger?"
			},
			{
				"name": "Linda",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful",
				"review": "Love these. I don't like drop earrings that flop about and these dont and are great. Came boxed and with warranty/label. They look great. Very pleased."
			},
			{
				"name": "Liv",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great product, highly recommend",
				"review": "Beautiful earings. I wore these for my wedding as I had a very similar necklace I wanted to wear. These earings were cheaper here on  than the actual Swarovski website so absolute bargain."
			},
			{
				"name": "mrs.w ratchford",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Gorgeous",
				"review": "So many people compliment me. I’ve just bought another pair for my sister. So sparkly. Well worth it"
			}
		]
	},
	{
		"category": "Jewelry",
		"id": "G2d3zu",
		"title": "Adult Original Inflatable Dinosaur Costume, T-Rex, Standard",
		"imageUrl": "https://m.media-amazon.com/images/I/91w-z3hEn9L._AC_UX342_.jpg",
		"price": "$49.99",
		"description": "Product Details\nFabric Type\n100% Nylon\nCare Instructions\nSpot Clean as Needed\nOrigin\nImported\nCountry of Origin\nChina\nAbout this Item\nLONG SLEEVE inflatable jumpsuit with zipper closure on back and battery operated fan\nREAD BEFORE BUYING: Costumes are not sized the same as apparel, please review the Rubies SIZE CHART IN IMAGES to determine fit, recent reviews may also be helpful\nFan requires 4, AA batteries (not included); do not use rechargeable, nickel-cadmium; remove batteries from fan while not in use From Rubies, manufacturer of the Original Inflatable Dinosaur costume\nGROUPS AND FAMILIES: Combine with other costumes by Rubies; look for regular and inflatable designs in baby, toddler, child, adult and pet sizes, also look for accessories like candy bowls, masks and more\nFAMILY-FOCUSED, and based in the U.S.A. since 1951, Rubie’s has classic and licensed costumes and accessories in sizes and styles for your entire family\nDescription\n\nLong sleeve inflatable jumpsuit with battery operated fan. Fan requires 4 AA batteries, fan instructions included with costume. Batteries available separately. Please read before buying; costumes are not sized the same as apparel, please review the Rubies size chart in images, read recent reviews and Q & A to determine best fit. Look for Rubies trademark on packaging and labels to help assure you’ve received an authentic safety-tested item. Rubies offers all of your favorite dinosaurs inflatable designs; look for Velociraptor with Sound, Pteranodon, Triceratops, Velociraptor, T-Rex with Sound and the award winning inflatable dinosaur that started it all, the T-Rex; available in standard adult, plus-size and teen. Create your very own family of prehistoric fun and get ready for an unforgettable time.\n\nSee more\nAbout this Item",
		"totalReviewCount": "25,403 global ratings",
		"averageStarRating": "4.3/5",
		"reviews": [
			{
				"name": "John 771",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Looks awesome, not practical in warm weather.",
				"review": "So it looks awesome and survived an hour of the tail being dragged on concrete with nary a wear spot. Both my son and I loved it, until we were 1 block from the house.\n\nWe had an unseasonably warm and humid evening for trick or treating and this costume is completely enclosed and sealed with the only ventilation being from a crappy little fan the size of a golf ball. My son was blind within 2 blocks and had to stop, draw his arms inside and wipe the clear plastic in front of his face over and over. I had to verbally guide him most of the time and within 3 blocks he said it was like a sauna and he had to keep opening up and pull his body out to air out, then get back in and reinflate. We wasted almost an hour on 7 blocks then went home and changed into last year's costume and felt much better and got much further."
			},
			{
				"name": "MandaLynne",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " RAWR!",
				"review": "This costume is so awesome. I bought this to surprise my niece at her wedding reception as she has loved dinosaurs her whole life.\n\nOnce all the formal stuff was done, I snuck off to change into the costume with the help of my granddaughter. Once I was ready, she went back out, signaled my brother who signaled the DJ and suddenly the theme music to \"Jurassic Park\" started playing. That was my cue. I came out and the hilarity ensued.\n\nEveryone was cracking up. I went over to my niece and made her dance with me. She hugged me and said \"I love you so much, this is awesome\". I then danced with her new husband. It was a great time.\n\nAfterwards she came up to me to inquire if I had rented or bought the costume. I told her I bought it and asked if she wanted it. I received a resounding \"Yes!\" I told her it was hers. She said \"OMG! I have to go tell my husband. Oh, I just love saying that!\" and she ran off. LOL\n\nI retain the title of Best Aunt Ever!\n\nThe costume works really well. There is a very small, unnoticeable hole in the seam in the head but that is so the costume doesn't blow up - like kablooey blow up - the arms and legs have elastic and fit tight. It is easy to put on and inflates quickly and quietly. It does get hot after a while but the fan helps. I suggest wearing a tank top and shorts underneath. You'll need a tiny screwdriver to get the battery box open. All in all, a great costume, easy to wear, and sure to be the hit of any event."
			},
			{
				"name": "Luci D.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Foggy",
				"review": "Got this for my son for Halloween. Had a terrible time since the screen kept fogging up. He kept his head popped out most times. Filled up pretty quick though. Tail is a bit obnoxious. We ended up clipping is to the side. But it did not rip. We walked at least 4 miles in it and it help out. If you buy, just check your sizes prior to purchase and maybe purchase anti fog spray. 🤷‍♀️"
			},
			{
				"name": "KLoveLife",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " I won Halloween 😂",
				"review": "The costume was an absolute hit. There's no question about that.\nHOWEVER, the fan slowed down after less than an hour and then died shortly after...\nI used brand new duracell batteries, and they were not jostled or loosened, so it was most definitely the fan motor. I'm guessing they threw a discount on because they threw on the cheap fan.\nThankfully, I had a different blow-up costume, so I swapped the fans out. I will definitely buy a stronger one to install for next time.\nOverall I am happy with my purchase, but if it had been full price, I would've been pretty disappointed.\nAs long as you order a good fan as backup, it's totally worth it!\nI had a blast riding in the back of the truck with the jurassic park theme playing over the loud speakers, and later running around the neighborhood with my niece and nephew.\nThis Halloween was one for the books because of the costume 😊\n\nThe picture I posted is of just the costume blown up with the arm and leg holes tied off, so its even bigger on!"
			},
			{
				"name": "Susan",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Hilarious to use",
				"review": "This is a hilarious addition to our family. The first day we used it we had everyone in stiches of laughter. Well worth it for giggles and surprises. It inflates quite fast! The material is thin and only single stitched together so it can be easily ripped if you are wild. A seam did come apart but I duct taped it shut. Otherwise, I did quite a bit of walking around, sitting, jumping and climbing up steps with it and it held together. The elastic holds quite well around hands and feet to keep the air in while you move around. Just make sure your side or hips don't cover the fan as it's working because then the thing deflates. The face plastic is breathable and I could see through it enough to interact. It did come apart from the mesh in one corner but a tiny bit of duct tape sealed it right back up and you can't see the tape. Definitely buy one according to your height. Make sure you check that!"
			},
			{
				"name": "MJ",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Dinosaur down - hilarity ensued!",
				"review": "Got this for my 14 year old daughter for Halloween 2022. Hilarious. So she paired a stretchy dress on the outside of it because she didn't want the dino to be without clothing. The one drawback to the costume is it can fog up in both the viewing windows if you have a heavy breather like I do. We went to a work related function and she laid down in front of the bouncy houses where she was supposed to be watching her sister, because she was tired of walking around. The hilarity ensued when she was lying on her back and unable to get back up. She gave up and started eating M&Ms until it was time to go. Person after person came by and asked if they could help her up. Then watching her roll over several times until she got into the perfect stomach position to heft herself up.... priceless. Will update with a picture when I'm at my home computer. Totally worth the money for the entertainment value alone."
			},
			{
				"name": "Laura",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Totally amazing & hilarious",
				"review": "Besides it being so damn hot when you wear it, this thing is hilarious. I wore it at an elementary school function and the kids lost their minds. I'm 5'10\" and it just fits. If you're taller than that, note that the little feet will not reach down and cover your shoes. Once nice feature is the battery pack has a belt hook so you can secure it to your waist band."
			},
			{
				"name": "Bárbara Ramírez",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Disfraces...TODO UN ÉXITO",
				"review": "Compré dos de estos disfraces, ambos en talla de adulto ya que uno era para mí (mido 1.68) y mi hermano de 8 años (1.35) para salir con el a pedir dulces en Día de Muertos y definitivamente valieron cada centavo. Fueron la sensación y todo un exito (no paraba de pedirnos fotos y hasta dulces extra nos dieron)\n\nLeí muchos comentarios a cerca de que hace mucho calor pero es bastante tolerable, el problema real es que las ventanillas por las que hay que ver se empañan en menos de 15 minutos.\n\nCompré también unas baterías duracell Quantum y resistieron 2.5 horas de uso, así que contemplen que no es mucho el tiempo que te permite de uso un solo juego de baterías.\n\nEl envío llegó en tiempo y forma así como en buen estado. Los trajes no presentaron ninguna rasgadura o malfuncionamiento y resistieron perfectamente la fricción del pavimento al caminar sin daño alguno.\n\nDefinitivamente si quieres echarte unas risas deberías comprar este disfraz"
			},
			{
				"name": "Kirsty",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Plastic zip broke on first zip up, suit unusable!",
				"review": "Could not be MORE disappointed. This is our third inflatable trex costume, and this was the most expensive yet. We go to try it on today after just receiving it to ensure everything is working ok and the plastic zip literally snapped in half!!! I have never seen anything like it... Photo attached. As I said this is the third similar costume we have ordered from , our first was a cheap one for £25, the next, on the same style as this but for £50, both have metal zips (went and checked them after this incident!) and have been on and off multiple times and multiple people, but do seem to be of sturdier material. This was for an event on short notice, and now one of our party has nothing due to what I now feel is overpriced cheap quality merchandise. Contacting seller to get a refund! My advice, check what the zip is made of before purchasing any inflatable costume as clearly, the costume is reliant on fully properly sealed suit!"
			},
			{
				"name": "juan felipe garrido chimal",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Sr. T REX FELÍZ",
				"review": "Quería uno así desde hace un año y por fin lo tengo, también tenía duda de si me quedaría, Pero por si alguien tiene duda mido 1.82 mts y sin problema, tiene dos ranuras por las que puede ver una persona alta y una más bajita yo creo que de 1.6 mts también sin problema muchas gracias "
			},
			{
				"name": "S. Beard",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "2/5",
				"reviewTitle": " Nice looking costume, ruined by a poor quality zip. Don't buy!",
				"review": "Ok so on the one hand there is something truly impressive about this suit. In case it isn't clear you basically get inside it and there is a pump that inflates the thing like a baloon around you. It gives an extremely good effect, whilst it works.\n\nHowever there are two things I think any purchaser needs to knwo about this. Firstly, the pictures are a bit deceptive. At the time when I bought mine there were several suits that all looked pretty similar, however this one seemed to be the bet because its vents were less obvious. However this simply is not true, they have just been photoshopped out of some of the pictures, there are big orange vents on both sides which do slightly spoil the effect. More importantly however I don't think this is actually any better than the other similar looking suits so am annoyed I paid more to get it.\n\nThe second, and much bigger, issue is that the zip is of terrible quality. This matters because when the suit is inflated there is quite a lot of tension on it and also because it is simply quite hard to get the zip done up gently. During its short life this suit suffered three zip failures, in two of which the zipper came clean off of the zip. The zip however is not designed to be easily repared if this happens. If a hole develops in the zip then the suit deflates. This happened right in the middle of my daughter's birthday party, which was obviously a real shame. The cost savings for using this very poor quality zip for the manufacturer were probably pennies, which for a £65 suit is just plain stupid.\n\nOn this basis, though the effect was generally good, I would recomend friends and family not to buy this. I"
			},
			{
				"name": "Samuel H.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Fan not working",
				"review": "I have since received a perfectly working replacement of this product, and it works exactly as intended, just had some bad luck first time round. Will leave the old review below, but customer support was great and very helpful, and I received my replacement quickly with great quality!\n\nI ordered through  prime and the fan came preassembled, just needed to place in batteries. I put in brand new batteries and turned it on, but the fan would just not spin. I've tried two packs of AA Duracell batteries but the fan was not working. I have contacted customer support and am waiting for a reply, otherwise I'll be returning. Very disappointed having spent £75 on this."
			}
		]
	},
	{
		"category": "Jewelry",
		"id": "fkgkky",
		"title": "ALBATROSART -Squeezing Amber Collection- 33 Beads-Tesbih-Tasbih-Tasbeeh-Misbaha-Masbaha-Subha-Sebha-Sibha-Rosary (Clared Red 1 (8x12 mm - 33 Beyzi Beads)",
		"imageUrl": "https://m.media-amazon.com/images/I/61xeX-SAdKL._AC_SY450_.jpg",
		"price": "$36.99",
		"description": "Nice design Muslim prayer beads.\nThis Turkish style prayer beads are smooth to the touch and enjoyable to use.\nInformation about these natural stones is based on individual experience and should not be considered as medical advice.\nInadvertent use of it will not be our responsibility.\nATTENTION:\nAs different computers display colors differently, the actual item may vary slightly from the above images, thanks for your understanding.\nAll dimensions are measured by hand, so there might be a very slight variation.\nSAFETY INFORMATION:\nDetergents and lotions can damage the finishing and colour of the stones / crystals.\nSo don’t dip your stones / crystals in water.\nThe Product is make from natural stones so small holes, crack marks on the surface or inside the stones are often visible.",
		"totalReviewCount": "3 global ratings",
		"averageStarRating": "3.0/5",
		"reviews": [
			{
				"name": "Mohammed",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great",
				"review": "Awesome"
			}
		]
	},
	{
		"category": "Jewelry",
		"id": "0jTno8",
		"title": "YI Home Security Camera, 1080p 2.4G WiFi IP Indoor Surveillance Camera with Night Vision, Motion Detection, Phone App, Pet Cat Dog Cam Works with Alexa and Google Assistance",
		"imageUrl": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/518Ngm46uuL._AC_SY450_.jpg",
		"price": "$24.99",
		"description": "Building on the success of the #1 best-selling YI Home Indoor Security Camera, the YI Home Camera 1080p delivers high definition videos of your home, so you can view every moment in even clearer quality. Its Baby Crying Detection technology also acts as a state of the art baby monitor, sending an alert to your phone at the first cry of your baby. By connecting to YI Cloud you can be rest assured you'll never lose any footage, even if your camera is damaged or stolen.",
		"totalReviewCount": "35,467 global ratings",
		"averageStarRating": "4.3/5",
		"reviews": [
			{
				"name": "Grayson Gilman",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Good system//1.5 year update",
				"review": "Initial review and 1.5 year update.\n\nAfter one full week of usage, I'm ready to review the YI 1080P camera system. Take that description with a grain of salt, because you get more than just a simple camera at a price that's almost stupidly low. Over the next few paragraphs I'll go over the included hardware, features, setup and value and compare each of those aspects to other systems on the market. Start your engines.\n\nSo let's talk about the included hardware. Each camera comes in a small box similar to a new cell phone. They are so small that you will believe that they've forgotten something. Nope, inside that tiny box is everything for a single camera system. Open it up and you'll get the camera itself which is attached to its own base and, again, like a cell phone, a micro USB cord and outlet plug. This means that if anything ever happens to your power cord, you can get a spare very quickly. You'll also get some literature on setup and all that, which is pretty standard. There is no base unit like Arlo has. It's just a camera, similar to the Piper/Nest/most other systems. The quality of the hardware is also very decent. We all know the quality difference between Lego and Duplo, an iPad and a $60 tablet, a Yugo and a Honda. These cameras are decent quality. Maybe not at Nest standard, but good all the same. They are not Duplo or Yugo but won't break the bank like Nest will. That about sums it up for the hardware or included materials. As I stated earlier, the box the camera comes in is super small, so if you order two cameras like I did, you'll be underwhelmed at the size of the box they come in. Don't worry, good things come in small packages too.\n\nMoving on to features. These 1080P YI cameras come with a boatload of features. You can of course view them from your phone in and outside of your wifi network, so if you are at work and want to check in on your home, you can do that. They have two way audio so you can talk with someone or mess with your cats while you are away (not that I've ever done this...). Is it nighttime? No problem, these have very decent night vision capability, so they can see in pitch black darkness. Did something move over there? These sense motion and record it. Is something in the room always moving, like a fan but don't want that to set off the motion detection? You can select a specific area of the room to detect motion in, and not other areas, so if you have animals like cats or dogs that roam around during the day, set the selection area higher so it won't detect them. You can also set the motion sensitivity and alert frequency. Maybe your cat is chasing a reflection on a wall from an open window and you don't want to constantly get an update every few seconds. You can set the frequency lower and get fewer notifications. You can also take videos or pictures of what your camera sees at will. Of course all of this motion and recording can be set up to be stored on the YI servers or be saved to a micro SD card (not included, but you can get a 32 gb Samsung from  for $12) for further review. Have a set schedule? Maybe you don't want it to record motion at night, but you are gone for ten hours during the day. Set it up to record while you are gone. You can of course turn it off at will from your phone. There's also a crying baby setting. I don't have a baby, nor am I going to borrow one to test the feature, but it does exist. I'm guessing that it will listen specifically for that type of sound and send notifications specifically for it. You can also add a bunch of cameras to a single system and jump between those cameras at will. YI also makes a camera that can move and pivot 360 degrees. I have no idea if that camera would integrate into this system, but I bet it would. Most other good systems on the market have something along these features, so its par for the course here. The lack of a giant siren that the Arlo system has can be seen as a downside, but none of the other major systems have these either, so take that how you want.\n\nSo what about setting these things up? How hard is it? What's involved? Well, this can be accomplished in just a few really simple steps. The first thing you want to make sure of; that your phone you are using to set these up is on the same network as the cameras will be. I run two separate wifi networks, a 2.5 and a 5ghz. These cameras will currently only work on 2.5 ghz, so I had to jump over to the other network, no big deal. So first, download the YI Home app and start it up. Let the system guide you from here. It will show you everything you need to know, but it's pretty basic. Next you'll hit a small plus button to add a camera. Plug in your YI camera and wait. It will take about 30 seconds to turn itself on and it will begin talking. Click on the app that you've heard the camera speak and your phone will display a barcode. Simply show this barcode to the camera and it will log into the network. That simple. Then you simply set up the preferences I spoke about in the features area above. It's so simple that a child could do it.\n\nValue. Here it is. If you've read this far, you know what's coming. This system represents a value that cannot be ignored. I bought it figuring that if I didn't like it, I'd force Amazon to take it back. At $60 a camera, I figured I'd either get a great deal or return it to get something else. Luckily, I got a fantastic deal. For two cameras and two micro SD cards I'm well under the cost of a single Nest/Piper camera or the dual camera Arlo system. The features and hardware quality are a serious contender against nearly any other system on the market. Look, I know how it appears; cheap Chinese made cameras with an app system that can't be good, with features that probably don't really work. All of that is wrong except for the \"cheap\" part, and that doesn't apply to the camera build quality. This system WILL impress you. It is however a more basic system in terms of its compatability with other things you may have in your home already. I doubt that it will integrate with Alexa or any other system. It's its own thing, and that's not bad. The value is clearly there though and is easily seen once you directly compare this system to just about any other system on the market. There is no reason to take my word for it, so go and view a couple of youtube videos and watch for yourself. You can read any of my other reviews, and I think you'll find a common theme; value. I always look for the value in something, especially in lower priced options. Sure, the Nest cameras are nice. Yes, the Piper system is good. But at $60 a camera, are those systems worth $x more? No, not to me they aren't. I bought two cameras and the only thing I regret is not buying another one. Maybe I'll remedy that right now....\n\n1.5 year update!!!\n\nSo what's life been like with this camera system over the past year and a half? Well, the road is bumpy and there are some faults, but overall, for the price you pay, it's a decent system. Let's start with the good.\n\nThe software seems to receive updates every few months, so that shows that the developers continue to work on the system. The overall quality of the equipment is still good, no complaints here. I did try out their premium service by paying for a subscription, and it worked well, but I didn't continue it as I just didn't think it added any value.\n\nThe bad stuff. Well, interacting with the system while away from home is mixed. Occasionally I just can't access the cameras, and it isn't like I don't have good signal. The system is laggy and it can take quite a while to get a live image to show up on the phone. Sometimes you simply can't get one no matter how hard you try. I usually just wait a few minutes and try again.\n\nThere was a period of time a while back where no notifications would show up about movement detected. I'd randomly open the app and see a pile of movement notifications that the system never let me know about....that angered me a great deal. So I unplugged the cameras and logged out of the system to try to reboot the whole setup and it didn't work. It took a whole update from the company to finally get notifications back.\n\nAnd the last problem I have with this system, is that sometimes it will tell me that there was movement on one of the cameras and when I go to look at the video, it gives me an error that simply says the video isn't playable. This doesn't happen often, maybe around 5% of the time or so, but still, that shouldn't happen, ever.\n\nI deducted two stars from the review because of these failures. I'm still using the system and I do think it's worth the money you pay for it, but it's far from perfect. It's a great way to get into home security for low cost, but if you want something with more stability, look to higher priced options."
			},
			{
				"name": "DCifuentesJ",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Good Camera (UPDATED REVIEW)",
				"review": " 1st Edit (January 28, 2020) 3 Stars\nREAD INITIAL REVIEW FIRST!!!\n\nAfter 8 months of use, I decided to update my initial review, and change my rating from 5 to 3 Stars. Let me explain why:\n\n1. Kami from Yi: Yi decided to have a new line of products, focused on security (wireless and wired Cameras, a hub to avoid using Wifi for motion sensors and door sensors). It was such a strange and dumb decision, that actually two of Kami's cameras are physically identical to the New Yi Dome X (good camera BTW) and to the Outdoor camera. Only difference? That now it not only uses 2.4 Ghz, but also 5 Ghz Wifi. That's it! But now, instead of having to buy just new Yi products, to add to your system, you have to pay more money, and... USE ANOTHER APP!!! After some months, Yi made an update that made the Yi Home app, compatible with all Kami devices (including their hub and Zigbee? Z-Wave devices?).\n\nThis shouldn't have happened in the first place. Kami is just a new line of Yi Products that should have been a part of the Yi Ecosystem from the beginning.\n\n2. /Alexa compatibility: After an update, now you can use your Echo Show devices and you Firestick to see your cameras. Only problem? This doesn't work. To the point where this skill is rated 1 star. On my brand new Echo Show 8, the video feed freezes and gets stucked in Buffering (see attached photograph).\n\n3. No Google Home compatibility, IFTTT or SmartThings: Not everyone has an Amazon/Alexa ecosystem. Other companies have all this compatibility (Wyze for example).\n\n4. Home and Away mode: You can now change mode through the app. Only problem is that without IFTTT or SmartThings compatibility, in case you have an alarm system, you have to go into the app to set it manually and not automatically.\n\nIf Yi wants to keep up with competition, it need all this compatibilities or make a Camera door ring bell, Siren, smart lock with keypad, etc. Right now, this is not the case, so Yi is being left behind. I've read rumors (and even filled one of Yi's surveys through email about this, but until then, they need to make things happen).\n\n5. Desktop App with no upgrades: I understand almost everyone uses their phone. But watching 8 cameras, is impossible to do at the same time through your phone (you should be able to see 4!!!). Desktop app is the same as ever and has no updates. If you have a desktop app, please update it.\n\n6. Outdoor camera still can't change sensitivity: From my first review, you can read that the Outdoor camera is WAY too sensitive (there's even a video). Every night I had the Siren trigger because of bugs/insects. This makes this function useless. You should be able to set the trigger for this, for X amount of seconds of continuous movement, not only sensitivity. I had to turn this off completely. If it worked, it would be an AWESOME function, actually really useful.\n\n7. Baby Monitor: Through Kami, Yi had a crowdfunding campaign for this. I supported them, and will be updating when I get it (march, according to the Indiegogo campaign page)\n\n---------------------------------------------\n\n1st REVIEW (May 14, 2019) 5 Stars\n\nSo, I've waited quite a while to write this review. I didn't know where to do it, so I'll copy/paste it in all of Yi's Cameras I own (1080p, Outdoor, Dome, and 3), since I'll write this review as an individual review for each type of Camera, and as a whole camera system.\n\n1080p (4/5): At the moment of this writing, this is the best bang for the buck. You can get 4 of this for $118! or one for $29. The good thing about this is its simplicity and price. The fact that you can also mount this on the ceiling with screws makes it even better. One of the things you should take into consideration, is that even though this mentions its specs as a 112 degree FOV… it’s more of a real 90 degree.\n\nI mounted my cameras on corners of my home, so I was expecting to see both walls… which I didn’t or barely did. I discovered that there’s a setting called “Lens distortion correction”, that can make your FOV wider, sacrificing distortion (obviously), helps quite a bit, but 112, compared to other options (like the Yi 3) is on the lower side of specs.\n\nNight Vision is good. Quite contrasty, which I have to admit looks better to the eye, but won’t give you all the information something with a wider Dynamic Range can give you (like the Yi 3, again).\n\nThis comes with “Baby Crying Detection”, which I haven’t tried, but soon will, as I bought this one to work as a WiFi baby monitor placed on top of my son’s crib.\n\nAs all of the other Yi cameras, this has Motion Detection Alerts, which can also be switched On or Off with a Schedule, and you can change the frequency of the alerts.\n\nI bought the Cloud service for 5 cameras, Motion Based recording, which works OK… and also use 32 GB micro SD Cards, to store things locally. One of the downsides of ALL the Yi Cameras I own, is that for some reason I can’t record 24/7 on the micro SD card locally, and motion based on the cloud. That would make a lot more sense. Another downside, is that if you record 24/7, you can’t know where there’s movement in the recording, you have to scroll bit by bit, potentially missing things you might want/need to see. I guess most would want motion based recording, but take this into consideration if you buy the Cloud Service.\n\nOutdoor (3/5): Good camera, with good night vision (which for an Outdoor camera is a must). This also comes with an option to sound an Alarm if motion is detected (on a Schedule if you need, or always). This should sound for the whole time the motion is detected, not for only the 3 seconds it lasts. And the Alarm is not as loud as it should be. You should be able to change this to the amount of time the movement/motion happens (even though you only get 1 notification in the app).\n\nNight Vision is something that should be better in future firmware. It’s not that the night vision is bad, is that it triggers alerts when a bug flies in front and close to the camera. Even a bug flying for half a second at night, will trigger the Alarm and the notification. Even at the Lowest Sensitivity, it gives too many False Positives. Which is obviously a problem. (I’ll try to attach a video about a simple insect trigerring the alert and Alarm).\n\nThe camera, since it’s designed to work on outdoors, works as expected. Rain (lot’s of it), wind, sun, etc., and still going strong. Please take into consideration that this cameras has a short cable, so placing it far away from the electrical outlet will create a need for an extension or some other option.\n\nDome Camera (4.5/5): This is the one that has the most features. It can pan and tilt (go up/down or right/left). It can follow movement (called “Motion Tracking”) or it can scan from one spot to another (you choose the spots, called Bookmarks). The only reason I‘m taking 1 star off is that it has the same FOV as the 1080p and when you have it one spot, and motion is detected and it starts to follow movement… sometimes, when it tries to go back to its original position, it won’t. It’s not that big of a deal, but it’s something that annoys me, and it makes the biggest selling point of this camera, not so good (Motion Tracking), since you have to once in a while place the camera again where you want it to be focused normally.\n\nNight mode is similar to the 1080p Camera, which again, is quite contrasty.\n\nFor the amount of features, this would be the best Yi camera, but if you can place your camera in a corner of your house, paying for this model and not the 1080p (or even the 3), won’t make much sense.\n\n3 (5/5): This is the newest option from Yi. It has a much better night vision (a little on the flat side, but you get more information), MUCH better FOV. This also has, instead of the Baby Crying alert found on the 1080p, Abnormal Sound alerts, which you can set from 50dB (conversations), to 90dB (harmful/dangerous sounds), in 10dB steps. I have set mine at 60dB.\n\nOne of the best features on this model, is that you can not only set Schedules for alerts, but Schedules for the camera to be on/off. This is awesome for some privacy in our Master bedroom.\n\nAll these features, at the time I’m writing this, come with a $49 price per camera… which for my needs, was justified.\nThe Yi 3 is a modern camera, with better technical specs and probably technology that the other cameras I own. I really don’t know if a firmware update could bring the 3’s features could migrate to past models or if it’s something about processor/chip capacity.\n\nALL CAMERAS: Unfortunately these are not Smart Cameras, so there’s nothing to do with Alexa, Google Home or something like Samsung’s SmartThings here. Everything is handled via the App, which as far as I’ve seen, the interface is pretty much the same as every other camera. They have the GREAT advantage that you can have your information stored on a Cloud based system or in the SD card (which at least IMHO, it’s a great PLUS).\n\nYi Ecosystem: One of the things that Yi has overlooked, is that the Yi App/Software is designed to work with one camera, not as a system. So for someone like me, that has 9 cameras (1 Dome, 1 Outdoor, 2 1080p and 5 Yi 3’s), it becomes a little bit of a problem. For example, I don’t have the chance to turn ON all camera’s setting an Away mode, or remove notifications in a Home mode… or any type of combination. If I need to turn on all cameras, I have to enter into the settings of each camera, one by one. This doesn’t make much sense. You can’t see two or several cameras at the same time… you can only see one.\n\nNOTE: Yi Home Camera 2 and Yi Cloud Cameras, are the models I didn’t need so I don’t have any opinion or anything to mention about them. At the moment of this writing, version 2 is not available anywhere."
			},
			{
				"name": "Customer_RC99",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Motion detected recordings continue until motion stops. Very clear day-time videos",
				"review": "Like:\n(1) motion detected recordings continue as one clip until motion stops;\n(2) not a requirememt to use cloud. This way no ongoing fees;\n(3) considering the quality of the recordings and the ease of use of the App, very reasonable price for the cam;\n(4) two-way audio 5/5;\n(5) App rated 5/5; playback is very easy to use (note: Wyze cam is very difficult to playback);\n(6) the Cam's IR light can be turned on or off by the user (instead of it being automatic). This is useful if the cam is pointing outside from inside behind a window (if ir is off, there is no reflection of ir and this results in the night-time recordings to be useful when there is (even low or dim) ambient lighting outside.\n(7) notifications since March 15/19 have been timely (and still are as of Sept 15/19);\n(8) When set to record only motion triggered events, motion not in the activity zone is recorded but no notification is sent; I love this feature! I can review all motion triggered recording in the cam's range but I don't get bothered by a notification of events not in the activity zone.\n\nUpdate, Sept 15/19 -- I now have 7 of the same cam because the identical cams (cams 1 to 4) performed so well (expectations exceeded). Highly recommended cam!\n\nDislike:\n(1) if Yi's servers are \"down\" (it happened for hours in late January, 2019) the cam will be inaccessible and includes not being able to view \"live stream\" nor previously recorded events that were not previously downloaded to your smartphone or tablet. Because of this, I have other cams (different manufacturers) which store events to micro SD cards instead of uploaded to the cloud; edit Sept 15/19 -- Yi's servers have not been \"down\" since January, 2019.\n(2) event-triggered recordings are stored on the micro SD card that is in the cam for about 7 days as older recordings are deleted to make room for new recordings. That means you have to download (within 7 days) any event you want to keep;\n\nI am not in any manner connected with the vendor nor the manufacturer."
			},
			{
				"name": "Hayls",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Much better than the monitor we have but if you're using as a monitor some things to think of.",
				"review": "This camera kicks our baby monitors butt. It's light weight , convenient, well priced and the picture is very clear. The set up could have been executed by a monkey and the app is very user friendly. Our only complaint is the motion alert goes off all the time even if the baby is not moving and you can't hear the app if you are using your device for anything else I wish the app would run in the background. We fixed this problem by using our old tablet we no longer use as the monitor screen. This works very well but not everyone has an old tablet laying around. If you have a small house and you're just using this to take a little peek then once in a while and don't need the sound option then probably not an issue.\n\nUpdate: you can now put the screen for the camera over other apps and watch it while you do other things on your phone."
			},
			{
				"name": "Zippy Zed",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Love these! Everything I hoped for",
				"review": "Love these! Everything I hoped for! Clear picture! Even have one facing out my window and I have no reflection or glare on the picture!\nSuper easy to set up and the Ap is easy too! Definately recommend them."
			},
			{
				"name": "Pierre J Gelinas",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Awesome Camera, Awesome Picture Quality. No Regrets.",
				"review": "A very nice little camera that comes with very clear picture resolution. Has automatic WIFI search and installation, which is like Plug n Play in the computer world! Because this was my first time with these devices there was a bit of a learning curve. But once installed and running this camera worked well. I had to learn the commands of course, like turning the camera on and off, recording, turning the sound on and off, etc... the usual stuff. It does have a \"multiple\" room feature, whereby you can place a number of cameras in different rooms and your cell phone display will show the multiple rooms at once. Now i need to buy more phones!! LOL. My main issue is the \"manual\": is so small that you need a magnifying glass to look at the pictures of the displayed controls on an example phone! Overall, though, I really like this little camera."
			},
			{
				"name": "Shael",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " The perfect baby-cam - unless wifi is scarce you'd be crazy to go with a radio-style monitor.",
				"review": "Perfect baby-cam - We have city-wide wifi so this gives me the confidence to go out within short distances as it works flawlessly and I hear every little grunt the baby makes. I usually just take a portable battery so I can leave the screen on indefinitely. Alerts work well but are not needed in my opinion. App is flawless, took a few tries to connect but since then it's never thought twice about giving me the video-feed right away.\n\nONE WISH-LIST FEATURE - ability to listen with headphones while the screen is off in case you want to save battery or you can't have your phone out - then it would be PERFECT!"
			}
		]
	},
	{
		"category": "Jewelry",
		"id": "uaBN3S",
		"title": "Kendra Scott Elisa Pendant Necklace for Women, Fashion Jewelry, 14k Gold-Plated",
		"imageUrl": "https://m.media-amazon.com/images/I/61GyGI81dUL._AC_UY500_.jpg",
		"price": "$70.00",
		"description": "Product Details\nMaterial\nBrass, Non-Precious Metal\nAbout this Item\nDelicate and Dainty: If you love to layer or gravitate towards simpler styles, this piece is perfect for you. You won’t get tired of the Elisa Adjustable Length Pendant Necklace, because it was made with everyday wear in mind.\nColorful: We’ve never shied away from incorporating color at Kendra Scott, and with the Elisa Adjustable Length Pendant Necklace in your jewelry box, the perfect pop of color is never far away.\nDetails: This necklace measures 0.63 L x 0.38 W stationary pendant, 15 chain with 2 extender.\nGift Box & Jewelry Bag: Your Kendra Scott Jewelry will arrive pre-packaged in a genuine branded gift box and jewelry bag. This necklace makes a perfect gift for Valentine’s Day, Christmas, your wedding anniversary, Mother’s Day and birthdays.\nHow to Care for Your Kendra Scott Jewelry: To protect the plating, remove your jewelry prior to hand washing, swimming, exercising, cleaning, and before applying any kind personal body products. Maintain your jewelry’s high shine by avoiding contact with soap, perfume, lotion, makeup, hair & cleaning products.\nDescription\n\nAdd a splash of color to your look with this gorgeous necklace!\n14K gold plated over brass necklace with stationary pendant.\nLobster-claw closure.\nDue to the one-of-a-kind nature of the medium, exact color patterns may vary slightly from the image shown.\nImported.\nMeasurements:\nChain Circumference: 15 in\nAdjuster Length: 2 in\nPendant Height: 3⁄8 in\nPendant Width: 3⁄4 in\nWeight: 0.1 oz\n\nSee more\nAbout this Item",
		"totalReviewCount": "9,194 global ratings",
		"averageStarRating": "4.7/5",
		"reviews": [
			{
				"name": "Love those country roads",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Attractive",
				"review": "This is a gift for a granddaughter. It is quite delicate and the stone is very pretty. The box in which it comes is attractive as well. I wish it had been anchored in the box. It is attached to a holder that is much smaller than the box which allows the necklace to bounce around in the box. I found a piece of packing from a necklace box of mine and used it in the box to hold the necklace in place. At this price point I think a nice presentation in the box isn’t too much to expect."
			},
			{
				"name": "Dawn",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Granddaughter loves",
				"review": "This was a gift for my tween granddaughter who lives in another state so my review is based on pictures of her wearing it. It appears a bit delicate so probably best not worn if playing sports or doing other vigorous activities. Looks lovely on her and she loves it."
			},
			{
				"name": "Jake",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great quality!",
				"review": "We ordered the rose gold druzzy necklace. We received the silver version instead. But they were listed at the same price and my daughter loves it regardless.. ill definitely be ordering one for myself."
			},
			{
				"name": "Patti Stefan",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " My daughter loves it!",
				"review": "I bought this for my 13 year old and she loves it! It’s a durable piece that she can wear every day!"
			},
			{
				"name": "Ena Pira",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Nice!",
				"review": "Very nice! Good quality, I was looking forward to getting this on Christmas. It was very nice and it had good packaging"
			},
			{
				"name": "Jennifer Hollister",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful and trendy",
				"review": "This necklace is beautiful and trendy with a lovely design, and is the perfect length. The detail is unique. The value is good for the money because it is trendy, but not made of fine materials"
			},
			{
				"name": "Aspen",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " THESE ARE WORTH THE MONEY 100%",
				"review": "This Kendra Scott necklace comes in such a cute box! The necklace is so adorable. I bought this with an  giftcard and it was so worth it!!"
			},
			{
				"name": "Lauren L.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " LOVE THIS",
				"review": "Love this. I wear it so much and it hasn't tarnished. I've slept swam and showered in it. GREAT"
			},
			{
				"name": "Luna",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Not a good product!",
				"review": "Keep flipping on the neck."
			},
			{
				"name": "Rose nord",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " pretty",
				"review": "pretty"
			},
			{
				"name": "Courtney",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Five Stars",
				"review": "Beautiful necklace!!"
			}
		]
	},
	{
		"category": "Jewelry",
		"id": "7FpqBs",
		"title": "Swarovski Angelic Crystal Jewelry Collection, Rhodium Tone Finish, Blue Crystal, Pink Crystal, Clear Crystal",
		"imageUrl": "https://m.media-amazon.com/images/I/71A3rcmZ3hL._AC_UY395_.jpg",
		"price": "$55.30",
		"description": "Product Details\nMaterial\nRhodium plated\nCountry of Origin\nChina\nAbout this Item\nStunning and elegant: The angelic stud pierced earrings combine the precision and quality of sparkling Swarovski crystals with a rhodium plated setting, for a trendy and refined accessory\nVividly sparkling: Clear crystals take center stage, complete with matching pavé set on a rhodium plated metal post with a butterfly back for a secure fit, for easy-to-wear, lightweight earrings\nDesigned to last: Swarovski jewelry will maintain its brilliance over time when simple care practices are observed; remove before contact with water, lotions or perfumes to extend your jewelry's life\nElegant and eye-catching: The simple versatility of these studs makes them a fashionable everyday accessory, a glamorous addition for more formal occasions or a charming gift for your loved one\nItems delivered: 1 x set of Swarovski angelic stud earrings with clear Swarovski crystals with rhodium plated metal post and butterfly back, complete with Swarovski earring box\nSee more\nAbout this Item",
		"totalReviewCount": "5,109 global ratings",
		"averageStarRating": "4.7/5",
		"reviews": [
			{
				"name": "Simon",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful product",
				"review": "My wife love this necklace. The 14.75\" length fits her neck real well. The stone sizes are no too small and very eye catching. The small 0.75\" extension (removable, come as part of the necklace) is nice. Swarovski products has good quality."
			},
			{
				"name": "NYPaul",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Sparkle",
				"review": "These earrings are well made. They have great backings to secure them. Best of all, they sparkle in the light like a disco ball. I love them."
			},
			{
				"name": "Andrea Silber",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Stunning earrings",
				"review": "These are so gorgeous and perfect for every day."
			},
			{
				"name": "Rickdot C",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great gift. They complete my wife’s set",
				"review": "Great gift. They complete my wife’s set"
			},
			{
				"name": "Sherry Maghsoodloo",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful earrings",
				"review": "The size is larger than I thought it would be and I love it because I don’t have to return it!!"
			},
			{
				"name": "Janis",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " The earrings are beautiful!",
				"review": "They were just as they were pictured and were a Christmas gift and the receiver was thrilled."
			},
			{
				"name": "lrhodes47",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great for a gift",
				"review": "This was a gift for my daughter and she loves them. They’re beautiful"
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Awesome",
				"review": "Wife loved it. Size was perfect too."
			},
			{
				"name": "Samuel toni",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " falsissima",
				"review": "è un falso\nsono andato in un centro Swarovski\ne la collanna è fatta bene ma è un falsissimo\ntra l'altro arriva in cinfezioni e autocertificazioni Swarovski\n(questo per la merce che arriva da hong kong)\nda denunciare!!"
			},
			{
				"name": "Jo",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Super sparkly",
				"review": "These earrings are so pretty and sparkly. The pin that goes through the ear is quite short and bent at a funny angle, so it can be a bit of a faff to get these on for the first time but definitely worth it!"
			},
			{
				"name": "James S",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "2/5",
				"reviewTitle": " Oversized and overpriced",
				"review": "Overly large, these earrings look unwieldy on small ears, especially if you don't have large lobes. They don't come in a gift bag or wrap as previous reviews have mentioned but a small gift box with a large sticker on them which leaves adhesive residue. Nice enough but not worth £50"
			},
			{
				"name": "pewzie",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Not green with envy, but certainly a green wrist.",
				"review": "Really disappointed in this item. Was not cheap but rather than make others green with envy, all it did was proceed to make my wife’s wrist green. Not a brand of jewellery I would ever buy again."
			},
			{
				"name": "susan watts",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Smaller than expected",
				"review": "This bracelet would make a nice gift , however if you bought it to match the necklace and earrings as I did you might be a little disappointed. The bracelet design used to be the same size as the necklace, it is now made quite a bit smaller. As this was indicated as being made 2019 , I assumed it was the older model, it’s not, so in my opinion doesn’t look as good as it should. A bit pricey for what it is ."
			}
		]
	},
	{
		"category": "Jewelry",
		"id": "93hGX2",
		"title": "Sayotoo Horiizzon Forbiden West Slitherfang Building Toy Set; Collectible Gift for Kids, Adult, Gaming Fans; Model of The Iconic Machine with Snake, MOC Collectables Compatible with Lego (1431 Pieces)",
		"imageUrl": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/51TmkbyPXrL._AC_SX425_.jpg",
		"price": "$86.99",
		"description": "Special Instructions: No paper instructions, scan the QR code on the postcard in the package to get the electronic installation instructions,contains detailed installation steps.Please contact the seller in time if you cannot obtain PDF manual or miss parts.\n\nMaterial: Plastic\nMaterial classification: ABS\nWeight: 0.93 kg\nBrick Quantity: 1431 PCS\nSize: 20.79\" (52.8cm) long, 11.3\" (28.7cm) wide and 17.4\" (44.2cm) high\nApplicable age: 12 years old +\nApplicable people: Kids, Adults and Teens\n\nProduct Service:\n1.Scan the QR code on the package to get the electronic installation instructions. No paper manuals are provided, please understand!\n2.All parts are quality checked before shipment, so if you find some missing or damaged parts, please don't worry. Please contact us and we will send it to you immediately for free.\n3.If you have any product problems, you can contact us at any time. Sayotoo will serve you wholeheartedly.",
		"totalReviewCount": "2 global ratings",
		"averageStarRating": "3.0/5",
		"reviews": [
			{
				"name": "John Mus",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Rainbow friends figure",
				"review": "You made my boy very happy. Thank you"
			},
			{
				"name": "Mauriciovillegas",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Poor quality materials some parts do not match the instructions and it didn't stay together",
				"review": "I couldn't build it and I'm obsessed with legos. I didn't want to give any stars but I had to"
			}
		]
	},
	{
		"category": "Jewelry",
		"id": "vZW584",
		"title": "Swarovski Stone Crystal Earrings and Necklace Jewelry Collection",
		"imageUrl": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/71hwh2ljWnL._AC_UY395_.jpg",
		"price": "$145.00",
		"description": "Product Details\nMaterial\nMetal,Crystal\nCountry of Origin\nThailand\nAbout this Item\nSimple and timeless: These rhodium plated hoops combine the precision and quality of real sparkling Swarovski crystals with a classically beautiful design that makes them a stunning accessory\nSubtle and elegant: The design of this pair of Stone hoops features the Swarovski pavé sparkle, crafted in rhodium plated metal for a touch of luxurious fashion\nDesigned to last: Swarovski jewelry will maintain its brilliance over time when simple care practices are observed; remove before contact with water, lotions or perfumes to extend your jewelry's life\nA complementary piece: These hoops transition seamlessly from day to night and make a great addition to your own collection or a great gift for someone special, be it your mother, sister or daughter\nItems delivered: 1 x pair of Swarovski Stone hoops for women, 1 3/8 inch rhodium plated hoop earrings, with sparkling white crystal pavé, with Swarovski earring box\nSee more\nAbout this Item",
		"totalReviewCount": "2,094 global ratings",
		"averageStarRating": "4.6/5",
		"reviews": [
			{
				"name": "Nicole",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Amazing Purchase",
				"review": "Bought for a Christmas present and they loved it. Good packaging."
			},
			{
				"name": "Mike forde",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " beautiful",
				"review": "I love swarovski earings they shine and are well made"
			},
			{
				"name": "Deborah Mercer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Received on time",
				"review": "It’s a gift….hopefully the recipient will like it"
			},
			{
				"name": "Carol",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " My Favorite Earrings",
				"review": "I previously had these earrings and wore them all the time. On a recent vacation I lost one of them so I decided to replace them. They are great casual wear, and they also look dressy for dressy occasions."
			},
			{
				"name": "Kristie",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Beautiful but...",
				"review": "These hoops are absolutely gorgeous and I would expect nothing less from swarovski. However, they are much smaller than what the photo would suggest they should be. I will still be wearing them as they do sparkle really nice but if you're expecting a large hoop these are not for you."
			},
			{
				"name": "Elena",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Trendy and beautiful earrings!",
				"review": "fashionable and beautiful earrings. I like it.\nBut the price of $100 is high, unfortunately.."
			},
			{
				"name": "Denise Benjamin",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " They need to be bigger",
				"review": "I loved them they’re just too small"
			},
			{
				"name": "deepintheriver",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " These really pop.",
				"review": "It changed the atmosphere. Nice pop"
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " very nice",
				"review": "update... clasp isn't so good one came undone and earing dropped out on second time wearing them.\nthese earrings look great. arrived quickly\nonly niggle is that there was a very big white barcode label stuck right on the side and bottom of the nice box which isn't a great look if its a present and its difficult to get off without ruining the box"
			},
			{
				"name": "Star Ross",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "2/5",
				"reviewTitle": " Sorry I couldn't give these a better rating",
				"review": "The earrings shown in the pictures and even one review I saw was a lot bigger.\nThey are very thin and small, very beautiful shine sparkle but very deceiving I was very disappointed when i opened them to see how small they were and the price I paid about the size of a 10 pence piece,that aside they do sparkle very nicely just not as big as I'd hoped 👎"
			},
			{
				"name": "louise burford",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " They do come undone.",
				"review": "Look stunning and a very comfortable to wear.\n\nThe only problem I have with them is they do come undone and I lost them twice in one evening.\n\nThank goodness I found them but would not wear them again to a party With loads of people and lots of movement."
			},
			{
				"name": "Marianna",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful Earrings",
				"review": "The earrings are beautiful and not too big or too small. The stones sparkle and the earrings are first class quality. Just what you would expect from Swarovski. I recommend them."
			},
			{
				"name": "Lils17",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Lovely necklace",
				"review": "Very pretty Swarovski necklace and at a competitive price too in the Black Friday sale. Really liked that it is bicolour and therefore can be worn with other silver or gold jewellery. Very pleased with my purchase."
			}
		]
	},
	{
		"category": "Jewelry",
		"id": "Bwh9KP",
		"title": "10K White Gold Inside and Outside Diamond Oval Hoop Earrings (1/4 cttw, I-J Color, I2 Clarity)",
		"imageUrl": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/71Or1aMSEAL._AC_UX385_.jpg",
		"price": "$149.99",
		"description": "About this Item\n1/4 cttw Round Full Cut Diamonds (I2 Clarity, I-J Color)\nNatural Conflict Free Diamonds\n10K White Gold Earrings Crafted with Sustainable Processes\nFree Gift Box\nREADY FOR GIFTING: Ideal gift for your wife, girlfriend, mother, mother in law, son ,grandma, best friend, girls, anniversary, wedding, engagement, thanksgiving, Christmas and Graduation. Comes with a Free Attractive Gift Box.",
		"totalReviewCount": "1 global rating",
		"averageStarRating": "5.0/5",
		"reviews": []
	},
	{
		"category": "Jewelry",
		"id": "hoNSmP",
		"title": "Brinker & Eliza Women's Magnolia Earrings",
		"imageUrl": "https://m.media-amazon.com/images/I/51J+Y8owX5L._AC_UY625_.jpg",
		"price": "$148.00",
		"description": "Product Details\nMaterial\nMetal\nCountry of Origin\nUSA\nAbout this Item\nDyed mother-of-pearl floral charms, Freshwater cultured pearls, Titanium hypoallergenic post closures\nLength: 2.25in / 6cm\nDescription\n\nMagnolia Earrings",
		"totalReviewCount": "0",
		"averageStarRating": "No ratings",
		"reviews": []
	},
	{
		"category": "Jewelry",
		"id": "7xs6ja",
		"title": "14K Gold Filled Small Hoop Earrings for Cartilage Nose, Tiny Thin 7mm Piercing Hoop Ring 22 Gauge",
		"imageUrl": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/61jARa0zTJL._SY500_.jpg",
		"price": "$14.69",
		"description": "[ HANDMADE GOLD EARRINGS for WOMEN ] : Small gold hoop earrings for women teen girls men, made of 14k gold filled wire(the top layer gold is 100 times thicker than gold plated earrings), which is hypoallergenic, perfect earrings for sensitive ears, this gold huggie earrings are thin and lightweight, you can wear everyday and night without worry drag your earlobes like other chunky gold hoop earrings.\n[ MULTIPURPOSE SMALL HOOP EARRINGS for WOMEN ] Dainty & cute tiny huggie hoop earings could be cartilage earring, nose rings hoops, septum rings, nose piercing jewelry, tragus piercing jewelry, helix piercing jewelry, lip rings, second third… multiple piercing small earrings, mix& match your gold earinging set now. Please follow the listing instruction to choose the right size for you.\n[ TRENDY GOLD JEWELRY for WOMEN ] Huggie earrings have been trendy earrings for years, especially these flatback thin gold hoop earrings make you a clean and minimalism looking, you can wear these flat back earrings in any occasion, like business, school, office, work, appointment, party….\n[ PERFECT HANDMADE JEWELRY for WOMEN ] Give these handmade earrings to you or your loved ones on her birthday or Charismas Thanksgiving Mother’s Day Valentine’s Day, these cute womens earrings will be so loved as a perfect everyday earrings\n[ HIGHT QUALITY MATERALS & RELIABLE USA SELLER ] : All the materials are sourced from USA authorized retailer, and proudly handmade in the USA. All the handmade earrings or nose rings ‘ hoop ends are well polished by hand, so they are not sharp and will not scratch your skin. We have been working in handmade jewelry for years, and focus on create the most comfortable and classic jewelry to meet every individual’s need, please buy with confidence!",
		"totalReviewCount": "4,892 global ratings",
		"averageStarRating": "4.0/5",
		"reviews": [
			{
				"name": "c taylor",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Darling, but hard for older fingers and eyesight!",
				"review": "I love the look of these earrings for my second earring hole. My downside is that I am only 50 and feel young but I had a hard time getting these in my ears because they were so small and it was hard for me to see and be coordinated enough to put them in and close them completely back up. I still have a bit of separation in the back because I couldn't see to put them together fully. You have to rock the earring back and forth a bit to open and then close, rather than pulling it apart. After the struggle of putting them in, they look and feel great. Super simple and minimal, which is what I was going for. I have slept in them for a month now and don't notice them. very comfortable and good coloring. Not overly yellow and artificial looking."
			},
			{
				"name": "Audrey",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Not for ears",
				"review": "These do not lock and will fall out of your ears immediately."
			},
			{
				"name": "Darrel",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Worth it.",
				"review": "I’ve never worn earrings without a post/back, but these weren’t terribly hard to get on. Follow the directions. Earrings are nice thus far, can’t tell they’re even there. Very subtle look."
			},
			{
				"name": "Zawadi",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Just as described, awesome!",
				"review": "This item is exactly as described by the seller,very light and comfortable to wear and it's worth every coin! I have had them on for two days and so far no irritation or scratching on my skin and that's\na plus for someone with sensitive skin like me. The only problem I had was getting them back to shape after twisting. I would definitely buy again!"
			},
			{
				"name": "Caitlyn F",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful, dainty earrings!",
				"review": "I bought these in September for my 2nd and 3rd piercings in my ear (lobe). Regular earrings with the butterfly backs bother me when I sleep, so I have to take them out every day. I put these in right when I got them, and I haven't taken them out since (it's now December). I haven't had any issues with sensitivity, however my piercings were fully healed. The earrings also haven't tarnished or changed in appearance in any way. The only issue I have found is the point in which the hoop is separated can sometimes get a green tint, but it is only that one tiny area and it is easy to wipe away. For reference, I bought the 7mm Piercing Hoop Ring 22 Gauge in gold. I definitely recommend!!"
			},
			{
				"name": "shanking33",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Great quality, but misleading photo",
				"review": "I thought they would have 4 earrings because of the picture, so now I have to buy 2 more and that's kinda annoying."
			},
			{
				"name": "Megan S.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Good buy!",
				"review": "I've been looking for a replacement septum ring for a while. So glad I found this product! Easy to put in and comfy! The only downside is its hard to close tight without mishaping the hoop. I def recommend this though. Huge value and saved me a trip to the piercing studio."
			},
			{
				"name": "Larissa",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Cute!",
				"review": "They exactly what i asked for. cute and little. at first my hair was getting caught in them because i didnt close them all the way. I love them!"
			}
		]
	},
	{
		"category": "Jewelry",
		"id": "szJifV",
		"title": "Osmo - Coding Starter Kit for iPad-3 Educational Learning Games-Ages 5-10+ -Learn to Code,Coding Basics & Coding Puzzles-STEM Toy Gifts - Logic,Coding Fundamentals,Boy & Girl(Osmo iPad Base Included)",
		"imageUrl": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/81qwli12bXL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
		"price": "$72.40",
		"description": "Coding is a modern superpower with the Coding Awbie, Coding Jam and Coding Duo from Osmo. Uses hands-on physical blocks to control Awbie, a playful character who loves delicious strawberries. Each block is a coding command that directs Awbie on a fun-filled adventure enabling coding & problem solving (Coding Awbie - basic coding concepts), a great introduction to the coding community. Use coding blocks to learn coding's creative side while developing an ear for rhythm, melody, and harmony. Make your beat come alive, while learning patterns & loops with over 300+ musical sounds (Coding Jam - intermediate coding concepts). Once a Jam has been composed children can safely share it with family, friends & the jam community. Solve advanced side-by-side coding puzzles solo or with others, playing at their own level, using teamwork & strategy to unlock new worlds & coding 60+ puzzles (Coding Duo - advanced coding puzzles). Osmo games bring a child's creative imagination to life with hand held pieces that interact with an iPad and/or Fire Tablet and an Osmo Base (No WiFi necessary for game play). Coding Starter Kit for iPad requires an Osmo Base to play and this kit ships with an Osmo Base for iPad. Approved by parents and teachers worldwide, used in over 31,000 classrooms.",
		"totalReviewCount": "3,469 global ratings",
		"averageStarRating": "4.7/5",
		"reviews": [
			{
				"name": "Heather Huff",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Love it!",
				"review": "My 8 year old STEM lover bought this for herself and loves it! My 5 year old hasn’t tried it yet, but seems simple enough to understand. It’s a big hit in our house. Highly recommend!"
			},
			{
				"name": "Kayla Western",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great!",
				"review": "This is a Christmas Gift for my Son. The package came on time and looked as expected! There was no damage to the box. I wish that they had some of these without the whole starter kit, because we now have 3 of the stands and we don't need that many, but still great!"
			},
			{
				"name": "Julie geistert",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Still can’t use it",
				"review": "I bought this for my daughter for Christmas and it was quite expensive but I figured I’d go for it because it seemed highly likable and like a genius idea for her to learn coding by the time we got into it after Christmas and went to use it I knew I had paid about $80 for it and I had ordered the special iPad addition or should I say starter set I pay the extra money to ensure that there is no issues and then once we download the programming she was unable to use it because it claimed that we needed to then order An actual compatible scanner which I ordered the more expensive starter set because it specifically said it was designed for an iPad that she already had and now I’m being asked to spend more money and she still hasn’t been able to use it it’s very discouraging that automatically I wasn’t sent the proper scanner after writing an email and reaching out tôt the company. I was really looking forward to having a company that I could trust for her to learn front in an efficient and easy way but because of how expensive this is and how inconvenient it is that now I just have an $80 piece of useless equipment without that scanner and still can’t get in touch with anybody without just spending more money that I don’t have I am quite sure this will be the last purchase that I make from them and now I have to try and figure out how to send it back. Oy vay. Good concept , unfair tricks ."
			},
			{
				"name": "Sarah Marie Riley",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great game for 6 year old nephew.",
				"review": "Gave this as a gift to my nephew for Christmas. We had some issues getting it to work but once I looked at it we figured it out. The game is fun for my 6 year old nephew. The concept is just like Scratch."
			},
			{
				"name": "Genia",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Quality",
				"review": "My Grandson has loved this coding game."
			},
			{
				"name": "Cathy Spatks",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great for the Coder!",
				"review": "It works very well with the iPad!"
			},
			{
				"name": "A mom who has been there",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Perfect gift for my grandson",
				"review": "So my grandson (5) has had this for about 6 weeks and he still loves it. He is up to level 6. This is a great way to teach young children skills that they will need in this ever changing world. It was so self explanatory that at age 5 he was able to figure out how to start using it."
			},
			{
				"name": "Laura Liebman",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " great introduction to coding I didn't think possible at such a young age",
				"review": "I got this for a 5 year old that is highly interested in tinkering/building big Lego sets, and generally quite interested in science. He does have a good attention span for a 5 year old, which I think always helps with this sort of toy. Now, as for the toy, as usual with Osmo the toy pieces intended for the kid to manipulate are very high quality, so the only issue is keeping one from getting lost. As for the games...I was an engineering major in college, and had no intro to coding before I \"had\" to take the course and learn it. I actually think it's a great idea to expose kids who are into science early, and there aren't too many ways to do it. The kid I bought this for had just had his STEM coding summer camp cancelled due to COVID. I really appreciate the goal of this product."
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Very interactive and fun",
				"review": "My 7 yo daughter is thoroughly enjoying the Osmo coding package with her ipad"
			},
			{
				"name": "Certified Reviews",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great for a little smart kids",
				"review": "Generally the world that we live in a lot of career paths involve programming in this new technology phone focussed world\nThis is a way to fast track programming for kids that they could grow up and develop mobile or desktop applications\nIt teaches simple logic branching and loops\nAs a programmer myself I do support and recommend this type of a tool\nGreat for kids that are learning and want to build their own games and apps\nHighly recommended"
			},
			{
				"name": "valerie goodfellow",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great educational kids gift!",
				"review": "The coding games are so much fun in this bundle. My kids love it and I'm even learning coding along with them as this is something they are doing in school now too. Osmo may be the best value gift I've ever bought my kids."
			},
			{
				"name": "Eddie",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great gift for my kids.",
				"review": "My kids love this game, I love how it progressively get's harder the more they play it. My kids enjoy the puzzles, it's alot of fun for everyone"
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " must have",
				"review": "must have in this time. good to build basic skills"
			}
		]
	},
	{
		"category": "Jewelry",
		"id": "foTCyc",
		"title": " Collection Sterling Silver Heart with Hand Engraved Butterfly Locket Necklace, 18\"",
		"imageUrl": "https://m.media-amazon.com/images/I/71+Cp2N1SxL._AC_UY695_.jpg",
		"price": "$43.22",
		"description": "Sterling Silver Heart with Hand Engraved Butterfly Locket Necklace, 18\"",
		"totalReviewCount": "782 global ratings",
		"averageStarRating": "4.5/5",
		"reviews": [
			{
				"name": "Charles LeGros",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " My daughter just loved it!",
				"review": "I used it to just tell my beautiful daughter how much I love her."
			},
			{
				"name": "Nancy Cotnam",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Pretty",
				"review": "Lockett was pretty and a good value. It didn't close easily and the picture has to be glued"
			},
			{
				"name": "Elisa Gonzalez-Smith",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Locket broken!! It does not latch!",
				"review": "This locket was beautiful, but it has the critical flaw of not latching. This is so frustrating because I really wanted to wear this with my dog’s photo inside, but I feel like the locket’s utility disappears when you don’t get to open and shut it to reveal the special someones inside. Plus it is missing the satisfying snap that comes with closing the locket.\n\nAgain, I’m pretty disappointed and am trying to find a way to fix the latch—I just wish that it hadn’t been broken when I received it."
			},
			{
				"name": "Charlotte walker",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great",
				"review": "I love the necklace. It will be a great picture for a young lady."
			},
			{
				"name": "James",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Very pretty butterfly locket",
				"review": "I got this for my wife because the locket she had for 16 years finally broke. This one is a little smaller than her old locket. She went to the website locketstudio.com and there she was able to upload and print the pictures for free in the correct size. The picture size this locket fit was 19 mm heart shape. It was really easy to do. She used a paperclip tip to remove the plastic photo protectors. Pop the pictures in and close it up. It looks nice, and yes it's small but it looks just fine. The chain is not so great and that's why it only got 4 stars. She used the chain from her old locket. I hope is last as long or longer than her last locket."
			},
			{
				"name": "Andrea N.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful detail for the price",
				"review": "Love that it's a locket and the detail on the front is wonderful. The price was nice as well."
			},
			{
				"name": "Liz",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Highly recommend for a gift or yourself!",
				"review": "The heart locket itself is so beautiful! It gives an elegant feel to it. The design is beautiful on it and I love it. Only thing was the chain was so thin and it broke after a week. I had to buy a different one off  to be able to wear it again. And I don’t think the length was true to it size. I’d give it a lower star but the pendant itself is amazing. I recommend buying a different chain that’s a bit more sturdy and can withstand daily life."
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Very pretty made great gift",
				"review": "It made a perfect graduation gift. Very delicate & pretty, well worth the $. She loved it."
			}
		]
	},
	{
		"category": "Jewelry",
		"id": "f3fhnS",
		"title": " Collection Men's Sterling Silver Crucifix Pendant Necklace with Stainless Steel Chain, 24\"",
		"imageUrl": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/7127o9StoPL._AC_UY695_.jpg",
		"price": "$44.10",
		"description": "Necklace featuring sterling silver crucifix cross pendant and rhodium plated stainless steel chain for every day wear\n\nClassic in design, the Men's Sterling Silver Solid Tubular Crucifix Cross Pendant is the perfect accessory for any style. Resting on a 24\" stainless steel curb chain is the classic crucifix depiction in silver. The cross creates a total pendant size of 1.75\" by .9\". This small size makes the pendant appropriate for all occasions.",
		"totalReviewCount": "1,302 global ratings",
		"averageStarRating": "4.6/5",
		"reviews": [
			{
				"name": "LPF",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " The crucifix alone is worth the price.",
				"review": "The crucifix is detailed and high quality. The chain is stainless steel and rhodium plated stainless steel, making it look like white gold."
			},
			{
				"name": "Joy",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful Sterling Crucifix",
				"review": "Bought this as a gift for my husband who loved it. Beautiful Sterling Silver Crucifix with a sturdy stainless steel chain."
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " The only reason I didn't give this 5 stars",
				"review": "I've owned this pendant + necklace for over a month now. I wore it 24/7 (with the exception of showering and working out) for the first 3 weeks. I think the length of the necklace is perfect for me at 24\". It's long enough for me to fit it over my head without having to undo the clasp but also short enough that if I was upside down it wouldn't just fall off. I also like the style of link they used for the necklace. I find it to be visually appealing but not \"flashy\" looking. A very simple and casual design that doesn't take away from the main piece...the pendent.\nI really like the size they used for the pendent. Once again, it's not big and \"gotti\" looking like a neck piece that you see on a rapper. It's very casual and IMO something I prefer to wear under my clothing and not as a fashion accessory. It has nice detail and the polish on the pendent is nice and shiny but not quite mirror finish but more of a chrome look. The pendent is not stainless steel nor is it magnetic. But it's definitely some sort of metal alloy and is sold as sterling silver. I cannot confirm how authentic this claim is due to the fact I'm not going to spend the time to have it tested by a jeweler.\nThe only reason I didn't give this review 5 stars is because about 3 weeks into wearing this, the necklace began to make my neck really itchy. I could see the red line where the necklace makes contact on my neck. The necklace it's self is slightly magnetic but does not seem to be purely stainless steel. I have a variety to stainless steel necklaces that I've owned for many years that I have never had a reaction to. So as far as what specific material the necklace is made from or what alloy they are using. My skin seem to have some sort of allergic reaction to it.\nIf I could make one change to this product, it would be to make the necklace out of sterling silver as well. Or at least make it out of pure stainless steel."
			},
			{
				"name": "Missourijack65",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " nice looking chain and crucifix.",
				"review": "The crucifix is nicely detailed, and the chain and clasp look like they'll last a while."
			},
			{
				"name": "Emandems",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful",
				"review": "Very sturdy and beautiful design."
			},
			{
				"name": "Cindy Walker",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great gift",
				"review": "I bought this for my son as a gift, he loves it & wears it everyday. It’s exactly like the picture & what the description describes. My son is so happy with it, which makes me a happy momma too."
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great detail on the crucifix. They were exactly as described.",
				"review": "This was a very nice crucifix. It was the perfect size for each of our grandsons ( one 5' and the other 6'). The detailing was very nice on the image."
			},
			{
				"name": "Chris Ryan",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Good gift and chain.",
				"review": "I like this necklace. It appears to be well made. The Pendant did fall off the first day I wore it. Luckily, I saw it fall and reattached it. It crimped it down and it has been fine for months now."
			},
			{
				"name": "jayNsue",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Perfect gift for my Hubby!",
				"review": "I bought this for my husband for Christmas and he's had it on since. He is thicker in the neck and and shoulders so I worried the chain would be too thin and short but it is perfect. Great price and thick strong chain. I'd like to buy another with shorter toddler chain in the future. Thank you and God bless!"
			},
			{
				"name": "Philippe-Olivier Fournel",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Très beau",
				"review": "Très beau collier. La seul chose est que ça aurait pus arriver dans une petite boîte à bijoux au lieu d'être dans un sac de plastique."
			},
			{
				"name": "Alex S",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Nice looking Necklace",
				"review": "Good looking necklace. The necklace looks very sharp."
			},
			{
				"name": "Kristen P.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "2/5",
				"reviewTitle": " NOT FOR SENSITIVE SKIN",
				"review": "I got this for my boyfriend. He got an allergic reaction to it after using it for a few days. I'm assuming there is nickel in the necklace. it's not good for gifting if you aren't sure about how the person's skin will react to it."
			},
			{
				"name": "Tabatha",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Buyer beware",
				"review": "10 days after the return window closed the text broke off the top of the cross. I'm very disappointed in this as it is supposed to be real silver."
			}
		]
	},
	{
		"category": "Jewelry",
		"id": "FCpvvT",
		"title": "Osmo - Genius Starter Kit for iPad - 5 Educational Learning Games - Ages 6-10 - Math, Spelling, Creativity & More - STEM Toy Gifts for Kids, Boy & Girl - Ages 6 7 8 9 10 (Osmo iPad Base Included)",
		"imageUrl": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81bTf4V7W7L._AC_SX425_.jpg",
		"price": "$55.99",
		"description": "A great entry to the Osmo universe, the Genius Starter Kit for iPad includes everything your child needs to experience - hands-on learning and digital fun in five different ways through 5 games. We know kids learn by doing, so each game uses physical action. Whether it’s arranging tangrams, zooming number tiles around, over 150 word puzzles to discover, freehand drawing, or physics meets creative problem solving (Tangrams, Numbers, Words, Masterpiece & Newton Games), Osmo sees and reacts to every real-live move. Osmo games bring a child's creative imagination to life with hand held pieces that interact with an iPad and an Osmo Base (No WiFi necessary for game play). The Genius Starter Kit for iPad ships with an Osmo iPad Base. Approved by parents and teachers worldwide, used in over 31, 000 classrooms.",
		"totalReviewCount": "8,953 global ratings",
		"averageStarRating": "4.7/5",
		"reviews": [
			{
				"name": "Heather",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Easy set up",
				"review": "Got this for my 2nd grader for Christmas. She loves it! It was easier to set up than I expected which is a huge deal when you have an excited kid wanting to play with it. You do need to use your phone in addition to the device your using to play it. It sends codes to your email that you need to enter. I'm not super tech savvy but had it ready to play in under 10 min. I bought it with the hopes of making her tablet time more productive without her realizing it and this accomplished that. Also purchased the pizza game and monster game. The biggest plus was that IT ACTUALLY WORKS. I expected to have to have the game pieces lined up perfectly or for it to struggle to recognize the piece placement, but nope. It immediately identifies the game pieces and creates a corresponding image on her tablet screen. My only suggestion is (especially if you're buying multiple games) since there's a lot of pieces, purchase a storage case.  has cases specifically for it, but make sure you buy the correct one (iPad vs android vs Fire tablet) because the docking piece is different for each one. This is definitely a great gift and since I got it on a deal day for 50% off, I got the additional games and I'm glad I did. I'm hoping it continues to hold her interest because it's a fun learning tool!"
			},
			{
				"name": "Alexandra Gulka-Abenchuchan",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Perfect starter kit for 6 year old",
				"review": "My kid used to play Osmo when she was 3 years old with their little genius starter kit back in the days. I sold them then forgot all about it and now she's 6. I asked her if she remembers playing Osmo in the past, she doesnt but when I ordered the Genius Start Kit that's more suitable for her age, she seems to remember some aspects to it.\n\nUpon opening the game, the process to install and add Osmo is pretty easy as long as you have an account with Osmo. They'll send you a code to connect the apps. We then tried 4 out of the 5 of the games they include.\n\nNumbers: such a great game for math skills, there's a whole lot of basic math work - adding, subtracting and when it got to multiplying and the numbers got a little higher - we had to stop.\n\nWords: You have to fill out the blanks as there are missing letters in a word. It's a fun game for a 6 year old who loves spelling out words. We haven't gone that far into the game but I would imagine it gets harder and she would constantly be challenged.\n\nMasterpiece: This game is a tricky one. I won't lie but I was excited about this one because my kid loves drawing and coloring. Unfortunately the tracing part where you trace on the paper with the help of the tracing outline on ipad is SO SO SO weird. It's hard to trace as you're constantly trying to find the lines and you're looking up and down repeatedly to make sure your pencil is on the line and most of the time, it's not so instead of tracing - my kid just memorized and copied the general outline and drew it herself on the paper. I wish this game was better in so many ways.\n\nTangram: This one is a WINNER! My kid had so MUCH fun playing this game, it's almost her favorite. It comes with the tandem pieces in different shapes and colors and you have to put them together to create a figure. The app will help and guide you all the way which is so fun and helpful. It's also a funny game and I catch my kid giggling and laughing most of the time.\n\nNewton: We haven't played this one yet!\n\nOsmo has become a daily part of our life."
			},
			{
				"name": "Krysta",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Mixed emotions but mostly good!",
				"review": "I had seen this item before but it was always a little too pricey. We got this on a pretty good sale and I didn't do much if any, research beforehand. One thing I wish I had known ahead of time was that you have to use the iPad without a case or with one of the few cases made specifically for Osmo. It would have been nice if the stand adjusted to fit other cases but it doesn't. If you want the Osmo compatible cases you're looking at another $50. I just found a super cheap case that was easy to put on and take off, not a dealbreaker but this definitely was not ideal. Add on games are a little expensive so I think we will just be sticking to the 5 included with the starter kit, not a huge deal."
			},
			{
				"name": "Na r",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Daughter loved it",
				"review": "I brought this for my 8year old who is autistic she loved everything about this. She loves learning this just made it more hands on"
			},
			{
				"name": "Kayla Western",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Excited to use!",
				"review": "This is a Christmas Gift for my Son. The package came on time and looked as expected! There was no damage to the box. I wish that they had some of these without the whole starter kit, because we now have 3 of the stands and we don't need that many, but still great!"
			},
			{
				"name": "WLB in CT",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Kids Love It!!",
				"review": "Educational fun for all ages.\nThis is a great way for your kids to use a tablet device.\n\nStay Well - Stay Safe"
			},
			{
				"name": "Colin",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " We love Osmo!",
				"review": "We continue to be amazed with all of the fun ways that these products teach our littles various concepts."
			},
			{
				"name": "Jo Mengaud",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " So far it has been a challenging thing to set up",
				"review": "We couldn't get the games to open so call the customer services in the USA!\n1. The redemption coded need to be entered in CAPITAL letters only. 2. The osmo app needed was the osmo world app, not the osmo parents app (which also needs to be downloaded, but not till after the initial set up phase)"
			},
			{
				"name": "Janet Desmond",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Kids Love It",
				"review": "7 year old, 6 year old and 3 year old all love it. It’s a screen but with physical interaction. Great fun and educational."
			},
			{
				"name": "Pratt",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Ipad apps would be just fine.",
				"review": "Ipad or android apps for kids would be just fine. Whole thing is a joke and hype. Kids didn’t even go back to it after a day. Too many things to set up. Too many junk emails from the company after you done register. Even if you create something wrong you still get a check mark and moves you to next step. What is the point? You need an ipad anyways. Why not look into great apps and set some screen time."
			},
			{
				"name": "Vanessa",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " It's educational and FUN!",
				"review": "I barely write any reviews but I think everyone deserves to know that this product is really worth it. It's fun for the kids at the same time it helps in developing their motor skills, they enjoy drawing and learning how to spell and count. It's very interactive and it keeps the kids interested. I highly recommend this product to everyone who has kids."
			},
			{
				"name": "Racha",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Kept the kids occupied for hours on christmas morning",
				"review": "« This is the best gift ever » according to my kid who received a lot of gifts this year. She absolutely loves it and has been playing with it for hours which allowed me to have a nice breakfast on christmas morning. so its a win win if u ask me.\ni actually stood behind her captivated my self. 100% recommend. i waited for prime day to get it on sale and its totally worth it"
			}
		]
	},
	{
		"category": "Jewelry",
		"id": "e-2Zrc",
		"title": "Osmo - Creative Starter Kit for iPad - 3 Educational Learning Games - Ages 5-10 - Drawing, Word Problems & Early Physics - STEM Toy Gifts for Kids, Boy & Girl - Ages 5 6 7 8 9 10 (Osmo Base Included)",
		"imageUrl": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/81czHg9RkDL._AC_SX425_.jpg",
		"price": "$69.99",
		"description": "A great entry to the Osmo universe, the Creative Starter Kit for iPad includes everything your child needs to experience - hands-on learning and digital fun in **three** different ways through 3 games. We know kids learn by doing, so each game uses physical action. Whether it’s freehand drawing, supercharging drawing skills, or physics meets creative problem solving (Monster, Masterpiece & Newton Games), Osmo sees and reacts to every real-live move. Osmo games bring a child's creative imagination to life with hand held pieces that interact with an iPad and an Osmo Base (No WiFi necessary for game play). The Creative Starter Kit for iPad ships with an Osmo iPad Base. Approved by parents and teachers worldwide, used in over 31,000 classrooms.",
		"totalReviewCount": "4,000 global ratings",
		"averageStarRating": "4.7/5",
		"reviews": [
			{
				"name": "SamSw",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Markers suck",
				"review": "Just unboxed the set and the markers don’t even work. In the grand scheme of things not a huge deal but it is annoying to pay so much and not even have USABLE markers."
			},
			{
				"name": "WLB in CT",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Kids Love It!!",
				"review": "Educational fun for all ages.\nThis is a great way for your kids to use a tablet device.\n\nStay Well - Stay Safe"
			},
			{
				"name": "K.D. Cox",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Beware For iPad Pro Users",
				"review": "This product is really fun and educational for my 6 year old and I’m glad I snagged it on Prime Day. My hang up on this product is the teeny tiny print I missed saying I need a special reflector for my iPad Pro since the one that comes standard is not compatible. I wish marketing had made that more clear so that we could have bought the reflector all at the same time. Now my kid has to wait a few extra days for the compatible reflector -that honestly should just come with the kit instead of having to pay an additional $10 for it."
			},
			{
				"name": "JEN",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Get your own dry erase markers.",
				"review": "We left his osmo kit at home, so we bought this one. I like the design of the base and the mirror part. The first thing that happened was the red marker did not work. The others did, but gladly I had some others hanging around to use. I really like Osmo, and this base seems to sit a bit higher, and more solid, both bases / kits are nice. I said I wouldn't gift it but yes I would, as long as I added the extra dry-wipe markers. Great gift actually."
			},
			{
				"name": "Britt&James",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Great gift for kids who have too many toys",
				"review": "This is a really cool concept and it works really well.\nWe were Christmas shopping and wanted something that isn’t a toy for our six year old daughter. This popped up and it seemed perfect. We bought this game/system since she loves to draw. We also picked up the iPad case along with the pizza and detective games. The one downfall is that you need to download an app for the system itself and separate apps for each game. This eventually takes up tons of space on the iPad which sucks.\nThis particular game is my least favorite. Honestly, it’s a bit redundant and boring. My daughter enjoys it, but finds the other games much more entertaining.\nAll in all we love the Osmo games. It’s a great gift for the kid who doesn’t need more toys— plus it’s educational and they can set it up and play without help!"
			},
			{
				"name": "Carey Hall",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Kids did it all",
				"review": "The kids, 5 and 10, love this. They have been playing for 2 hours already. They each want more turns. Set up was super easy, the only thing I had to do was allow the app to download from the app store."
			},
			{
				"name": "Anna Moglia",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Love Osmo",
				"review": "I have purchased many Osmo games for my daughter and have also gifted them to her friends for their birthdays. Kids love osmo. I have paid less for this starter kit here than from other retailers. Worth the money. Extremely entertaining. Highly recommend!"
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Easy to use",
				"review": "My Grandkids loved it. Was easy for them to use"
			},
			{
				"name": "Cheryl maki",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "2/5",
				"reviewTitle": " Kids got bored",
				"review": "Kids bored very quickly"
			},
			{
				"name": "Chénier Claude",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Rapidité de la livraison",
				"review": "Cadeau mon petits-fils"
			},
			{
				"name": "Tianxiao Wang",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " creative gift for kids",
				"review": "such a great and smart gift! Kids enjoyed so much!"
			}
		]
	},
	{
		"category": "Jewelry",
		"id": "ocUVrS",
		"title": "PAVOI 14K Gold Colored Lightweight Chunky Open Hoops | Gold Hoop Earrings for Women",
		"imageUrl": "https://m.media-amazon.com/images/I/51dj7f0mdBL._AC_UX395_.jpg",
		"price": "$13.95",
		"description": "Product Details\nMaterial\nSterling Silver\nAbout this Item\nPAVOI 4.5mm Thick 20mm Diameter Rose Gold Earrings for Women\nInfinity Earrings are Hypoallergenic; Nickel and Lead-Free with Stainless Steel Post\n✦ 90-DAY GUARANTEE ✦ Your happiness is our number one priority. To ensure your complete satisfaction, we offer a hassle-free 90-Day money-back guarantee. To get in touch, email or chat with us - a member of our team will be happy to help you.\n✦ SUSTAINABILITY ✦ We’re committed to protecting the planet. That’s why every piece of PAVOI jewelry is crafted with 100% recycled materials and we package in 99% recycled and compostable materials. We are proudly carbon-neutral and completely offset our plastic consumption by removing over 275,000 plastic bottles from our ocean annually. Learn more about our sustainability efforts here.\n✦ PROUDLY AMERICAN-OWNED ✦\nSee more\nAbout this Item",
		"totalReviewCount": "41,861 global ratings",
		"averageStarRating": "4.5/5",
		"reviews": [
			{
				"name": "Theresa",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " New favorites",
				"review": "I don't know what it is about these earrings, but they just look so good on me! They are the perfect thickness, size, color, and weight. I got the 20mm gold and loved them as soon as I put them on. I like that they are simple enough if I want to wear them with a fancy necklace, but they also stand out on their own. They are easy to dress up or down. IF they tarnish as some claim I will edit review, but I intend to keep them away from water."
			},
			{
				"name": "Coco puff",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful earrings",
				"review": "Well I have not worn earrings for Avery long time because they just irritate them and I was like let’s try these after reading reviews and looking up ones that can help with allergies with metal I picked these .\nwell within two mins my ear started to itch so with that said there beautiful arrived on time. Packaged well I will wear these but I will have to put some clear varnish on them so not to irritate my ears. 😕 I would buy as a gift for sure"
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great earrings!",
				"review": "Great cheap earrings! I typically wear only real gold hoops but wanted a pair of bigger ones for daily wear. I have in a few sizes and wear on a daily basis, take out to shower/ before going to bed and they haven’t tarnished or shown major signs of wear."
			},
			{
				"name": "Aly Stobie",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Buy these!",
				"review": "I wear these every day. They do tarnish over time, but since they're so affordable it hasn't been an issue for me. I've repurchased these 3+ times over the past 2 years and continue to wear them daily."
			},
			{
				"name": "Anonymous",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Very nice quality",
				"review": "Ordered 2 pairs - one for myself and one for Christmas stocking stuffer for DIL. Very nice quality, lovely size and shape. They feel very comfy and lightweight even wearing them for hours. Box states they are 14K gold. The gold polishing is very feminine and classy. Packaging was very classy, too!"
			},
			{
				"name": "Kathy Rodriguez",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " I wear these everyday!",
				"review": "I absolutely love these earings! Super comfy and lightweight. They look super cute with casual outfits also if you dress up they are a nice touch. Love these earrings!"
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " these are adorable, versatile and a perfect color",
				"review": "Order these...I got the 20mm and they are very nice. the price and quality are awesome. Giftable too.\nBest purchase in a long time from ."
			},
			{
				"name": "Alexis Leon",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Such good quality!!",
				"review": "These were seen on Tiktok and they didn’t disappoint! I’ve ordered more jewelry from this brand because it is such good quality - why spend insane amounts of money when you can get these and they don’t tarnish, are lightweight, and look great for cheap! Will continue to repurchase jewelry from this brand"
			},
			{
				"name": "dee gregory",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Good for sensitive ears",
				"review": "I have very sensitive skin and these earings are perfect so long as you take them out as advised"
			},
			{
				"name": "Cheebaby",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " It was delivered Damaged",
				"review": "It was packaged in a very little clear bag and too tight to take out. When out, i saw it compressed flat on one side and some dents were seen due to being too tight and possibly rubbed on eachother in the little bag."
			},
			{
				"name": "sweetbim",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " great!",
				"review": "I like it. It looks great"
			},
			{
				"name": "Yahlini Marie",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Super cute and hypoallergenic",
				"review": "I love them. I wear them with anytning. Really good quality too and no irritation on the ears. Recommend!"
			},
			{
				"name": "M lopez",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Cant fault them",
				"review": "Gorgeous"
			}
		]
	},
	{
		"category": "Jewelry",
		"id": "cOkLY8",
		"title": "Osmo-Little Genius Starter Kit for Fire Tablet + Early Math Adventure-6 Educational Games-Ages 3-5-Counting, Shapes & Phonics-STEM Toy Gifts-Ages 3 4 5(Osmo Fire Tablet Base Included- Exclusive)",
		"imageUrl": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81kVMj4rJpL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
		"price": "$109.73",
		"description": "The preschool entry product into the Osmo universe, the Little Genius Starter Kit for FIre Tablet + Early Math Adventure includes everything your child needs to experience - hands-on learning and digital fun in six different ways through 6 games. We know kids learn by doing, so each game uses physical action. Engage preschoolers in core subjects and spark imaginations (Counting Town, Shape Builder, ABCs, Squiggle Magic, Costume Party & Stories). From shapes to counting, pre-reading to problem-solving skills, these games will inspire a new generation of active learners. Use Sticks & Rings for 4 creative games: Fill a magic mansion with furniture & incredible things you create exploring shapes & colors (Shape Builder)! Practice counting as you build numbers creating a town of buildings & friendly animals (Counting Town). Learn letter formation & phonics with 300+ words (ABCs), creating images in 5 playgrounds & watch them come to life on screen (Squiggle Magic). Use Costume Pieces for 2 fun games: Experiment with clothes & colors to make party outfits, watch characters react (Costume Party) solve creative stories & find silly solutions to obstacles & navigate adventures (Stories). Enable a child to explore on their own or with parent participation. Osmo games bring a child's creative imagination to life with hand held pieces that interact with a Fire Tablet and an Osmo Base (No WiFi necessary for game play). The Little Genius Starter Kit for Fire Tablet ships with an Osmo Fire Tablet Base. Approved by parents and teachers worldwide, used in over 31,000 classrooms.",
		"totalReviewCount": "12,694 global ratings",
		"averageStarRating": "4.7/5",
		"reviews": [
			{
				"name": "Laura Weesner",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " 3 Year Old Loves it!",
				"review": "We got this for my 3.5 yr old and she absolutely loves it! The costume and wiggle game are so engaging. It took a couple times of us sitting with her to learn how to play but after the fourth time playing she’s got it down. I wish it had an option to do more free play cause she could sit there and make up her own costumes or faces with the stick pieces for hours."
			},
			{
				"name": "Christina Stoker",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Reflector comes with the starter kit",
				"review": "Bought this for my 5 yr old son for Christmas. I wanted to write a review for those confused (like I was) about whether the reflector is included in the kit. The reflector IS included and was in the Kit I bought Dec 2022. Once we start using it on Christmas day I can provide a more detailed review about the functionality of the product. But for now, rest assured the reflector is there."
			},
			{
				"name": "Michael aycock",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great gift",
				"review": "Bought this for my 3 yr grandson. It’s amazing. And we all enjoyed playing with it. I know he will enjoy this for a long time. Highly recommend."
			},
			{
				"name": "T.L.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Little Genius Starter Kit, fun games and lots of learning",
				"review": "I'm a huge fan of the Osmo ecosystem. Our son loves the different games and we have the bases for multiple platforms from other kits we've bought over the years (Kindle Fire, IPad). This particular kit is brand new, includes an IPad base, includes silicon shapes, and costume pieces for use with the associated games. It was neat to read they partnered with Marbotic, a French company, as I've used their Smart Numbers and Smart Letters product / games with my IPad previously and really love them for learning.\n\nThe materials themselves seem high quality and the silicon pieces do not seem the sort to easily break from heavy use. The costume pieces are varied and the mat you place things on is made of a nice material.\n\nAs for the games themselves they seem alright:\n\nABCs (4/5): You are shown letters which you then can create using the silicon pieces. The letters shown have colors so it's pretty straightforward for figuring out the best pieces to use once kids get the hang of it. My three year old had fun doing this and was able to make the letters pretty easily without issue. If you get the letter close to what it looks like the avatar gets excited and tells you that looks good but if you fail it only gives you a generic message. I guess the intent is to enforce the good and not punish the negative but once my son realized he could put anything there his mischievous side surfaced and he stopped following the directions creating all sorts of random shapes laughing his head off. I still think it's a good game but I wish it had better structure for showing the correct representation or some form of grading for how close he is so he can strive for a goal there.\n\nSquiggle Magic (5/5): This game reminds me of the creative games Osmo has. You can make pretty much anything using the silicon pieces and it'll be treated like the item you were asked to make. I think this is a positive here as this app is more about self expression than meeting some defined goal (like the letters above). You're given tasks to accomplish which, after doing a certain number, unlock new areas to head to. One for example was some underwater area and tasked my son with creating lots of creatures which moved around somewhat after they were added. My son, of course, went mischievous mode and created all sorts of sea life abominations but he did so with a big grin and lots of laughter so I think it was a huge success here.\n\nCostume Party (3/5): Another neat game. You dress characters up for a party and can configure colors, etc. My son wasn't really interested in this game as he found the others to be more involved. Personally I feel like this game may have been added to justify the addition of the costume pieces as perhaps they felt the stories app wasn't enough of a use case. The stories app is the place where the dress up is of more use.\n\nStories (4/5): Stories is an interesting game as you are tasked with helping your character through some struggles they encounter in a given narrative. One story for example required the use of the boat feet costume piece to cross some water. Other interactions involve both placing the clothing piece down and then touching some aspect of it on the app itself to trigger its response. For example you may be required to scare something away so you go grab the helmet with a cat on top, put it as your characters hat, and then single tap the cat to activate it. I feel it encourages creativity and problem solving skills. The costumes are pretty varied as well which is nice. My only dislike about the app was that sometimes it felt a bit slow with the transitions between each task.\n\nIn general my 3 year old loved the little kit and I wasn't disappointed by it. I do feel like the older kid genius kit comes with more value for what you spend but I don't feel ripped off either. I feel like it's a solid kit that would be a definite recommendation if they could find additional uses for the pieces here and if they improve on some of the experiences in the apps themselves. I'd recommend it if you are looking for an entry into the Osmo ecosystem though as it's a good place to start with kids."
			},
			{
				"name": "Sarah Nzekani",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Yes, please…",
				"review": "I’d give it 5 stars but the initial confusion I had on which app I should or shouldn’t download for this was annoying.\n\nMy toddler loves this game to a point where he asks for it. Thats a big thing for me.\nSecondly, no glitching unlike one of their competitors(PlayShifu). Any tech I don’t have to reach out to support for help is a good tech for me. I even enjoy some of the games and activities in this. Overall, this is a product that shows that the developers took their time and made sure people would not be asking for refund. I’ve become bias regarding this product and honestly I look forward to buying more of this company’s stuff. Please keep up the great work."
			},
			{
				"name": "China Max",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " ‘‘Twas the gift that was missing a bunch of pieces",
				"review": "I love the Osmo system for my niece and son. It’s super cute and they LOVE playing with it . The absolute only complaint I have is I bought two of them for Christmas gifts and one of them came with all the pieces and my sons package was missing about 7 pieces . We matched the pieces in my nieces kit to the ones my son has and he was missing the shirt purple sticks he didn’t have any , the blue half circles (he only had 2) and the big green ones (he had 3) . I was disappointed some of the faces he was unable to create because of the missing pieces and trying to get two 4 year olds to share is , well…. I’m only able to write this review because I didn’t . Hopefully we just got the one random one because we are the luckiest family in the world . Otherwise - LOVE that it’s easy for toddlers to use and navigate on their own ."
			},
			{
				"name": "Cass",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Solid system, okay starter kit",
				"review": "First, there was a ton of struggle during set up. I have a 12.9\" iPad Pro and had to buy the additional adapter, not a big deal but I didn't realize it when I bought the Osmo kit.\n\nNext, the story time game did not want to work. It took a lot of finesse to get it going but then it worked well.\n\nIt is fun but a bit limited for the low end of the age spectrum (3y.o), however, the bigger kids can get a bit more fun out of it but it doesn't have a ton of replayability for them. This is only a review of the Osmo and the Starter Kit for young kids though so it makes sense that big kids would be bored."
			},
			{
				"name": "yoda",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Good",
				"review": "My 4 years old daughter likes it!!"
			},
			{
				"name": "Mrs McLorie",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Fun and educational. Highly recommend.",
				"review": "This is a fantastic bit of kit. My 4 year old daughter absolutely loves it. It’s really easy to use, and keeps her occupied and interested. The added bonus being that it speaks with an English accent as apposed to American. (Nothing against Americans, but when teaching kids to pronounce letters and words, I’d rather it was in English!) I would definitely recommend this."
			},
			{
				"name": "Peter Gibbins",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "2/5",
				"reviewTitle": " Reqiures extra adapter for kids Fire HD 8!!",
				"review": "This said it required a 10th Gen Fire tablet - whatever that is but I've got the latest version, its pretty hard to work out which version you have.\nGot the kit but the Fire tablet doesn't fit because the webcam is along the landscape side not portrait! The latest Kids HD8 tablet requires an adapter which  don't sell, you have to go direct to Osmo for and is another £15 which is shipped overseas. So thats going to take ages to come along. No mention of this anywhere, really disappointed."
			},
			{
				"name": "Xicuembo",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Excellent value for money! My eldest loves Osmo and she is 5y old.",
				"review": "Got it from  Warehouse Deals\nCame all complete as new! Excellent Value for Money.\nIt's going to be a birthday present so the child hasn't used it, but we have another Osmo for iPad so we know it's a good learning tool."
			},
			{
				"name": "V2U",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " One hit wonder!",
				"review": "I understand the price of the device. But the additional prices of the games are not worth the price at all.\n\nThe little one loved it(for a week). And I've noticed similar reviews.\n\nIt's not progressive enough for what its worth...\nYoure left with a little one who absolutely loves the thing and just like that, there's nothing more you can do with it. Buzz kill!\n\nAwesome concept though to be honest.\nBut creators need to re-think how they price and upgrade it so you can keep reusing it.\nIt's not sustainable at the moment and given our current climate, that doesn't sit right with me."
			},
			{
				"name": "Eagle",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "2/5",
				"reviewTitle": " Unclear",
				"review": "It should be much clearer that a reflector adaptor is essential for certain Fire's. One disappointed child on Christmas Day as I didn't read the small print and I have to purchase a separate adaptor to make it work....."
			}
		]
	},
	{
		"category": "Jewelry",
		"id": "Eevtlc",
		"title": "Swarovski Sparkling Dance Round Jewelry Collection, Rhodium Finish, Blue Crystals, Clear Crystals",
		"imageUrl": "https://m.media-amazon.com/images/I/61P3Ce-eYwL._AC_UY395_.jpg",
		"price": "$87.00",
		"description": "Product Details\nMaterial\nRhodium plated\nCountry of Origin\nThailand\nAbout this Item\nSimple and elegant: This rhodium plated necklace combines the precision and quality of sparkling Swarovski crystals with a timeless necklace design, for a touch of glamour for every occasion\nMinimalist and unique: The Sparkling Dance necklace features a dainty eye-catching circle cut clear crystal pendant paired with matching crystal pavé and a delicate rhodium plated chain\nDesigned to last: Swarovski jewelry will maintain its brilliance over time when simple care practices are observed; remove before contact with water, lotions or perfumes to extend your jewelry's life\nVersatile and eye-catching: Whether an everyday accent or a unique, conversation-starting accessory this Sparkling Dance pendant necklace is a simple piece that complements any look on any occasion\nItems delivered: 1 x Swarovski Sparkling Dance Pendant Necklace for women, 15 inch rhodium plated metal chain, circular center stone with sparkling clear crystal, complete with Swarovski necklace box\nSee more\nAbout this Item",
		"totalReviewCount": "1,270 global ratings",
		"averageStarRating": "4.7/5",
		"reviews": [
			{
				"name": "Emily S",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Mom loved them!!",
				"review": "This was a gift for my mom who has a Short Bob hair cut. First the quality is really nice. It’s sturdy and the hook/clasp part isn’t flimsy at all. Second, the crystals are really sparkly. Even the small tiny ones all around the main bigger crystal. Third, every time she moves even slightly, the center stone jiggles and it catches the light between her hair. These are not the cheap lightweight sterling silver earrings you can order for under $25. The style is alittle more classy. Highly recommend!"
			},
			{
				"name": "Gordana K",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Classy",
				"review": "So beautiful."
			},
			{
				"name": "Emily S",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Beautiful but for a kid",
				"review": "It’s really beautiful. The dancing stone is so sparkly. But the length of the chain is SUPER short. Real close to being a choker for an adult. I had to order a necklace extender separately and now it’s perfect. Surprisingly it’s cheaper on  than on Swarovski website."
			},
			{
				"name": "Robert Hacking",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " As advertised",
				"review": "very attractive - she loved it"
			},
			{
				"name": "phm3",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " shopping ahead/as expected",
				"review": "Very pretty. As advertised or featured."
			},
			{
				"name": "Cristin",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Must buy, gorgeous",
				"review": "Gorgeous, center diamond is always in motion and looks authentic. Beautiful sparkle, excellent quality, secure clasp for larger pierced ear openings and versitile for casual or formal outfits!"
			},
			{
				"name": "Diane",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Sparkly and stunning!",
				"review": "These are so delicate and sparkle so much. Lovely!"
			},
			{
				"name": "Mystery Writer \"Mercedes\"",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " She LOVED IT!",
				"review": "It was an eye catcher and she wore it the day I presented it to her.\nThe chain was shorter than she would have liked, but she could adjust the clasp to the side to center the necklace."
			},
			{
				"name": "Alan D Conyard",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " A lovely present for a good friend.",
				"review": "This Swarovski pendant necklace was purchased as a birthday present for a close friend. She was absolutely thrilled when she opened the blue box on her birthday and has worn the necklace constantly ever since. It is a stunning piece of jewellery which sparkles all the time and has been much admired by friends and family. I can highly recommend it for anyone wishing to bring pleasure to a close friend. It is certainly good value for money and most attractive."
			},
			{
				"name": "Tracey Hemburrow",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Small pendant.",
				"review": "Purchased for a birthday gift (24th may) Im very disappointed with the size of the pendant it appears to be even smaller than on photo. See my photo next to my little finger."
			},
			{
				"name": "Michelle Webber",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Simply stunning",
				"review": "I bought this as a gift for a friend but my husband then bought it for me. Absolutely stunning necklace. Have had so many compliments on it, and it clearly looks more expensive. Amazing value for money. It's lightweight and looks gorgeous with everything i wear, even in the daytime it's not over the top."
			},
			{
				"name": "WK",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " LOVELY NECKLACE",
				"review": "Lovely necklace from Swarovski. Bought as a present for one of my daughter's birthdays and she's very pleased with it. She tells me she is probably going to change the chain as she prefers a slightly heavier one. However, this is a personal choice and in no way suggesting of a 'fault' with the item as sold.\n\nWould recommend."
			},
			{
				"name": "cazrams 66",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Stunning piece of jewellery!",
				"review": "This was a birthday gift from my husband, he saw that I was admiring it online. I was pleasantly surprised to receive it."
			}
		]
	},
	{
		"category": "Jewelry",
		"id": "l6F20A",
		"title": "Alex and Ani Expandable Bangle for Women, Crystal Paw Prints of Love Charm, Rafaelian Finish, 2 to 3.5 in",
		"imageUrl": "https://m.media-amazon.com/images/I/61fkMR5G4ES._AC_UY395_.jpg",
		"price": "$26.99",
		"description": "Product Details\nMaterial\nBrass/Copper\nCountry of Origin\nUSA\nAbout this Item\nJEWELRY FOR LOVE: Channel your power with this Alex and Ani Crystal Paw Prints of Love Bangle, a constant reminder that you’ve found unconditional love\nTIMELESS ACCESSORIES: This beautiful adjustable bangle features a paw print charm with a genuine Austrian crystal heart inside, capturing the preciousness of your four-legged sweetheart\nSIZING AND CLOSURE: Our innovative, patented, and completely original technology replaces traditional clasps with a sliding mechanism to customize this classic bracelet’s size from 2\" to 3.5\" wide\nCOMPOSITION: Crafted with love and care in the U.S.A., this effortless accessory is based in a nickel-free brass/copper metal mix for easy care and timeless wear\nYOUR UNIQUE REMINDER: Feel the love with this Alex and Ani Crystal Paw Prints of Love Expandable Bangle, a reminder of your bond with your furry friend\nDescription\n\nThe love we have for our pets is like no other. They’re always there to lift our spirits. Never holding a grudge, they are the first to forgive, the first to forget, and the first to greet us when we come home after a long day. Our pets are a reminder of what unconditional love means. It’s a bond that cannot be broken. Alex and Ani Crystal Paw Prints of Love Bangle expresses the loyal bond between you and your furry best friend. Crafted with love and care, this beautiful bangle features a paw print charm with a genuine Austrian crystal heart inset. Wearing a paw print shows how much you cherish your pet. Our expandable bangle adjusts from 2\" to 3.5\" in width. Innovative, patented, and completely original technology ensures a customized fit of this elegant bangle bracelet. Made in the U.S.A, this pretty beaded bracelet is nickel-free and has a timeless classic design. We believe that jewelry should be a meaningful representation of who you are, and the characteristics you strive to embody. Choose the Alex and Ani Expandable Bangle as a beautiful gift to yourself- a symbol to wear for love, affection, and loyalty.\n\nSee more\nAbout this Item",
		"totalReviewCount": "3,350 global ratings",
		"averageStarRating": "4.7/5",
		"reviews": [
			{
				"name": "ASLRN",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great bracelet!",
				"review": "I like the Alex and Ani bracelets. I ordered this particular bracelet because we had recently lost a pet and this serves as a remembrance."
			},
			{
				"name": "Knitorious",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Dear to my heart — and every animal lover out there",
				"review": "I have a ton of Alex & Ani bracelets when they first became a “thing”. I don’t wear them as much anymore but I still do rotate them and wear them. The paw print is especially meaningful to me and there seems to be a charm for just about anything? Flexible, easy to put on and take off and not as heavy as a Pandora charm bracelet or gaudy like a bracelet filled with a dozen charms"
			},
			{
				"name": "Joni Carey",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " The best!",
				"review": "I just recently lost my dog, Josie… she was everything to me and when I saw this bracelet, I knew I had to have it! I wear it every day, never take it off…. In remembrance of my favorite girl and the best companion ever! Fabulous bracelet!"
			},
			{
				"name": "Pandam0m",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Adorable!",
				"review": "Gave to pet sitter as a gift! VERY well received. Excellent value for the $$ spent."
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Love it!",
				"review": "Beautiful bracelet!"
			},
			{
				"name": "Malinda",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Good quality",
				"review": "Good quality"
			},
			{
				"name": "Ria Koop",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Better than expected!",
				"review": "Was given as a gift and was a big hit!"
			},
			{
				"name": "S. Kent",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Love it",
				"review": "Very glad I ordered this, I wear it everyday."
			},
			{
				"name": "Lily",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " NO BOX",
				"review": "As others mentioned, this product does NOT come in a box. It does make me wonder about the authenticity of the product, but everything else about it seems authentic Alex and Ani so I think it is authentic and for whatever reason it just comes in bulk packaging.\n- The crystal was centered properly\n- It comes attached to a cardboard piece with the brand name plus 'charity by design', although it does not explain anything about the charity, it doesn't even say ASPCA is the chosen charity\nAll in all it seems like a nice bracelet and the recipient seemed to like it."
			},
			{
				"name": "Dian",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " No Gift Box",
				"review": "Very nice. Quality as expected from Alex and Ani. Just beware, it doesn’t come in a gift box which is disappointing since I purchased it as a gift."
			},
			{
				"name": "missybsweetie",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great Gift!",
				"review": "I gave this to my mom for her birthday and she loved it !"
			},
			{
				"name": "Jonathan cowles",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Everything I hoped for",
				"review": "Very pretty and arrived so fast. It’s exactly what I wanted for my mom! Perfect for any dog/cat mom."
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful bracelet.",
				"review": "This was a gift for my friend who had to put her dog down. She loved it !! The package arrived quickly and was safely packaged."
			}
		]
	},
	{
		"category": "Jewelry",
		"id": "nAiGvL",
		"title": "Sterling Silver Floral Ball Necklace Butterfly Daisy Flower Cubic Zirconia Bead Pendant Necklaces Gift for Women",
		"imageUrl": "https://m.media-amazon.com/images/I/61oU8-OM9HL._AC_UY395_.jpg",
		"price": "$32.99",
		"description": "Product Details\nMaterial\nSterling Silver\nAbout this Item\n❤Fashion Style❤ : Daisy with Butterfly Love Necklace --To that special someone who is the ray of light in your life. Give her this necklace and express your inner gratitude\n❤Material❤: Made of 925 sterling silver. Hypoallergenic, nickel-free, lead-free, cadmium-free and does not contain any allergic material, it is comfortable to wear\n❤Butterfly Known for its romance, beauty, and elegance, this butterfly necklace gives you all the ingredients to fall in love, is also a meaningful gift to yourself, your wife and your girlfriend.\n❤Precious gift❤: Christmas Gift, Birthday Gift, Graduation Gift, Halloween Gift, Thanksgiving Day Gift, Valentine's Day Gift, Mother's Day Gift, Wedding Gift ,Anniversary Gift.\n❤Quality Satisfaction❤:Please feel free to contact our customer service anytime if you feel unsatisfied or confused\nSee more\nAbout this Item",
		"totalReviewCount": "25 global ratings",
		"averageStarRating": "4.7/5",
		"reviews": []
	},
	{
		"category": "Jewelry",
		"id": "uqlEDq",
		"title": "Suplight 925 Sterling Silver 6 Prong Birthstone Necklace/Stud Earrings, Dainty Small Crystal Jewelry for Women Girls (with Gift Box)",
		"imageUrl": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/51zaTAmSdhS._AC_UY395_.jpg",
		"price": "$18.99",
		"description": "",
		"totalReviewCount": "160 global ratings",
		"averageStarRating": "4.5/5",
		"reviews": [
			{
				"name": "Barb",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Barb",
				"review": "Gave as a christmas present, granddaughter really liked them."
			},
			{
				"name": "italia123",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful earrings",
				"review": "Loved the size and quality of product. Very comfortable to wear and light."
			},
			{
				"name": "Patricia Purseglove",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Cute",
				"review": "I love them. They are not to small or big. They are soft and pretty"
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Perfect!",
				"review": "Love this size and style!"
			},
			{
				"name": "Sapphire",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Good choice for studs but larger than expected",
				"review": "I got 3 of these in different colors to wear together, to symbolize my birthday and my 2 children since I have 3 ear piercings. The earrings are pretty close to actual birthstone color (March and December are a little lighter than actual color I think) but they're good studs. They are bigger than expected so wearing the 3 of them together looks a bit odd at first and you can most definitely feel them when sleeping."
			},
			{
				"name": "dkneezm",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " The earrings are lovely as advertised.",
				"review": "The birthstone earrings are a gift for my granddaughter, who will be 12. They are appropriate for her."
			},
			{
				"name": "Kindle Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Dainty",
				"review": "I was glad that the necklace was very dainty and nice. Very feminine."
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Bought for granddaughter. gets tangled easily. Suggest small jewelry box as added gift",
				"review": "Need a better box"
			},
			{
				"name": "Heather Field",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Love the earrings",
				"review": "They arrived quickly. They seem to be good quality and the presentation is great for a gift"
			},
			{
				"name": "Rae Latanville",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Classy looking",
				"review": "Gift"
			}
		]
	},
	{
		"category": "Jewelry",
		"id": "URYQJW",
		"title": " Collection Men's Sterling Silver Solid Polished Cross with Lord's Prayer Inscription and Stainless Steel Chain, 24\"",
		"imageUrl": "https://m.media-amazon.com/images/I/615uv0JJIcL._AC_UY695_.jpg",
		"price": "$35.10",
		"description": "Sterling silver necklace with cross pendant featuring die-struck Lord's Prayer message",
		"totalReviewCount": "1,090 global ratings",
		"averageStarRating": "4.4/5",
		"reviews": [
			{
				"name": "Ellis",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Chain sucks, cross is great.",
				"review": "Chain wasn’t very strong. Cross is very nice looking and a great size. Replaced the chain with a silver one from  Basics and it looks great."
			},
			{
				"name": "Melissa Miller",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Perfect",
				"review": "The chain is sturdy, the cross is large without being for a rapper. This is a perfect daily wear cross for any Christian man. My husband never takes his off and was baptized with it. He's very happy with this cross, as am I"
			},
			{
				"name": "Sego",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " I just love it.",
				"review": "The Lord's Prayer is always close to my heart with this beautiful cross and chain. I never take it off."
			},
			{
				"name": "Kindle Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Absolutely perfect!",
				"review": "I'm a man and wanted a beautiful, yet simple cross that was sturdy enough to be worn 24/7. I purchased this a month or so ago and have yet to take it off. Showers have not tarnished it and it as beautiful as the day it came."
			},
			{
				"name": "Mauve_7",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " A GEM!!!",
				"review": "Just received this in the mail today and let me tell you, the pictures online don't do it justice. You have to feel it and see it for yourself to appreciate this piece! It has a nice weight to it and doesn't feel or look cheap at all! Feels and LOOKS much more expensive than it actually is. I'm so glad I went ahead and purchased this. You WON'T regret it!"
			},
			{
				"name": "Matt Snavely",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great gift!",
				"review": "Ordered this for my brother and he has been wearing it everyday for almost a year now! Great quality!"
			},
			{
				"name": "CSully2",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Given as a gift",
				"review": "Given as a gift"
			},
			{
				"name": "Hagen Morris",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Kinda cheap",
				"review": "Want me not what I was expecting to get"
			},
			{
				"name": "Chimchar",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great product.",
				"review": "Great product."
			}
		]
	},
	{
		"category": "Jewelry",
		"id": "Ooz0iW",
		"title": "Betsey Johnson Rose Dangle Earring",
		"imageUrl": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81GeV6s6M9L._AC_UY535_.jpg",
		"price": "$29.45",
		"description": "Product Details\nMaterial\nEnamel, Glass, Metal\nAbout this Item\nDangle earrings featuring long ear wire with iridescent stones and pink rose drop embellished with delicate mixed stone accents. Earrings are set in gold-tone metal with a shepherds hook closure.\nGold-tone metal with glass and enamel\nLength: 2.25\"\nWidth: 0.8\"\nShepherds hook closure\nImported\nDescription\n\nBetsey Johnson dangle earrings featuring long ear wire with iridescent stones and pink rose drop embellished with delicate mixed stone accents. Earrings are set in gold-tone metal with a shepherds hook closure.\n\nSee more\nAbout this Item",
		"totalReviewCount": "2,471 global ratings",
		"averageStarRating": "4.4/5",
		"reviews": [
			{
				"name": "My2Cents",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Sparkle & Shine",
				"review": "These earrings are so darn cute & whimsical! Just looking at them makes me smile. They were purchased as a gift. Truth be told, I DID think about just keeping them! They’re longer, and the flower is much bigger, than anticipated. The green rhinestones ( flower stem ?) on the front side off the earrings add pizzaz adding detail to the overall design. Lightweight too making them big, bold, sparkly, sassy and comfortable to wear."
			},
			{
				"name": "SwampyJ",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Plenty of bling and great colors",
				"review": "These are statement earrings. And quite large. So I wound up not keeping them because they were too big for me, but if you are into big earrings, these were very, VERY cute. Super lightweight and easy to put on."
			},
			{
				"name": "Barb Smith",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Gorgeous!",
				"review": "Great colored enamel and the crystals really sparkle! I wear these often and get compliments every time!"
			},
			{
				"name": "Becky Aguilar",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Very cute earrings. Arrived broken.",
				"review": "Very upset that they arrived broken. They were supposed to be a gift."
			},
			{
				"name": "Kindle Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " They're fun to wear",
				"review": "I bought these earring because I thought they were pretty. I'm very pleased with them. I was going to give them as a gift but I'm keeping them for me."
			},
			{
				"name": "Pamela D.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " So cute!!",
				"review": "I love Betsy Johnson and I couldn't pass up the great price."
			},
			{
				"name": "swimcb83",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " so pretty!!",
				"review": "I bought these for a beach weekend in Jamaica. Just what I wanted! Cute and lightweight. Would recommend."
			},
			{
				"name": "NB",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Cute but came broken",
				"review": "Really pretty, but it came with one of the earrings broken, with the inner, smaller flower broken and fallen off. Instead of returning it, I thought I’d try to superglue it, and for now, it seems to be holding well, but when you pay that kind of money for a pair of brand name earrings, please do better!"
			},
			{
				"name": "Ita",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Mala calidad",
				"review": "Se ven mejor en la foto... se ven de baja calidad y tienen un brillo “Charo” se ven baratos. Los devolví"
			},
			{
				"name": "Jane",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Very elegant!",
				"review": "These are very pretty earrings!\nThey came faster then expected also!\nI love them."
			},
			{
				"name": "Jo",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Look exactly like picture",
				"review": "They were much bigger than expected, but very pretty"
			},
			{
				"name": "Anyes Margrain",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great",
				"review": "Beautiful"
			},
			{
				"name": "Zhenglin Jin",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful earrings with multiple colours.",
				"review": "I love this pair of earrings."
			}
		]
	},
	{
		"category": "Jewelry",
		"id": "REKSwS",
		"title": "Betsey Johnson Stone Heart Drop Earrings",
		"imageUrl": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/71DP1iyU3TL._AC_UX395_.jpg",
		"price": "$25.64",
		"description": "Betsey Johnson dangle earrings featuring pink faceted stone heart detailed with small critter and flower accent. Earrings are set in gold-tone metal with shepherds hook closure.",
		"totalReviewCount": "2,314 global ratings",
		"averageStarRating": "4.4/5",
		"reviews": [
			{
				"name": "DParker",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Earrings",
				"review": "I love these earrings! These are so pretty and grest style. I got compliments on them the first day I wore them! ❤️❤️❤️"
			},
			{
				"name": "Maryann patty",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " BEAUTIFUL",
				"review": "Gift able & light weight on the ears"
			},
			{
				"name": "Angela Kilburn",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Worth the trouble",
				"review": "I read the reviews about these earring arriving broken. I took a chance and one of mine were in fact broken. On my return request I was offered the option of exchange them. I did and I received my new pair within 48 hours and given 3 months to return the original pair. It was worth the hassle and now have a pair of unique, adorable earrings!"
			},
			{
				"name": "Cathy Daniel",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " These are rigid",
				"review": "I thought these would be \"moveable\" like dangle. But the don't. They're very rigid, a little heavy and they are quite opaque. Not what I was hoping for but I still like them"
			},
			{
				"name": "eladia lopez",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " PERFECT BEAUTIFUL",
				"review": "Absolutely gorgeous earrings. I was skeptical because of some of the reviews but I'm so happy I took the risk. Worth every penny."
			},
			{
				"name": "Nancy",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful but larger than thought",
				"review": "These earrings were charming but clunky big so I returned them."
			},
			{
				"name": "Amanda Dennison",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " The little green bug didn't fit my expectations.",
				"review": "It wore well and light weight because I forgot that I was wearing it."
			},
			{
				"name": "Miss Patti Duke",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Betsey had me at hello",
				"review": "First time buying her products on  and while I have many B Johnson earrings, this pair down not seem to be made with the same quality as what I purchase normally, but they are very pretty. From now on I’ll stick to purchasing at TJ Maxx."
			},
			{
				"name": "Margaret Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " So Cute & OTT",
				"review": "Bought for my grand-daughter but too large for her. So I am wearing them:) Quite garish & OTT but that's Betsey Johnson:) If you want delicate, understated earrings don't order BJ. If you want to be noticed...go for it!!!!"
			},
			{
				"name": "Shopping Sheryl",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Betsey Johnson",
				"review": "Love Betsey. Earrings were exactly as expected. They are a bit larger than some might like, but I'm happy with them."
			},
			{
				"name": "Cliente de ",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Bellísimos 🤩",
				"review": "Están hermoso y no son pesados\nLa verdad lucen muy bien 💖 tal cual como se muestran en las imágenes"
			},
			{
				"name": "PaulinDoon",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Wife LOVED them",
				"review": "Anniversary present for my spouse .. great details & quality. Couldn’t go wrong with these Betsy earrings"
			},
			{
				"name": "Danielle",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Mauvaise qualité",
				"review": "J’adore les bijoux de BJ. J’en possède quelques uns. Ces boucles d’oreilles ne sont pas des originaux . Elles sont croches et de mauvaise qualité. En plus elles sont violettes! Extrêmement déçue."
			}
		]
	},
	{
		"category": "Jewelry",
		"id": "5Ut0-a",
		"title": "YI 4pc Security Home Camera, 1080p 2.4G WiFi Smart Indoor Nanny IP Cam with Night Vision, 2-Way Audio, AI Human Detection, Phone App, Pet Cat Dog Cam - Works with Alexa and Google",
		"imageUrl": "https://m.media-amazon.com/images/I/61ySl2JZj3L._AC_SY355_.jpg",
		"price": "$89.99",
		"description": "About this item\n24/7 Full HD Recording - F/2.0 aperture, 112 wide-angle lens, 1080p/15fps to capture moments with clear picture. Features two-way audio to allow you to receive and transmit audio from any location with a WiFi connection. Enhanced Night Vision - 8 individual 940nm infrared LED's, which automatically turns on infrared (IR) in low light conditions, allowing you to see clearly in the dark. (power source required)\nOptional 24/7 Emergency Response Service - YI’s motion alerts and live video feeds are now equipped with the option to instantly involve Noonlight’s Certified Emergency Dispatchers, who coordinate with police, fire, and EMS agencies on customers’ behalf to ensure the situation is promptly handled\nUpgraded Smart AI Detections- YI cloud storage comes with the latest in Smart AI capabilities which are able to distinguish Person, Vehicle, or Animal accurately and reduce false alarms significantly. (Subscription Needed)\nYI Home App - Acess your camera with our mobile APP anytime and anywhere, more flexible with Home/Away mode. Allows sharing your camera with up to 5 family members or friends, and view multiple cameras on a single account. 9 live feeds on pc app are available now\nCloud Storage - Supports YI Cloud to avoid the risk of losing footage from a microSD memory card, and ensures all recorded video is safe, secure, and protected with the most efficient compression and highest protection of data",
		"totalReviewCount": "32,692 global ratings",
		"averageStarRating": "4.3/5",
		"reviews": [
			{
				"name": "Sav",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Great Wifi Camera!",
				"review": "Purchased when I went back to work after having my child. I had a friend come to my home to watch my child and it gave me such peace of mind to know I could pop in and check out what was going on. I do give it 4 stars because I wish you could remotely turn or adjust the camera and on two occasions it didn’t notify me of my baby waking up and moving around. But other than those two minor complaints they were overall great cameras. I purchased the 24/7 no Tirol gift package for one camera and I purchased the basic cloud package for the other (both camera were set up in my rom at night time and then I’ll be was moved to the kitchen during the day) and both packages had their perks! If you need the camera simply to monitor baby during naps and night time, the basic plan works great. The basic plan recorded a bit of video with motion or sound feed into in the settings and you could review those videos. If you would like to look back on a day or have the option to rewind to any given time frame (motion or not) then the 35/7 package is also a great option. My only co plaint about that is that there is no faster “fast forward” than 2x speed and ehen you are trying to review a whole work day of footage it is just not realization uless you have 4 hours to sit and review it."
			},
			{
				"name": "Flamingo",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Not 5g compatible.",
				"review": "Purchased in Mar 2022. Upgraded phone/internet to 5g. It does not work with 5g. Unable to reinstall. I also purchased a SD card thinking I would be able to store video and review on PC. It did not store it. Says I must have their Cloud. Maybe I did something wrong. Wish it worked with my upgraded WiFi. Had great quality pics."
			},
			{
				"name": "Bert",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " A pretty good camera for the money. My Pros and cons of a purchase.",
				"review": "Pros...I ordered one of these cameras and was impressed mainly bc it worked right out of the box, by following a pretty simple instruction booklet. It is for inside but will shoot through a window to outside if set on regular settings and the camera light is turned off. The IR and other lights reflect in the window but can be turned off. W an outside light on it works fine. In nice weather it can be shot through a screen pretty well. The app will let you flip the screen 180 degrees. Comes w a wall plug that goes in a usb hole on the receiving side. Pretty long cord.\nTilts up and down and the camera swivels 360 dergees. (manually.) Sturdy base that hasn't fallen over yet.\nThe night vision will only work inside your house, but it's clear black and white. For the price, Yi cameras seem to be a value. I would suggest a 64 GB sd card right off the bat so you don't have to use the cloud system. It fits in the rim of the black round piece behind. It comes w a piece of tape over the hole. This will definitely increase battery drain but not enormously, and you can remotely turn it on or off and see whats crack'in outside or inside. Pretty cool.\nThe motion detection has a slight lag and the 'person detected' will have to be on screen for a few seconds for it to kick in. It takes clear shots once it starts and doesn't cut right off. Keeps taping for awhile. Once motion/human is detected, you can go back and review the segment and take snap shots or small chunks of footage to store on your card. Some of these still shots will go right to a folder on your camera. Once the sd card fills and it rolls over, some stuff will be lost unless it's saved. I still haven't quite figured that all out. It's a process like evrything else. The instructions only are for set-up. Little on anything else. It works off a 2GB internet signal. If you don't have every high speeds it can drag down your other devices. Not sure how several cameras would do.\nNow the cons. UNFORTUNATELY the customer service is by email and buddy it can get tedious. And the return to credit card takes awfully long if you need to return them. Like 2 weeks if you use UPS. I hate to say bad things but, it's true. Maybe YI can learn from this? i don't know. It's absolutely true though. This is listed as a 3rd Party seller even though it's s Choice. Camera-wise I can see why it's a great bargain. it is. Just don't screw up your order, or the frustration levels will accrue.... Quickly. Heh heh.\nAnother draw back is the permissions on the app. Pretty steep. I suggest plugging this in and unplugging it so it doesn't sit and gather info all day, but, that's just me. I'd say to download the App from your store and not to use the convenient 'scan-to-app- from the booklet. Either way it's a third party app.\nToo bad these few things are apparent bc this camera could be a best seller I think. And still may be. As a buyer i think it was fair to say honestly what I think. REALLY to bad there wasn't a tech support phone number. The emails are endless and generally unsatisfying, if you are used to quick and responsive on point help. Just be ready if things go bad. If you do everything right, you may never have to deal w them anyway. I had a bad experience but the camera was nice, and I think it's fair to cover all the bases. It's not being malicious, it's just being honest. That's all.\nAnyhow,\nThat's what I think. I'd say buy one first and see how you like it. Best camera I've had for this so far."
			},
			{
				"name": "Dee",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " The company responded by email",
				"review": "After a year or two with these cameras now they removed the ability to record motion to your phone and want you to buy cloud time.\n\nUpdate\nThe company apologized for saying they no longer support 6 seconds clips on phone\nThe company asked me to update the app and the problem should be fix\n\nUpdate\nCamera is back to working properly the way it was at the begging after updating the app…."
			},
			{
				"name": "Alfonse",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Deceptive- not so much, but too little documentation",
				"review": "Easy setup, solid video, pretty good UI on the iPhone app… all good for the price.\n\nThough the camera has a sd card slot, app provides no way to use it. Support had videos(that are not straight forward to find) that explain functions that apparently don’t exist with this camera app. So it’s seems it’s cloud storage or nothing.\n\nDoc is weak. Sorry that I purchased them.\n\nUpdate - After I reached out to customer support, they explained that SD card 'turns on' SD card recording when the card is inserted... and it does and seems to work as advertised.\n\nSo I am going to give these a run and buy more if they work out. Note to YI, you designed a pretty neat product, but put a little more into your doc, you'll reduce your customer support burden (btw, which seemed pretty good)."
			},
			{
				"name": "Ronald E. Snow Stone",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great Cameras till they update the firmware",
				"review": "The cameras worked great till I got a message in the app to update the firmware on the cameras. Once the firmware updated, all the cameras quit working. I had just renewed my yearly monitoring and paid for it, waste of money."
			},
			{
				"name": "V. Martin",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Solid product at a reasonable rate",
				"review": "I use these cameras to keep an eye on my dogs, who have access to the yard and house all day thanks to a dog door. These cameras offer tremendous peace of mind when I can’t be with the dogs. Great, dependable product!"
			},
			{
				"name": "Saffron",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "2/5",
				"reviewTitle": " Kind of false advertising and scammy. Please Read before buying.",
				"review": "It’s really hard to rate this product because the product itself is really great for the price.\n\nThe issue with this product, is that it’s pointless if you don’t pay for the add-ons in the app. You have to pay yearly for it to save more then 0:06 of a video, even though I bought micro SD cards to go in them.\n\nThis is a package of two, so I set them up where they belong only to find out the cheapest option for one camera, and the next option is for FIVE cameras. Why would sell a package of two, if there is no yearly option in the app that includes two cameras?\n\nIt’s really unfair."
			},
			{
				"name": "Malek",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " We are not amused.... Lol. Well, maybe a little.",
				"review": "This is the \"kids\" version of what a home security camera should be. Everything kinda works, but only after a few tries and not as well as it should. Its like those \"night-vision goggles\" for children, that are really fake reading glasses with flashlights attached to the arms. Technically, they do what they advertise, but they don't do what they are leading you to believe they do.\n\nThe app I need to use with the cameras is peppered with ads (really? I mean, I did pay for the bleeping cameras). One of the ads looks like a function button so everyone will likely hit it at least once, thinking it does something. Some of the app security functions only work if you sign up for their cloud service; so the money you send them today is only for part of a product. You have to subscribe to get the rest.\n\nIf you sign up for the \"free 1 month trial\" for their back-up service then, you guessed it, they want your payment info and personal deets - so you just signed up for another monthly fee and gave someone else your online credit info. Cha-ching.\n\nI always have to refresh the camera in the application because the app never connects the first time and it is slow - even when I am at home. I never have network issues when I am video conferencing or streaming movies or games. This app is the only product that constantly has connection issues and I have tried it on 3 different devices - all having the same issues trying to connect the app to the cameras.\n\nI didn't sign on for their back up service, so I keep getting reminders to do so, which is annoying.\n\nThe picture is meh. Both of my cellphones produce better video and picture quality (so does my $40 GoPro knock-off, lol). Even on HD, faces are grainy at 10 feet distance from camera. I have not used the IR night vision so cannot comment on that, but it would boggle my little mind if that was the one thing about this product that wasn't problematic.\n\nI am not guarding the Crown Jewels, the Colonel's 7 herbs and spices, or the map to Shangri-La, so the basic dysfunctionality of these cameras is tolerable for my current purpose. If I ever need another security camera I will buy from another manufacturer and hope for better. I am not interested in remote access or back up, so those two disappointments don't actually affect me so far. What does annoy me is that after I buy a product the seller keeps trying to sell me more stuff through the product I already bought; even after misrepresenting the product they already sold me. That type of behavior does not deserve my support in any way."
			},
			{
				"name": "Vlad D.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Good Cameras, Pushy Upsell Tactics",
				"review": "I like the cameras a lot. The motion sensitivity is good enough to track my cats exits and returns, so I always know if all cats are somewhere home (or not). The picture is good, the night vision is good too.\n\nBut it all balanced out by the overly-pushy tactics the manufacturer uses to make you subscribe to their cloud option. :E\n\nThey show ads for it instead of video playback, which is annoying - you have to navigate back and them to the recordings list again to get rid of it. And they introduce artificial cool-down periods after each recording - a short period when the camera is not working - which supposedly disappear once you subscribe.\n\nThink of it - they intentionally DISABLE THE MAIN FUNCTION of the product to force you to subscribe to the cloud. I reckon it could be a basis for a lawsuit tho I'm too lazy to follow thru on that.\n\nSo... good hardware. Shady company."
			},
			{
				"name": "Maritza Marulanda",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Our cameras were hacked",
				"review": "One camera came broken, the others worked amazingly, until today! I was in my room working out, I had the phone on with the camera app with the living room camera on, it changed to my room, showing me what I was doing, they wrote. Note, when I tried to get off my treadmill to read the note, the app was turned off; I turned it on again, thinking it was my boyfriend and it happened again, I called him and asked him how he could control my view from his phone and he confirmed that it was not him and asked me to unplug the cameras and change the passwords, now I am scared to turn it on!..oh and I failed to mention that they were communicating with my toddler and he thought it was my boyfriend!!"
			},
			{
				"name": "Alex Brown",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Cameras are great. App and money grab not so much",
				"review": "I bought these to be able to check on the house when I’m not home. Easy to set up. Not too obvious. Work great with the app. You can turn the cameras/mics on/off with the app. Nice wide view. Pics are clear.\n\nI ended up putting two in my front window to see the front of the house. They’re inside, and with the IR turned off, I get great views through the glass with the cameras safe and warm. My doorbell crapped out and I wanted other family members to be able to see who was at the door before answering.\n\nThe app walks you through inviting up to five other users. Decide on their access options. Email them an invite. They download the app, create an account and - crickets. No access to my cameras.\n\nAfter a half hour’s search through the help line, sharing is only available through the paid subscription account. Gotcha!!\n\nSo I could use _my_ account on every one of our phones, but then, every time someone checks it out, it logs everyone else out of the app and I can’t log back in fast enough to see who’s out front.\n\nThe paid subscription (which includes cloud image storage) is under ten dollars a month. But I would have liked to know that before I bought the cameras and four 64gb memory cards."
			}
		]
	},
	{
		"category": "Jewelry",
		"id": "ucSMbv",
		"title": "PAVOI 14K Gold Plated Sterling Silver Post Thick Huggie Earrings - Small Round Hoop Earrings in Rose Gold, White Gold and Yellow Gold Plating",
		"imageUrl": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/617BwkFFg6L._AC_UX385_.jpg",
		"price": "$13.45",
		"description": "✦ CLASSIC LOOK, THICK HUGGIES ✦ These thick huggies are the perfect small monet hoop earrings crafted to be lightweight for easy all-day wear. Thick but lightweight, these fashionable earrings have a classic contour design that adds elegance. Pick more than one set in Rose Gold, White Gold and Yellow Gold.\n✦ PREMIUM QUALITY✦ 14K Gold Plated brilliant finish with a 925 Sterling Silver Post; Nickel and Lead-Free Hypoallergenic Fashion Earrings.\n✦ 90-DAY GUARANTEE ✦ Your happiness is our number one priority. To ensure your complete satisfaction, we offer a hassle-free 90-Day money-back guarantee. To get in touch, email or chat with us - a member of our team will be happy to help you.\n✦ SUSTAINABILITY ✦ We’re committed to protecting the planet. That’s why every piece of PAVOI jewelry is crafted with 100% recycled materials and we package in 99% recycled and compostable materials. We are proudly carbon-neutral and completely offset our plastic consumption by removing over 275,000 plastic bottles from our ocean annually. Learn more about our sustainability efforts here.\n✦ PROUDLY AMERICAN-OWNED ✦",
		"totalReviewCount": "2,609 global ratings",
		"averageStarRating": "4.5/5",
		"reviews": [
			{
				"name": "SuzB",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " So attractive and lightweight!",
				"review": "I love these earrings! During the pandemic I self quarantined and my piercings closed up almost all the way. So other earrings were not working, my ear was sensitive. These are Perfect, they are very lightweight and I forget I'm wearing them, and have sometimes slept in them. You won't regret this purchase."
			},
			{
				"name": "Samantha",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Obsessed!!!",
				"review": "I wasn't sure what to expect, but I'm IN LOVE with these hoops!! I wanted an every day type of earring, and I love that they come with comfortable backs so they're comfortable to sleep in. They're very nice quality as well. Highly recommend!"
			},
			{
				"name": "Sasha",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Review!",
				"review": "These earrings are nice & pretty but they were just a little too small for me, looked like baby doll earrings. I returned them."
			},
			{
				"name": "HSU",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Versatile Earrings",
				"review": "Bought these for my teenage daughter. I thought they would be too big for her face once they arrived, but they look pretty good. I will borrow them from her if need be:)"
			},
			{
				"name": "Emmy",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Look good…",
				"review": "I still have these little guys in the box. Just haven’t had a chance to break ‘em out yet. But they are pretty looking and lightweight. Gotta get hubby to take me out ! Lol"
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " My other daughter wanted a pair",
				"review": "Purchased these for my younger daughter for Christmas. My older daughter liked them so much that she bought herself a pair."
			},
			{
				"name": "Sthephanie A.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great jewelry at an affordable price.",
				"review": "The quality of the jewelry from this line is awesome. They won’t tarnish from 1-2 wear like most cheap jewelry pieces. These are super light weight & great for that day to day wear. I have several pieces from Pavoi & they have outlasted more expensive pieces I have from Ana Luisa 🫢"
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Amazing!!",
				"review": "These are great! They don’t look cheap and I have had them over a month and have yet to tarnish. No issues with allergies and the gold plate is good"
			},
			{
				"name": "Devika S",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " The gold is so lightly dipped that it looks tarnished",
				"review": "The colour will not come as gold. Here in the photo I have the silver on the left which I ordered previously and loved so I decided to get the gold (shown on the right) which came VERY dull and just looks tarnished. The hoop shown above is Pavoi hoop & I was really hoping it would be that colour. This product is misleading and a waste of money."
			},
			{
				"name": "GK",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Exactly as I expected",
				"review": "Love these hoops because it is a perfect size for. Having long hair larger hoops always gets tangled up with my hair. These ones just loops around my ears nicely. Worth it for the price spent. Would buy as gift for friends."
			},
			{
				"name": "Claire",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "2/5",
				"reviewTitle": " Pretty at first but very weak",
				"review": "These look nice but after one wear the posts are starting to bend. I imagine they'll snap off after a couple of wears- so be very gentle or don't buy these."
			},
			{
				"name": "CArol m.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Decent",
				"review": "I've ordered several items from Pavoi some good some not so good. These earrings are nice but be aware everything is much much smaller in person than in the photo."
			},
			{
				"name": "Isabella Rogers",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Not yellow gold",
				"review": "Very disappointed, but I guess you get what you pay for. The backings looked cheap and are difficult to take off and they are not yellow gold, more like white gold with a tinge to it. The earrings look like kids play jewellery."
			}
		]
	},
	{
		"category": "Jewelry",
		"id": "5jU7-G",
		"title": "Alex and Ani Divine Guides Women's Cross Jewelry Set, Matching Necklace and Bangle, Rafaelian Finish",
		"imageUrl": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/71vUqtCHHfL._AC_UX395_.jpg",
		"price": "$25.20",
		"description": "",
		"totalReviewCount": "4,825 global ratings",
		"averageStarRating": "4.7/5",
		"reviews": [
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Pretty",
				"review": "I purchased this bracelet for my mom and she loves it! It’s so pretty on alone and layered."
			},
			{
				"name": "Madison fleming",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " bracelet",
				"review": "It’s really cute and it’s adjustable. I would definitely recommend it as a gift for someone!"
			},
			{
				"name": "Mac McLean",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Not a set",
				"review": "Ordered the brackets/ necklace set, per description. Only received the bracket. Which is pretty nice. Would love to see the necklace..."
			},
			{
				"name": "Sheron Albritton",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Incomplete order",
				"review": "I ordered a bracelet and necklace, should’ve been a set. Only the bracelet was delivered. I would like to get the other piece of the set. If I cannot get it, I would like a full refund of the purchase price."
			},
			{
				"name": "Amy",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Love it",
				"review": "Love it"
			},
			{
				"name": "Heather",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Cute!!",
				"review": "I love this brand! The bracelet is super cute, I wish it was a little more “shiny” but it does match the picture.😀"
			},
			{
				"name": "DFoster",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Nice Christmas Gift",
				"review": "My daughter collects Alex & Ani bracelets. She love this one to add to her collection."
			},
			{
				"name": "BOB",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Bracelet",
				"review": "Beautiful. I gave it as a gift. My friend loved it."
			},
			{
				"name": "Alicia",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " It's okay",
				"review": "Bought for my mum for a Christmas gift, the bracelet was not shiny at all, she wanted me to return it because it's not shiny. Nothing bad with the quality or anything. Also, it does not come in an Alex N Ani box, just came in a black box."
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Simple. Beautiful",
				"review": "This is perfect. Christmas present. I love it so much. It's so pretty, but simple and the adjustable part is very nice."
			},
			{
				"name": "Pawel P.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Lovely",
				"review": "Great Product. Quick Deliver!!!"
			},
			{
				"name": "Madelyn Prendergast",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " It is well made",
				"review": "It arrived early it was what I expected very nice and well made I will be ordering another one."
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Cheap quality and misleading",
				"review": "Very disappointed. Bought this expendable necklace as a gift for my elderly mother who cannot tie a necklace on her own. The chain is VERY thin and does not expend. The chain is so thin we worry it will break. DO NOT BUY THIS."
			}
		]
	},
	{
		"category": "Jewelry",
		"id": "SyiKrB",
		"title": " Collection 18K Yellow Gold or 14K Rose Gold Over Sterling Silver Bar Drop Earrings",
		"imageUrl": "https://m.media-amazon.com/images/I/21hsHbAs2mL._AC_UY445_.jpg",
		"price": "$19.00",
		"description": "Product Details\nOrigin\nImported\nCountry of Origin\nChina\nAbout this Item\nDangle earrings featuring vertical bar drops in high polished sterling silver\nPerfect jewelry gift to expand a woman's fashion wardrobe with a modern, on trend style\nTrendy, fashion forward design\nSecure leverback closure\nHand-crafted in pure .925 Sterling Silver; Rhodium plating added to enhance shine and durability",
		"totalReviewCount": "7,024 global ratings",
		"averageStarRating": "4.6/5",
		"reviews": [
			{
				"name": "Darlene N.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Elegant, stylish and light weight",
				"review": "Love the style. I can dress them up or down and wear them every day. So light weight you don’t know you have them on. Love them so much I bought them in gold."
			},
			{
				"name": "April H.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great earrings!",
				"review": "I was looking for earrings I could leave in and forget - I've now worn these earrings for over a month straight without removing them and they have been 100% comfortable for all things, including sleep. I have super long fine hair and they have not gotten tangled in it once (surprisingly as most things do). They are not heavy at all, the silver bar is hollow (which you can't tell while wearing, but trust me you want that, less weight). They are great quality and I've had no tarnishing or irritation whatsoever. Highly recommend!"
			},
			{
				"name": "rosemary Ferdinand",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful 😍",
				"review": " I LOVE these they are beautiful. I have tried every sterling silver earrings and they get very dark but these pass the test. I have shower with them, washed my hair while wearing them and the color stays the same. If someone needs an every day pair of earrings please get those you will not want to get them off because its comfortable and beautiful."
			},
			{
				"name": "Aki and Kiki's mom",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Very pretty",
				"review": "They are pretty, but I returned them as they were not what I was looking for as to the design."
			},
			{
				"name": "Marcia Clahar",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Small",
				"review": "I thought it would be a lot larger very small."
			},
			{
				"name": "chandiego",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful, high quality earrings",
				"review": "These earrings are simple, understated, and beautiful. High quality silver, not too heavy and not too light. A great price too! If you like the look, do t hesitate to purchase. They are definitely a good value."
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " I recommend :) !!",
				"review": "This is the first time i’ve bought earrings online! i had my ears pierced 2 year ago at icing with a piercing gun, to be honest i still feel like they’re not healed completely, so i’m pretty specific with the earrings i wear and buy. i generally only wear surgical steel / sterling silver because my ears are sensitive and do not get irritated by these materials!! i bought these earrings on friday and they arrived the next day. they arrived in a weird bag (as shown in my picture),but the earrings themselves were clean! i sterilized both of the earrings with an alcohol pad and put them on! i read some pretty good reviews about the earrings, hence why i bought them, so i wanted to try them and write a review myself! i spent a few hours in them, showered, and went to bed with them in! i’ve now spent all day wearing them and i honestly have no complaints! the clasp is strong and i like the circle shape because it hasn’t pulled my hair so far! the earrings have not irritated my sensitive ears, they’re a little heavier than my normal studs but the weight is pretty lightweight, they haven’t tarnished, and they were comfortable to sleep and spend my day in! these earrings are advertised to reach about halfway on your neck, however some other reviews said they did not reach that far. as seen in a few of my pictures, these earrings reach just a little below my jaw and they are about 2 inches! i truly have no complaints with these earrings and i recommend these to others with sensitive ears!"
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " It get here on time",
				"review": "Like"
			}
		]
	},
	{
		"category": "Jewelry",
		"id": "4mVEbZ",
		"title": "Betsey Johnson Flower Rectangle Stone Drop Earrings",
		"imageUrl": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/71qlbLY8jNL._AC_UY395_.jpg",
		"price": "$13.50",
		"description": "Product Details\nMaterial\nMetal, Stone\nAbout this Item\nDrop earrings featuring iridescent rectangle-shaped stone embellished with flower and mixed stone cluster. Earrings are set in rose gold-tone metal with a fish hook closure.\nRose gold-tone metal with glass and epoxy\nLength: 1.75\"\nWidth: 0.75\"\nFish hook closure\nImported\nDescription\n\nBetsey Johnson drop earrings featuring iridescent rectangle-shaped stone embellished with flower and mixed stone cluster. Earrings are set in rose gold-tone metal with a fish hook closure.\n\nSee more\nAbout this Item",
		"totalReviewCount": "2,838 global ratings",
		"averageStarRating": "4.6/5",
		"reviews": [
			{
				"name": "Brenna",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " So cute!",
				"review": "I love everything betsey Johnson so these earrings are absolutely perfect. I get so many compliments when I wear them and they aren’t too heavy on my ears . They aren’t the lightest but that’s to be expected with the design . Love them!"
			},
			{
				"name": "Kalyn Hanixman",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Cute dangly earrings, but a bit heavy",
				"review": "I got these to wear with a specific dress of mine and I've really enjoyed them the few times I've worn them. The first time I wore it for about 2 and a half hours and it was fine. The second time I wore them for about 5 hours and at the end of 5 hours they started to hurt my ears a little bit.\n\nMy hair is also long and if I wear it down, my hair tends to get caught around the flowers, but it wasn't a big enough struggle or annoyance to effect my score much."
			},
			{
				"name": "Victoria Blair",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Gorgeous and Perfect!",
				"review": "These were the perfect finishing touch to go with my dress for my son's wedding. So beautiful and I received lots of compliments on them! The only thing is, I wish they came delivered inside a small padded box because while they arrived quickly, (greatly appreciated!) they were delivered inside a big padded  envelope inside a small plastic bag and a scant piece of bubble wrap. If you look at the picture of them on the card, you can see a small dent on one earring, but I chose not to return them because I figured the dent wouldn't be noticeable while wearing them and I didn't want to get another pair in worse shape than these. I'm glad the flowers are metal and not made out of clay or resin. Otherwise, I would be concerned about them chipping. But all in all, I love Betsey Johnson's eye for the quirky and unusual! I will gladly be able to wear these earrings again!"
			},
			{
				"name": "janh",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " They go with everything.",
				"review": "The irridescent stone shines just a bit of every color. The pices are fairly large without being gaudy.\nThey are actually sweet and sexy at the same time."
			},
			{
				"name": "shayla slva",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Beautiful earrings",
				"review": "Love these earrings, beautiful color and style. Matches with most outfits, perfect for a evening out"
			},
			{
				"name": "Kathleen Hall",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Betsy Johnson earrings",
				"review": "They were smaller than expected but price was right!"
			},
			{
				"name": "Kathy Creath",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " So many compliments",
				"review": "So beautiful. Picks up whatever color you wear"
			},
			{
				"name": "Patricia Cox",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Beautiful",
				"review": "I have other Betsy Johnson pieces and they are very unique"
			}
		]
	}
]
