[{"id":"u0Lhhi","title":"14KWhite Gold Plated Initial Heart String Bracelets for Women Men Teen Girls Boys Handmade Rope Braided Bracelet Minimalist Jewelry Matching Couple Bracelets","imageUrl":"https://m.media-amazon.com/images/I/51zd5YlseSL._AC_UX385_.jpg","price":"$0.95","description":"Product Details\nOrigin\nImported\nAbout this Item\nThe Bracelet Is The Perfect Gift For Your Family, Lover And Friends. Perfect For The Beach, Pool, Surfing Or Any Other Occasion In Summer, It's Sure To Give You Compliments\nThis 26 Heart Initial Can Represent Your Name, But It Can Also Represent Your Lover And Family. Anklet Is Still The Highlight Of Clothing Collocation.\nThe Meaning Our Dainty Name Bracelet To Represent You Or Your Loved Ones.\nBest Gift Our Delicate Gold Initial Bracelet Is Packed With Love. It's A Perfect Gift For Your Kids, Child, Best Friend, Daughter, Wife, Mom, Men, Husband, Boys, Brother, And Even Grandmas Love Them Too. The Letter Bracelet Is Lightweight And Comfortable To Wear.\nGreat Gift For Birthday, Wedding Anniversary, Valentine's Day, Christmas, Mother's Day And Other Holidays\nDescription\n\n14KWhite Gold Plated Initial Heart String Bracelets for Women Men Teen Girls Boys Handmade Rope Braided Bracelet Minimalist Jewelry Matching Couple Bracelets\nBeautiful 26 letter bracelets are perfect for matching belly dance outfits\nThe bracelet is the perfect gift for your family, lover and friends. Perfect for the beach, pool, surfing or any other occasion in summer, it's sure to give you compliments\nMaterial: copper\nThe bracelet accessories are made of copper and Braided rope, the surface is electroplated, and the color: vintage letter bracelet, durable and durable, very beautiful and shiny\nChain length Size: 30cm (adjustable Length is 8-15cm）\nThis can represent your name, but it can also represent your lover and family. Bracelet is still the highlight of clothing collocation.\nColor:\nwhat you get: 1 × bracelet\n\nSee more\nAbout this Item","totalReviewCount":"9 global ratings","averageStarRating":"4.3/5","reviews":[]},{"id":"dz9Sbd","title":"ManRiver 26 Letters Rings for Women - Diamond Rhinestone Studded Zirconia Open Adjustable Rings Jewelry Accessory Gifts","imageUrl":"https://m.media-amazon.com/images/I/51NZqK1YW+L._AC_UX385_.jpg","price":"$6.80","description":"WELCOME To ManRiver Online Store ! women rings ring gold silver wedding sterling silicone engagement nose diamond women's toe steel rose stackable band men stainless 14k jewelry knuckle thin vintage birthstone finger clearance anxiety ring sterling silver ring spinner bead ring Selling point: Simple and stylish High quality metal Inlaid rhinestones make you more outstanding Suitable as a gift for mom, girlfriend and good friends Suitable for all occasions. Like weddings, parties description: Size: adjustable Material: Alloy Color: golden Attention. The product is open style, can be adjusted by yourself, the product picture is a kind of effect There is no fixed inner diameter for openings like this. When you break it, try not to break the joint, although it is not so easy to break, but that is the most vulnerable place. contain: 1 x ring","totalReviewCount":"953 global ratings","averageStarRating":"3.4/5","reviews":[{"name":"Alaisha.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" you get what you pay for!","review":"i liked this product except for the fact that i had to wait a month or two for it to arrive. and when it did arrive it came in good condition. but as for it being a gold ring that is not actually gold, i had to put nail polish in the inside of it where my finger would go. to prevent my finger from turning as we know, “green.” i never really got to enjoy it as much as i would like to because the same day it arrived was the same day i miss placed it. and never seen it again. that was my fault, but overall it was a nice TEMPORARY item!"},{"name":"Izanable","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Everything came in good packing but one my ring’s snapped while adjusting it on my finger","review":"It snapped easily"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" A good value","review":"Great gift for my girlfriends."},{"name":"Kayde Lee","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Pretty but broke in a week.","review":"Loved it and wore it for about a week and then randomly felt something lose on my finger and it broke in half"},{"name":"Diane platte","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Gift","review":"This was a gift and it was liked very much."},{"name":"zella green","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Good buy","review":"The stone fell out the first out the first time I wore it"},{"name":"Ruth Hessaa","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" This fell apart the K came off not worth the money","review":"The K fell off when my daughter wore it"},{"name":"Yessica","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Y","review":"Muy bonito y cómo es abierto emboba muy bien al dedo y buena calidad para el precio lave trastes y no se puso feo !!"}]},{"id":"KfoaNv","title":"MAIBAOTA 10 Pcs Crystal Necklace Healing Amethyst Crystals Carnelian Chakra Necklaces Evil Eye Necklace Vintage Hippie Wiccan Boho Rose Quartz Obsidian Moon Sun Jewelry Heart Gemstone Aventurine Turquoise Pendant for Women Wholesale","imageUrl":"https://m.media-amazon.com/images/I/71aynpoPjkL._AC_UX385_.jpg","price":"$16.99","description":"Product description","totalReviewCount":"1,052 global ratings","averageStarRating":"4.5/5","reviews":[{"name":"Iyonna pearce","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Crystals","review":"I love these necklaces. It turned pretty easy. And it broke a lot but if ur careful and match them well these necklaces can take u a long way. I love them. And I wear mine to this day. My black necklace broke faster but it’s okay I had another one. And I gifted my roommate and my boyfriend one of these necklaces and they love them."},{"name":"Kathy","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Nothing broke, came in a good package with a thank you card","review":"Very high quality packaging, the neckolace quality is something you would get from 5 below, crystals obviously aren’t real, the heart one is about the size of a penny, they give you the string so you can attach each one and choose what string. Received on time"},{"name":"Ace","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great for the price","review":"I put this on my wishlist and got it for Christmas and they are BEAUTIFUL. I wear them almost every day and they are great to accessorize with. They are such great quality for your money and I highly recommend buying them."},{"name":"dara","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great gift","review":"All of the crystals were very nice the necklaces I had to kind of just tighten a little bit at no big deal"},{"name":"Artie Hall","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Absolutely love","review":"Got a day early. I don’t have a photo of all the necklaces but I’m wearing this one rn :0 love these. Great quality especially for price"},{"name":"lori c.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" The stones are very nice!","review":"The stones themselves were surprisingly beautiful and nice quality. I can’t really speak on the chains that are included, as it’s a gift that has t been used yet. Even if the chains aren’t great, the stones are well worth the cost."},{"name":"Amanda","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great gift","review":"I bought this set for Christmas and split them up between a few girls as a little extra gift to go with their main gifts. Great quality and everyone was happy with them."},{"name":"linda hively","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" They are very beautiful and I gave them as a gift.","review":"My daughter loves all of the pieces and she even shares with me."},{"name":"LESLI CHRISTIE","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" A gift for your heart ♥️","review":"I’ve just come back from the post office.\nI went outside in the fresh air and sat underneath my Tree. (I wanted to charge my crystals in todays sunlight.) I sat down on the crunchy fall leaves, smiled, breathed deeply, and opened the beautiful red box. Inside was a Heartfelt note to me. It felt personal and I smiled as I read it. I then flipped the card over and read it again. These are Very pretty talisman 😍(in my opinion) and I love the care put into the packaging. Thank you so much! What a bargain for the joy it brings."},{"name":"KFjeld","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Very nice!","review":"I love this product, would have given a 5star, only one thing missing. A description of each crystal and the healing power behind them would be great for people who are new to Crystals"},{"name":"Linda Vespera","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Beautiful","review":"I buy this stuff all the time and this id one of the most beautiful sets ever! You simply cannot beat the price!! I absolutely love it and will buying this as gifts in the future!!!!"},{"name":"Monica Frigon","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" beautiful","review":"well made, only one is fake. (the white one)"},{"name":"Krystal B.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" I'm not sure?","review":"I'm pretty sure these pendants are all glass? Although very pretty. The cable chains aren't very secure. The first one I put on broke and fell off somewhere? Now I'm scared to wear any of the others."}]},{"id":"PHRUsM","title":"36 Pairs Gold Earrings Set for Women Girls, Fashion Pearl Chain Link Stud Drop Dangle Earrings Multipack Statement Earring Packs, Hypoallergenic Earrings for Birthday Party Christmas Jewelry Gift","imageUrl":"https://m.media-amazon.com/images/I/81ho8aIItXL._AC_UX425_.jpg","price":"$17.99","description":"","totalReviewCount":"1,716 global ratings","averageStarRating":"4.4/5","reviews":[{"name":"Doni","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Good variety","review":"Great purchase for the variety. Quality to be expected with the price but you get some great pairs. This pack would also be good for those with double piercings !"},{"name":"Ivy","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect fashion jewelry","review":"Love the styles. Doesn't feel cheap. Good value for amount you get. I wasn't expecting much because of how cheap they were but I'm more than pleasantly surprised. We'll just have to wait and see how they do over time."},{"name":"Isandrina","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Muy nice","review":"Me gustaron los aretes."},{"name":"Elizabeth OBrien","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" THE BEST EARRINGS!","review":"I love love love these! Such cute styles and SO many options! Love that it comes with extra backs as well. The only downside is they don’t stay gold if you wear them often but what can you expect for the price point."},{"name":"Gheeti Nusrati","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" LOVe these","review":"I LOVE these earring sets!! They’re so cute and great for sensitive ears! The packaging and hand written note were a great touch!!!"},{"name":"Stephanie","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Heck of a deal!","review":"Lots of pretty earrings for a fraction of the price! Would buy again"},{"name":"Antwine jordan","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" GET THEM","review":"Love these earrings I paid 12$ for 36 pairs in love with all of them! Obviously fake but they are so cute ! 10/10🥰"},{"name":"Vallan Marie Lewis","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Super Cute","review":"They’re super cute but they fade fast so clear polish them"},{"name":"Jeremy Gaylor","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Exactly what you pay for!","review":"I was sooo unsure about purchasing these because it seemed unbelievably cheap for the amount of earrings you get, but, I Absolutely love every pair! Amazing deal if you’re looking for a variety of fake/cheaper gold earrings for a good price!! also came in a cute bag with this sweet hand written note :) really really happy! Thank you!"}]},{"id":"EbbWtn","title":"Dainty Layered Initial Necklaces for Women, 14K Gold Plated Paperclip Chain Necklace Simple Cute Hexagon Letter Pendant Initial Choker Necklace Gold Layered Necklaces for Women","imageUrl":"https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/513jmV-V1aL._AC_UX385_.jpg","price":"$14.99","description":"About this Item\nSIZE: Size of the gold paperclip chain initial necklaces is 18\"+2\" extension, and the layering paperclip chain necklace is 14\"+2\" extension, perfect dainty layered necklaces initial necklaces for women girls wear.\nMATERIAL: Made of high quality brass material, 14K real gold plated, nickel free and lead free, no harm to skin.\nLAYERING INITIAL NECKLACES: Gold layered paperclip chain letter initial necklaces set with hexagon charm, engraved with initial and heart in back and front, large initial pendant dainty necklaces for women teen girls jewelry.\nPERFECT GIFTS: Comes with an elegant free gift necklace box, perfect gifts jewelry for women girls teen girls wear....\nAFTER SALE SERVICE: 180 Days after sales service and exchange, reply you within 24 hours to solve your problem.\nSee more\nAbout this Item","totalReviewCount":"35,787 global ratings","averageStarRating":"4.6/5","reviews":[{"name":"Peyton","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Gorgeous","review":"Rose gold is probably my favorite thing in the entire world. So when I saw this, I knew I needed to have it. I’ve worn it 24 seven for about two weeks now and it has not turned my skin green or faded in color at all. I’ve even worn it in the shower, and it is still fine. I wouldn’t recommend showering with it, but I’m just saying that I do and the necklaces haven’t been affected. I have received many compliments on it, and was very satisfied with my purchase."},{"name":"Hillary","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" AMAZING AMAZING AMAZING!!","review":"I had actually ordered from this company before and got the gold initial bracelet (which is also very amazing). The quality of this necklace is unbelievable. It feels so expensive and looks amazing. I have worn the necklaces of course together as well as separate and I absolutely love it! It comes so nicely packaged. Hands down 10/10 recommend! It is so so so nice! Does not look cheap at all, does not feel cheap, nothing about it says cheap. So if you are giving it as a gift, it comes in a cute little black box and then each necklace is in its own back and then those bags are places in another bag. A small shinning cloth is in the box as well. It's incredibly nice. Love this company!"},{"name":"Brianna","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Good for price","review":"I’m very skeptical buying stuff off  especially jewelry and clothes. The color is very yellow gold and the material feels cheap almost like plastic. However for the price I love it. It adds a lot to a lot and I would recommend.\nI also got sent the wrong letter and this company sent me the right one immediately."},{"name":"Lacey","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Durable, but looks nice","review":"I have gotten soooo many compliments on my necklace. People were asking me where I got my necklace because they had paid a lot of money for theirs and theirs broke within the same day/week. I have a 9 month old boy who pulls on my necklace multiple times a day, and still staying strong with no issues. I love it and it is such little cost for this! And it looks so nice!"},{"name":"nicolle clark","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect","review":"I bought this to wear to a wedding and have worn it everyday since the wedding. I get compliments on it all the time. I shower with it on and it has not changed or tarnished. Amazing for the price. Love wearing the smaller chain by itself too."},{"name":"EiMadeULook","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Trendy","review":"The gold is deceiving - looks a tiny bit more rose gold than other gold necklaces I have, which makes it hard to mix and match with other necklaces. I do like that they are separate necklaces and not attached."},{"name":"Laura young","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Cute necklaces","review":"I will say these necklaces are very cute! However, if you have sensitive skin, they may not be for you. I do not like taking necklaces on and off again, and this necklace tends to leave me with rashes because of it. Otherwise, good quality necklaces."},{"name":"Taylor C","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Doesn’t rust","review":"I’ve had this necklace for a while. It’s great for Layering and it hasn’t rusted yet hoping it never rust would buy another if I lost it"},{"name":"Anita Bock","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Lovely","review":"Love this necklace set, seems to be lasting well without discolouring so far"},{"name":"Shirley Heng","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Good quality Jewelry. Value for the the spend.","review":"As advertised. Looks like the pic provided. Good quality and came nicely packed. Will be great as gift. A lot of details put into this precious handmade Jewelry."},{"name":"Anonymous","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Amazing quality, I’ve had so many compliments!","review":"I love love love these necklaces!"},{"name":"Molly","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Beautiful necklace","review":"So lovely, great quality.\nWorth the money have bought more necklace's from this collection."}]},{"id":"jyH7kb","title":"fxmimior Dainty Boho Gold Silver Chain Bracelets Set for Women Adjustable Fashion Beaded Chunky Flat Cable Chain Punk Bracelets Jewelry for Women Girls Gift Set of 4 (Silver)","imageUrl":"https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/61uBt8606zL._SY355_.jpg","price":"$8.60","description":"","totalReviewCount":"994 global ratings","averageStarRating":"3.9/5","reviews":[{"name":"Sam","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Cute","review":"Cute👍"},{"name":"elizabeth","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Good gift idea !!","review":"I am satisfied w/ the quay for the cost of the gift !!"},{"name":"Gary runion","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Worth the money","review":"Very pretty"},{"name":"alicia","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" No like","review":"El tamaño es pequeño, la calidad no es muy buena ."},{"name":"Barbk65","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Very cute!","review":"Very cute on, but very hard to get in and off. Wish there was an easier way!"},{"name":"JDizzle1001","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" I'm in love","review":"Very light weight and stylish. Also came with long extenders. Not exactly what I expected but it'll work!"},{"name":"Maria Lisa","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Boho Bracelets","review":"I ordered in silver and I just wasn't thrilled...gold probably looks much better. One bracelet was missing. Had to return as I don't wear gold."},{"name":"doccom","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" Looks cheap","review":"This is the first article of jewelry that I've bought from  that I don't like"}]},{"id":"9zwMo2","title":"Tasiso Dainty Pearl Necklace for Women Tiny Pearl Pendant Necklaces Half Pearl Paperclip Toggle Necklace Barque Pearl Pendant Necklaces Pearl Chain Choker Necklace Simple Bridesmaid Jewelry Gifts","imageUrl":"https://m.media-amazon.com/images/I/516G6GQmv-L._AC_UX385_.jpg","price":"$13.99","description":"","totalReviewCount":"150 global ratings","averageStarRating":"4.5/5","reviews":[{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect for \"Coastal Grandma\"","review":"Wore this in Hilton Head SC and felt super cute! Lasted after sea, salt, sunscreen, and pool time!"},{"name":"Bastet","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great gift for ladies with style","review":"I have this as a Christmas gift to two women who are hard to shop for and they were delighted with the pearl necklace."},{"name":"Haley Johnson","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Exactly as expected!","review":"I love pearls and wanted to incorporate them into my engagement photos. It worked out! This necklace is dainty and didn’t take away anything from me or the outcome of the images. Will certainly be wearing it again!"},{"name":"Priscila Rodriguez","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Beautiful","review":"My sister bought me this for my graduation and it one of my favorite necklaces I absolutely love it"},{"name":"Victoria","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Super cute!","review":"It’s super cute and just the right length. The only thing I would change would be the size of the pearls, they just seem a little on the larger side."},{"name":"kelsey","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" So cute","review":"I bought this for my boyfriend, and he absolutely loves it. It’s definitely masculine enough for him to wear, but I could also wear it too. The quality is high and comes exactly as pictured."},{"name":"W. M.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Sweet gift","review":"Perfect for young girls; sweet gift for June birthdays"},{"name":"Lady Diane","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very Kate Middleton, Princess of Wales (early days)","review":"I love this immalist satellite necklace. It is light weight. You can wear to the office, job interview, special event, or just every day. Also, a great starter piece to layer other necklaces with. This necklace reminds me of the Tiffany bracelet Kate Middleton, Princess of Wales use to where in her early days as a royal. She is my fashion icon ( I am a fan of the other royal women's fashion as well.). Reasonably price. It arrived in a short amount of time. It would make a great gift. I would recommend this vendor."},{"name":"Eva","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Muy lindo","review":"Se ve muy bonito. Espero que la cadena no se haga fea con el uso. Recién lo compré."}]},{"id":"TjpHT7","title":"HELPFLOWER CH Handmade Fairy Simulation Butterfly Wing Earrings Foil Rhinestone Earring Romantic Jewelry","imageUrl":"https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/61mmIJXwl4L._AC_UX385_.jpg","price":"$6.89","description":"About this Item\nMaterial:plastic. If you have anything, Please contact HELPFLOWER Brand ,We will help you resolve problem within 24 hours\nSize:Length and width about 7.5 * 2cm, error about 0.5cm.\nBest present:Gift for Friends, Girlfriend, Bride, Bridesmaids, Lady & Wife etc.\nOccassions: It brings an elegant and graceful look to any special occasion or for daily wear.\nPackage:1 pair.","totalReviewCount":"457 global ratings","averageStarRating":"4.3/5","reviews":[{"name":"Momma3","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Cute","review":"I can’t give it 5 stars because one was broken I think it will be an easy fix but this should have been checked prior to shipping and was not damaged in transport it was packaged well. It is cute though"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Prettier in person","review":"These are just lovely in person! I will be looking to get other colors in the future!"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Excited but sad","review":"Very excited to get these. They’re gorgeous, but showed up broken. I will be keeping them and just supergluing the broken part on. Other than that, I love them"},{"name":"Destiny","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Not quite what I expected","review":"The pictures make them look more delicate and vibrant. They are cheap and plastic. They served their purpose but not what I was expecting."},{"name":"Nayeli","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" fragile","review":"These earrings are sooo pretty but very cheap/fragile. Mines fell on the floor and it broke so therefore be very gentle with them!"},{"name":"Lennys Mom","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Not sure of durability but….","review":"These earrings are adorable! I am a bit wary of the fragility but they are so gorgeous!"},{"name":"Alea Laughery","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Just what I was looking for","review":"These feel chunky, but they are really light. I dressed as the Ant Queen from Bug’s Life and wanted wing earrings to represent her wings. These were perfect. Just haven’t found other things to wear them with in my day to day life, so that’s the only negative."},{"name":"Emma Gold","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Magical!","review":"I already liked them when I saw them on the website. But when I got them in person I was about to cry (happy tears). They are so lightweight, carefully designed with detailed rhinestones and glitter and they look elegant. I bought them to wear to a fantasy-themed event. But, to be honest, I’ll wear them with jeans and a cute top as well! :)"}]},{"id":"aIEzI3","title":"MONOZO Gold Initial Bracelets for Women, Dainty 14K Gold Filled Layered Beaded Letter Initial Bracelet Personalized 26 Alphabet Disc Monogram Charm Bracelet Jewelry Gifts for Girls","imageUrl":"https://m.media-amazon.com/images/I/71errqQgxyL._AC_UY395_.jpg","price":"$14.99","description":"Product description","totalReviewCount":"1,652 global ratings","averageStarRating":"4.5/5","reviews":[{"name":"Sharon","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Bracelet is so cute","review":"This bracelet is soooo cute! I got this for myself with my boyfriends initial on it and I love it! Definitely my style I just wish it didn’t move around a lot even when you put it to the tightest setting and I wish the bracelet was just one big piece instead of two separate bracelets because then it kinda tangles. But it’s prefect!"},{"name":"Limor","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Nice gift , very gentle and cute","review":"I liked the gentleness, came with a nice box and a cute card."},{"name":"karen","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Sweet!","review":"Delicate and classy. Adjustable too!"},{"name":"Larry Woods","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" My daughters loved them","review":"My daughters loved them, they both said they would cherish them forever."},{"name":"g","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Pretty","review":"The packaging was very well done and the bracelets came out better than I thought they would !"},{"name":"Nana","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very pretty","review":"This is a present for my granddaughter it’s very pretty I know she’ll like it."},{"name":"Reader lmf","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Cute and inexpensive","review":"For a jr high (or younger) girl, really cute. Nice small gift for Christmas. Will it last forever? No. Would an older girl or woman wear it? probably not."},{"name":"Robert & Debbie Chatman","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" So cute","review":"Dainty and so cute. Love these little gold bracelets. Perfect gift for ladies of all ages."}]},{"id":"fvzITq","title":"Sither 13 Pcs Women Rings Set Knuckle Rings Gold Bohemian Rings for Girls Vintage Gem Crystal Rings Joint Knot Ring Sets for Teens Party Daily Fesvital Jewelry Gift(style3)","imageUrl":"https://m.media-amazon.com/images/I/41UILzPeHGL._AC_UX466_.jpg","price":"$8.98","description":"About this Item\n✔ 【 Stacking Rings 】 With 13 different styles of rings,you can have 13 rings and wear them together or individually\n✔ 【 Approximate size 】 1.7cm/1.8cm/1.9cm/2cm/2.1cm,Suitable for most women and girls\n✔ 【 Good Quality 】 The strong alloy makes the jewelry difficult to break and fall off\n✔ 【 Find a Gift 】 Perfect Gift for women,girls,teens,daughter,girlfriend,wife,friends yourself on Halloween,Birthday,Christmas,Valentine's Day,Graduation,Easter,Anniversary etc\n✔ 【 Discover More Jewelry 】 Search or Click our catalog to surf our entire catalog listing on  for additional great Rings and False Nails","totalReviewCount":"6,855 global ratings","averageStarRating":"3.9/5","reviews":[{"name":"Nancy Simon","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" For 9 year old, ok for that use","review":"Purchased for 9 year old and they were fine for that purpose."},{"name":"Sarah Calis","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Really cute","review":"Nice for accessorizing with outfits and very comfortable"},{"name":"†Xiliar®†","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Bought as a secret Santa gift","review":"I'm assuming she likes them, no bad report back to me. 🥰"},{"name":"Nevaeh Adams","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" their a little small","review":"I like them but most have to go on my small fingures"},{"name":"Jada W","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Fashionable","review":"They are very fashionable and the shipping was quick."},{"name":"Kayleigh cummings","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Diffrent sizes","review":"So cute rings for each finger there"},{"name":"Patricia B.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Christmas Gift!","review":"My daughter loved them and they fit her perfectly!"},{"name":"Cindy L. Hutchens","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" They all fit perfectly. Thank you!","review":"Christmas gift for daughter."},{"name":"Kaila Urban","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Cheap","review":"Turned my fingers green."},{"name":"Joel","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Nice rings. Shipping was fast","review":"They are nice rings. Seems to be good quality. Haven't worn them so not sure if they will turn my fingers green. The only problem is they are alot smaller in size.Wont be able to wear all of them.."},{"name":"case","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" great","review":"for the price they are totally worth it"},{"name":"Felix","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" Only 12 rings","review":"Package only came with 12 rings and didnt have the sideway diamond one. But overall the rings are quite nice."},{"name":"Guinevere wiebe","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" I love them!!","review":"They go perfect with almost every outfit! Their just the right accessory. They haven’t turned my fingers green yet either! I wish you could order different ring sizes though, as my fingers are small and most of the rings fall off!"}]},{"id":"EGCaRi","title":"PAVOI 14K Gold Plated Crystal Birthstone Bar Necklace | Dainty Necklace | Gold Necklaces for Women |","imageUrl":"https://m.media-amazon.com/images/I/51QZVt8RWoL._AC_UX385_.jpg","price":"$13.95","description":"","totalReviewCount":"2,568 global ratings","averageStarRating":"4.5/5","reviews":[{"name":"Alazae","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very surprised!","review":"This is a really good necklace. I’ve had it for on for a good while and there is no green around my neck what so ever and I have forgotten to take off at time and I have it on with me in the shower sometimes. It’s very durable and Is very classy and simple. I most definitely will be buying my mom and sister one for Christmas."},{"name":"Cheryl DiAntonio","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Delivered on time for Christmas","review":"Gift for my niece. She loved it!"},{"name":"Carolina Mead","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Cute thing","review":"Very cute!!! I loved it."},{"name":"maggie13","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great so far!","review":"I bought this to replace my “through thick and thin” friendship necklace from another brand because the finish was worn on the other necklace. The price of this necklace was great, and it seems to be of good quality so far!"},{"name":"PR","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect dainty necklace","review":"I refuse to hop on the initial letter necklace train. This is perfect, can wear it with anything. Very dainty and simple. Could easily wear with other necklaces. Seems like great quality for the price! Easily a personable giftable gift for someone. I love it."},{"name":"Chrissy C","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Nice quality","review":"This would make a great gift for a young girl. It's cute and dainty. The gold is a beautiful color and looks real. Very well made. My only complaint is that it is too light weight for me. If you are on the thinner side then this necklace will fall around your neck perfectly. If you are on the chunkier side, then it won't lay correctly and you may end up trying to adjust it all day long which can be annoying. But overall a great product, quality and very beautiful. I've gifted this item to 2 young girls and they loved it :)"},{"name":"MorganB","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Long lasting.","review":"Has not turned my neck green. Minor to no scratches. Can wear in the shower."},{"name":"La","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Worth it","review":"I'm allergic to fake jewelry but this one is worth it! It's a little small but it is worth it"},{"name":"Jennifer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Bonito","review":"Muy bonito delicado y sutil, se ve muy bien y llegó rápido."}]},{"id":"vG9Uq6","title":"NINE WEST Women's Boxed Necklace/Pierced Earrings Set, Silver/Blue, One Size","imageUrl":"https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/81M9zZH2xwL._AC_UY500_.jpg","price":"$20.00","description":"About this Item\nNecklace: L-16 in x W-0.4 in x H-0.8 in, Earrings: L-0.8 in x W-0.4 in x H-0.4 in\nBoxed Jewelry Set - Necklace and Earrings - Classics\nAdditional Information\nCountry of Origin\nChina","totalReviewCount":"1,607 global ratings","averageStarRating":"4.5/5","reviews":[{"name":"Jordan Torres","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Very Good","review":"The Necklace and earrings are very pretty and my Grandma loved it as a christmas present. Though, i payed more attention do it and if looked like the diamond was close to falling out. So Pretty much this won’t last about a month."},{"name":"Lisa Swain","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Bright","review":"Love the trio. Earrings can be worn with hair down and they will be seen as they shine so bright"},{"name":"Eric","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" NINE WEST Women's Boxed Necklace","review":"i been Tight on money and i got this as a gift for my mom for Christmas and it looks really good this necklace has really good craftsmanship and for the money its a really good product"},{"name":"linda hively","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" They’re beautiful","review":"It was a gift for my ggdaughter, she loves it."},{"name":"mattman","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Jewelry Set","review":"Jewelry Set at a fair price."},{"name":"Carole L. Reed Talbert","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Works for every woman!","review":"These were gifts & they were the Bomb! Beautiful !"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great gift","review":"Shipped quickly, very pretty."},{"name":"Donna R Johnson","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very nice","review":"Very nice set and great value"},{"name":"Top.C","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Save your money","review":"Really cheaply made. Looks like its spray painted silver. Looks good from far. No where near worth the price its at. Returning to get something better."},{"name":"Sue","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Tacky","review":"Way too shiny and fake looking. I can’t wear it. Looks like something a child might like to wear. I don’t recommend this for any adult."},{"name":"VERONICA MENDEZ ZAMORA","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Es un buen producto para regalar,","review":"salió defectuoso, me comunique y dijeron que no lo iban a cobrar pero en mi estado de cuenta sí aparece el cobro, no lo regresé porque faltaban dos días para el evento en que lo iba a obsequiar y les comente que lo iba a mandar a reparar."},{"name":"LaLocaDeLasGatas","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Un detalle para tu outfit","review":"Son un bonito regalo o auto-regalo. Ojo: no son de oro, ni tampoco tienen piedras preciosas. Pero se ven muy bonitos, y son ligeros. Por el precio, están súper bien. Además, son duraderos: no se les caen las piedras ni se rompe la cadena."},{"name":"Mel M","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Bueno para regalo","review":"Lo compre a muy buen precio y lo utilizaré para un regalo"}]},{"id":"mkZ6Py","title":"DUMBEN Hidden Message Bracelet - Meaningful gifts for Women, Great Friend Gifts, Unique Friendship Jewelry, Perfect Birthday Gifts for Women Freind BFF Sister..…","imageUrl":"https://m.media-amazon.com/images/I/61xPBOms2JL._AC_UX342_.jpg","price":"$12.89","description":"About this Item\n\" I'd shank a bi**h for you，right in the kidney \" - heartfelt & funny message engraved, A great & thoughtful gift idea for your best friend, soul sister, bestie ,bff, for birthday christmas mothers day easter...and she'll wear this bracelet to witness your friendship.\nCome with gift box and cute card: Our bracelet is beautifully packaged in an elegant gift box, which makes it a perfect and unique gift for the one you gift giving.\nGood quality: Bracelet made of 316L stainless steel,never rust,stain or fade. ( L:6.2in, W:0.24in, thickness:2.0mm )\nFashion jewelry, High polished cuff bracelet, shinne surface, very smooth with rounded edges to avoid scratch your wrist, clear engraved easily reading.\nDUMBEN will provide each customer with the highest standard of customer service and 100% satisfied shopping experience, If you are not completely satisfied with your purchase, Just contact us, We will save your problem within 24 hours.\nSee more\nAbout this Item","totalReviewCount":"3,777 global ratings","averageStarRating":"4.8/5","reviews":[{"name":"Kiara Noah","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect gift","review":"I got 2 of these as gifts. One for my sister, one for my best friend & I absolutely love them. I love that it comes with a little card too."},{"name":"bcrox","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Absolutely perfect gift","review":"Cute durable funny and at the same time sweet I bought 3 and they all loved them!"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" great","review":"its super cute and the packaging is pretty good. its worth the money for sure."},{"name":"Spruillie03","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Wish I Had Gotten it for Myself","review":"I bought this as a gift. Not only did she love it, but I really want one for myself. It's super sturdy and heavy, but still dainty"},{"name":"Carly Rae","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great gift.","review":"I have a great bunch of girlfriends. I got one for all of them. Very affordable and they all loved it."},{"name":"Brandy Weinstein","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great Gift","review":"Came just like the pictures showed, in the box."},{"name":"Catherine King","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" It was delivered with care","review":"I love this for my sister because we always say this"},{"name":"Janine Harrison","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" My best friend loved it! Nicely made. Very happy!","review":"Well made perfect gift!"}]},{"id":"HhHTKQ","title":"Genuine Birthstone Necklace for Girls Women, Heart Love Necklace for Tween & Teen, Birthstone Jewelry Gifts","imageUrl":"https://m.media-amazon.com/images/I/61T-aSZ6vFL._AC_UX342_.jpg","price":"$9.97","description":"","totalReviewCount":"253 global ratings","averageStarRating":"4.5/5","reviews":[{"name":"Joseph J. Truncale","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" A beautiful November birthstone necklace you may want to check out.","review":"A friend whose birthday is in November was coming up and I was searching online for a little gift and found this item on  (NOVEMBER Birthstone jewelry for women, heart necklace from Citrine Jewelry for women) on Amazon and decided to purchase it.\n\nAs always, the delivery was prompt. I am very pleased with my purchase. If you know someone into birthstones, you may want to check out this product on Amazon. They carry birthstones for every month of the year.\n\nRating: 4 Stars. Joseph J. Truncale (Author: The mighty pen: Your self-defense friend: Tactical se of the pen for self-defense).)"},{"name":"Che Che","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" This is beautiful!","review":"The turquoise stone is my Granddaughter's birthstone, it is a vibrant blue, crystal clear stone that she will love for years to come, and the chain is a delicate gold. I am very happy I found this for her, Thanks !"},{"name":"GRob","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Genuine Birthstone Necklace","review":"This was a gift. The person it was given to love it."},{"name":"Nancy Walsh","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very sparkly!!","review":"I bought these for our twin granddaughters who are 8. This is their birthstone and they lived the heart shaped necklaces!"},{"name":"Alicia Croft","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Amazing! It's really pretty but also super cheap!","review":"I where this so much now after getting it for christmas, I love it!"},{"name":"Brenna","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Beautiful for a little girl","review":"Great price. Very nice for a young girl. Came in nice display box and was shipped quickly"},{"name":"Martha Cruz","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Quality","review":"I like the quality of this necklace and charm. My granddaughter loved it."},{"name":"Elizabeth Taft","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Gift","review":"Beautiful"}]},{"id":"FUTgy6","title":"Turandoss Dainty Layered Choker Necklace, Handmade 14K Gold Plated Y Pendant Necklace Multilayer Bar Disc Necklace Adjustable Layering Choker Necklaces for Women","imageUrl":"https://m.media-amazon.com/images/I/51Y9MapedvL._AC_UY395_.jpg","price":"$14.99","description":"Product Details\nMaterial\nMetal\nAbout this Item\nLAYERED NECKLACE: Dainty layered choker necklaces with Pearls, Bar, Hammered Disc. Layered Necklace, in Gold Plated Y necklace.\nPRIME MATERIAL: 14K gold plated minimalist choker necklace, nickel free and hypoallergenic, safe to wear. Which makes it stands out among all other plain necklaces.\nPACKAGED: Comes with an elegant free gift jewelry bag, pearls beaded necklace, bar necklace, hammered disc pendant necklace. 3 pcs necklace, you can wear one of them or all of them.\nPERFECT GIFTS: This special layered necklace can be sent to your friend relatives in festival, Valentine's Day, Wedding, Engagement, Christmas Class, Dating, Home, Office and Daily Life.\nAFTER SALES SERVICE: 60-Day No-Risk Return Policy, reply you within 24 hours to solve your problem.\nSee more\nAbout this Item","totalReviewCount":"19,297 global ratings","averageStarRating":"4.5/5","reviews":[{"name":"Niya P.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" LOVE THESE","review":"I am not big on gold jewelry but after purchasing these, I cannot stop wearing them. I love the rope by itself and the other two together. They do get tangled from time to time but it's an easy fix. For the price, you cannot beat it with a stick. Love these, would definitely repurchase."},{"name":"Jacie Harelson","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" They are all separate pieces","review":"I was under the impression that this was all one necklace (they usually come as one but have 3 layers) because i had searched for that specifically and this came up. Turns out it’s just 3 necklaces which is fine but not what they seemed to have been advertised as."},{"name":"Lexi","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Love it","review":"I love this set, the only thing is I wish the longest piece was slightly shorter. Other than that it’s great and I love the look!"},{"name":"Shannon","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Amazed","review":"I wasn't sure what to expect but this was beautiful. I have gotten more compliments on this necklace combo. Love it"},{"name":"Tawnia","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Nice necklaces","review":"I bought these necklaces to wear to a wedding, unfortunately, all the lengths were a bit too long for what I was envisioning so I didn't end up wearing any of them. However, they're very pretty necklaces and I look forward to being able to in the future! The lengths aren't bad, by the way, just weren't what I wanted once I got the dress on.\n\nFrom my brief try-on of them all, they seem well-made, and the styles aren't overly obnoxious, just simple and dainty. They also stack quite nicely as well!"},{"name":"Rebecca L Zimmerman","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Three separate neclaces","review":"I don't wear these daily, but I have enjoyed the versatility of wearing all or some. Cute! Priced right."},{"name":"J_M","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great buy","review":"I usually don’t wear necklaces but I love that I can wear all 3, 2 or just 1!!!"},{"name":"Chel Bess","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Awesome","review":"Totally loved these 3,I gifted my with 1real value for money"},{"name":"Elenita","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" bien para el precio","review":"los 3 lucen bien solos o juntos, los compré en oferta"},{"name":"acoyani contreras","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Cumple con todo lo descrito","review":"Son muy bonitos"},{"name":"Rosalía Garcia","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Supe prácticos","review":"Buena calidad por el precio"}]},{"id":"qEYQtT","title":"CHESKY 14K Gold/Silver Plated Snake Chain Necklace Herringbone Necklace Gold Choker Necklaces for Women Girl Gifts Jewelry 1.5/3/5MM(W) 14\"/16\"(L)","imageUrl":"https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/510giQAF66L._AC_UX385_.jpg","price":"$15.99","description":"About this Item\n【Layered Herringbone Necklace Material 】:Made of handpicked brass, and plated in 14k gold to ensure a long lasting finish that is tarnish-resistant,nickle free, lead free, and hypoallergenic, Reduces concerns about sensitive skin and product quality issues\n【Gold Chain Necklace Size and Package】:Inner necklace Size:3mm/14\"+2\"extension, Outer necklace Size:1.5mm/16.5\"+2\"extension,this length works on practically anyone! Our dainty jewelry packaged with a delicate gift box\n【Double Snake Chain Necklace Applicable Ocassion】:Those dainty necklace can be sent to your friend relatives in festival,it's an ideal gift for women and teen girls. it also perfect for all dress up and any occassions,e.g. Valentine's Day, Wedding, Mothers day,Party, Engagement, Class, Dating, Beach, Home, Office and Daily Life.\n【layered Necklace Design】The flat snake chain can be worn alone or with other favorite chains. If you like, you can choose to add a trinket to the chain. Not only does it look cool, it's elegant! Stack this snake chain necklace with other beautiful layered necklaces or pendant really well\n【Good Customer Service】: If you have any problem about snake calvice chain necklace ,please feel free contact us by Mail,we will answer within 24 hours.we offer refund or free of replace in 90 days.Just be happy to add this nice necklace to your jewelry collection.\nAdditional Information\nCountry of Origin\nUSA\nSee more\nAbout this Item","totalReviewCount":"5,346 global ratings","averageStarRating":"4.4/5","reviews":[{"name":"Kylie M","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" LOVE","review":"The two necklaces can be worn individually and they are such good quality. My mom always steals my necklace so I will have to purchase her own set!"},{"name":"Jaclyn Privitera","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" The round necklace maybe an issue","review":"I liked the set but my biggest issue was the round necklace would catch onto my hair if I had it down. Resulting in my hair getting ripped out. Not enjoyable but when my hair is up I don't have issues. The other necklace e with it is great!"},{"name":"Myesha Jackson","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Sensitive skin approved","review":"I love my necklace I wear it everyday. I suffer from sensitive skin and I am blown away with the value and the durability of this necklace I will be purchasing one more after I finish this review."},{"name":"Elizabeth","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Pretty","review":"I recently got this necklace set in the mail. I have not worn it yet but I like it. Very shiny, pretty."},{"name":"CC","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" A staple accessory at a great price!!","review":"So elegant, lightweight and great quality for the price! Came packaged in a small teal box. One can wear the necklaces separately or as a pair. I bought one as a gift and liked it so much bought another."},{"name":"Shantee Wallace","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Quality","review":"I like that it was gold plated"},{"name":"shericka Charles","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Holding up pretty well","review":"Seem to hold up pretty good have not change color."},{"name":"Ashley Gerenda","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Gorgeous Necklace and Packaging","review":"This necklace is perfect on its own or paired with another like I did in the photo. It also came in the cutest little box which would make it perfect to gift! Plan on buying more from them especially for that factor!!!!"}]},{"id":"BSVe4Y","title":"Tiny Gold Initial Heart Necklace-14K Gold Filled Handmade Dainty Personalized Letter Heart Choker Necklace Gift for Women Necklace Jewelry","imageUrl":"https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/51rc5z7JZuL._AC_UY395_.jpg","price":"$13.99","description":"Product Details\nMaterial\nMetal\nAbout this Item\n【LENGTH AND SIZE】:Initial Necklace Length:13.8\"+2\" Pendent Size:0.24\"*0.27 Which have a Extension Chain,This length works on practically anyone!\n【MATERIAL】:INITIAL NECKLACE-The necklace engraved with alphabet（from A to Z),14k Gold Plated, 1Pcs charm necklace, minimalism style, small heart pendant necklace.\n【THE MEANING】:Initial Necklace is good Necklace Gift let her know she's always connected to you just like these Letter Name.When she wears this necklace she'll have a reminder of her strength and that you are always there for her.Celebrating family, wife, daughter, granddaughter, women, and girls,Mother,Friend,Let her know you'll love them forever with this elegant pendant. Perfect gift for MOM.\n【TIPS】:Following these easy steps, to keep your jewelry in its original condition for a long time:- avoid contacts with ocean/sea water, cosmetics, perfumes, household products, etc. - not recommended to be worn in shower & gym - use soft jewelry polishing cloth from time to time to prevent tarnishing - keep in an air-proof bag when not in use\n【Services】:Concerns regarding the order will be answered within 24 hours\nSee more\nAbout this Item","totalReviewCount":"32,319 global ratings","averageStarRating":"4.4/5","reviews":[{"name":"GY","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Cute and dainty","review":"It’s way smaller than I expected, but I actually like that better. Looks very nice on, it sits between the collar bone or I can use the attached extender to drop it down a bit. It’s a very small and subtle initial necklace. But I like it. Hopefully it doesn’t tarnish."},{"name":"Rose Marie B","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" My granddaughter loves it!","review":"The necklace was exactly what I expected, arrived on time and was a wonderful Christmas gift for my granddaughter. She was excited that it had the letter L for her name (Leia) and for Love. Such a smart girl. ❤️"},{"name":"Laurie","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" So cute !","review":"Gave this as a secret santa gift and it's really cute. The only thing I would say is I didn't pay attention to the size of the heart and was surprised to see when I received the necklace that the heart is very tiny.. It's still an adorable item."},{"name":"KaylaK","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Beautiful","review":"I bought this for my sister as a birthday gift because I absolutely love mine. It looks expensive but the price is low. It’s Dainty and beautiful great gift for anyone"},{"name":"Selina Fiely","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" These necklaces are super cute and dainty. (Pretty small)","review":"Gave this as a gift to my nieces. Small but cute!\nThey're 7 & 10 yrs"},{"name":"chris ewing","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" The heart is soooooo tiny","review":"It’s an adorable necklace but the heart is extremely tiny. It fits my 4 year old well, but if your an adult it looks ridiculous."},{"name":"Brenda","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" My little girls loved them!","review":"It was just the right length for my little girls. Ages 10 & 7.\n\nThey love them. Special gift from Grandma!! ♥️"},{"name":"Marilyn","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" It was beautiful just a lot smaller then I thought","review":"Beautiful and looks good just super tiny heart with an even tinier letter inscribed"},{"name":"Amber","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Cute","review":"It's a cute little necklace, keep in mind the charm is SMALL like it's the size of the tip of a pinky finger of a small female hand. But it's still super cute, I wish the chain was a little longer, it's almost choker size, maybe slightly longer then choker necklaces."},{"name":"L Morris","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Fragile","review":"Super cute but not made strong. We bought two and they were both broken within a week."},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect fit","review":"This was a gift for my granddaughter. It was the perfect size for a 4 year old."},{"name":"Trace","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" My granddaughters loved it","review":"It was a bit smaller than I thought it would be but it was for my little granddaughters and fit them just fine."},{"name":"Mhawkins","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Cute","review":"Cute but really small"}]},{"id":"nAxQGw","title":"PAVOI 14K Gold Plated 3mm Cubic Zirconia Classic Tennis Bracelet | Gold Bracelets for Women | Size 6.5-7.5 Inch","imageUrl":"https://m.media-amazon.com/images/I/610VsCaFMXL._AC_UX385_.jpg","price":"$15.45","description":"About this Item\nTennis bracelet featuring round 3mm AAAAA cubic zirconia stones in four-prong basket settings. Measures 6.5 inches in Length\nCubic Zirconia set in Lead-free, Eco-friend and hypoallergenic setting. This stunning bracelet is then Gold Plated to ensure a long-lasting and brilliant finish.\n✦ 90-DAY GUARANTEE ✦ Your happiness is our number one priority. To ensure your complete satisfaction, we offer a hassle-free 90-Day money-back guarantee. To get in touch, email or chat with us - a member of our team will be happy to help you.\n✦ SUSTAINABILITY ✦ We’re committed to protecting the planet. That’s why every piece of PAVOI jewelry is crafted with 100% recycled materials and we package in 99% recycled and compostable materials. We are proudly carbon-neutral and completely offset our plastic consumption by removing over 275,000 plastic bottles from our ocean annually. Learn more about our sustainability efforts here.\n✦ PROUDLY AMERICAN-OWNED ✦\nSee more\nAbout this Item","totalReviewCount":"18,092 global ratings","averageStarRating":"4.3/5","reviews":[{"name":"Mrs. M","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Returned it without wearing. The clasp did not open.","review":"It looks pretty and came in a nice box. My partner gifted it to me for Christmas. We returned it last week because we could not get the clasp open. I never even wore it. It does not look cheap, so it had that going for it. I thought it was real."},{"name":"Ashley","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Love it :)","review":"I love how simple and dainty this bracelet is! My boyfriend got it for me as a graduation gift and it seriously is so cute! I have worn it in the shower, while doing dishes, washing my hands, etc., and it hasn’t tarnished at all. I have super small wrists, so it is a little loose on me even though I have the XS size. It doesn’t bother me that it’s loose though. If you are looking for a gift for someone, this is a great option! It matches well with other jewelry and is a staple piece."},{"name":"Vincent Loforti","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Beautiful and looks realistic but it fell off 🥲","review":"I had it about a week and the clasp must have failed. I enjoyed it for the time I had it. Very sparkly and classy"},{"name":"Kami Gamlem","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Classy Little Bracelets","review":"Excellent jewelry for the price. I bought silver in 7.5 inch because I wasn’t sure about the sizing, since other reviewers stated that it ran small. It’s a little loose, but I wanted a gold one also, so I ordered it in 7 inch. Both fit great!"},{"name":"Larissa Wood","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect accessory","review":"I’ve really enjoyed this bracelet and have worn nonstop for weeks at a time with no sign of wear or tarnishing. I’ve even had a couple people ask if it’s real!"},{"name":"Kathleen Coleman","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Really pretty","review":"Super happy with my purchase. The first one arrived missing a stone so I reached our to the company and sent a replacment immediately. It's heavy and beautiful. Supe happy with my purchase!"},{"name":"Rabia Friend","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Sparkly","review":"A beautiful bracelet. Sparkly and well crafted."},{"name":"Jazmyn Cuellar","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Barely fits me as a 13-year-old runs very small","review":"I would love this if it would fit but unfortunately it doesn’t so I will be returning it but it would be an awesome gift for your friends or family members just remember it runs small."},{"name":"Cliente ","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect!","review":" Stunning! I’ve been searching high and low for a tennis bracelet but didn’t want to break the bank plus these often come in very big sizes and my wrists are small, this one fits me perfectly (6,5 inch) hope it holds up nicely over time :)"},{"name":"weepollypocket","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Absolutely stunning tennis bracelet","review":"Absolutely stunning tennis bracelet. The clarity and sparkle that comes from it beautiful.\n\nI've worn it everyday, even worn it in bed overnight and my wrist has no funny colours on it like other cheap imitations."},{"name":"tanith","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Wow!","review":"What a find! Wanted an everyday bracelet that was a touch a glamour without being over the top. Got the white, 7.5in wrist - perfect, not too OTT, nice movement, easy clasp, believable size, great price. If the reviews are anything to go by, this will be a winner and will definitely get another."},{"name":"Angela","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great quality and sparkly","review":" Excellent quality, well made and very sparkly. Looks sparkly and complements my jewellery"},{"name":"Luca M","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" BE AWARE","review":"*** BE AWARE ***\nNot good\nGot it around 5 weeks ago\nUnfortunately it has discoloured and left a rush on my wrist…\nI do not think they use good metal\nIt has turned a brown colour on the side in contact with the wrist skin\n*** BE AWARE ***"}]},{"id":"u-LLjb","title":"Cubic Zirconia Hypoallergenic Stud Earrings for Women Men Girls Statement Cartilage Fashion Surgical Steel Helix Earrings 5 Pairs","imageUrl":"https://m.media-amazon.com/images/I/61Thc4m8VWL._AC_UX385_.jpg","price":"$12.99","description":"","totalReviewCount":"13,577 global ratings","averageStarRating":"4.3/5","reviews":[{"name":"brianna","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Amazing","review":"I got this for my cousin who recently got her ears pierced. The guy who did them didnt know what he was doing, he gave her butterfly back earrings and didnt give her a bar long enough to cope with the swelling. We switched to different earrings and found out she was allergic to the \"fake metal\" in those earrings and the peircings started to reject. I found these and immediately knew that this is what she needed. The variety in the size if the diamonds also gave her the choice to pick what she actually wanted instead of the generic \"this is what we have so this is what you get\" most places offer. The flat backs were wide enough to keep her ears from basically absorbing them like they did the original piercing. And the bar was long enough that it helped with the swelling caused by the previous earring rejecting. In two weeks her ears were finally able to heal. The flat backs were also comfortable on her to sleep on while her ears were healing. Overall 10 out of 10 in my books"},{"name":"Christina Potter","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" LOVE. LOVE. EVERYTHING I WAS LOOKING FOR","review":"First of all, I didn’t expect them to come in cute little packaging, and it stays neat and organized. I hate when my earrings stab me in the middle of the night because they are too long and too sharp. These fit so snug but they are comfortable and can move/twist easily, which I love. The smallest size it the daintiest little gem and I have been searching for one this size. it’s quite literally perfect. Only downsize is my fingers literally get sweaty and slippery which makes putting the backs in so difficult LMAO. otherwise these are perfect."},{"name":"Danae","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" So comfy.. but ouch?","review":"I’ve struggled with my ears rejecting peiercings my entire life. Ive went to order these a few times and thought I could tiff it out. NO. I finally did it and have not had a single flare up since!!! These are amazing. What I will say is they are a slightly bigger gauge than most earring holes… at least mine. And while they are not getting infected I’m working on essentially “resizing” my 3 lobe piercing. Other than that idk why I didn’t buy them sooner!!"},{"name":"Ashley","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Truly hypoallergenic !","review":"I have spent money on some websites that swear it’s make for sensitive ears. I can only wear those one maybe two days then my ears start to hurt. I’m on 2 weeks going strong with these earrings. When I take them off my ears don’t feel swollen or hurt. I took them off to just see how it would do putting them in the next morning; the hole was still opened didn’t have to force it open like the other ones would have done. Worth it ! Thank you thank you I have been searching all over for comfortable earrings !"},{"name":"Kimberly","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Sooooo worth buying!!!","review":"So worth it!!! They’re amazing quality especially for the price. I’m only wearing the two smallest sizes but I love that I have the other options. I’ve been sleeping in them since getting them and they’re incredibly comfortable. I also have really sensitive ears and I haven’t had a single issue. No redness, no pain, nothing. I genuinely couldn’t be happier with them!!"},{"name":"Aimster","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Love these","review":"For someone who has sensory issues these are great! I was starting to miss my earrings but had to put them in and take them out at night. I can’t stand the way regular earrings feel when trying to sleep or how they touch the pillow etc. I’ve had these in since I’ve gotten them and haven’t had to take them out. Im excited to get more colors!"},{"name":"Makenna","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Good, but backs fall off","review":"I absolutely love these earrings. They fit in my ear well. The only issue is the backs of mine do fall off a lot. I have lost 4 of the backs and I have only had them in about a week"},{"name":"Duane","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Rose Gold (B) isn't as vibrant as the picture! It's a very washed out.","review":"Bought the Rose Gold (B) for my wife. She likes them but the one complaint is that they aren't as vibrant as the picture. They are slightly Rose Gold. I had to shine a light to actually see the full color because at first I thought they sent me the regular Gold (C). Other than that they are great."},{"name":"Dani","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Love these earrings! Flatback labrets for life!","review":"These earrings are fantastic, this is the 5mm and 3mm I have in. My ears have always been very easily irritated and I have had these in 24/7 for 3 weeks and not an ounce of irritation. They are also extremely comfortable to sleep in because they are flatbacks. The back unscrews rather than the front so they are easy to put in."},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Better quality than expected","review":"For the price, I wasn't expecting much. But these are actually really lovely! They're well made, strong and secure, the gem is very sparkly. There's a good variety of different sizes.\nI've used two pairs so far (in 2+ months) and slept, showered, exercised etc with them in. There's been no discolouration and the screw end has stayed tight!\nThey are quite fiddly to get the back on, so don't do it in a rush or when you're stressed. But worth it when they're in and you don't have to worry about them again for a while!"},{"name":"MissPRae","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Good product","review":"I have worn this in my ears now for months (four earrings). No issues with the backs coming off and I wear them in bed and showers.\n\nI do not recommend these if you intend to take them out daily as the backs are fiddly\n\nSome of the backs I received did not work and the threading had gone so they spun and did not tighten.\n\nYou have to screw them on at the right angle or they won't stay on. Once out on correctly they don't budge.\n\nAs you get so many for the price I feel it's very good and a couple of backs not working did not bother me as majority did.\n\nAlso they look expensive and I have no reaction. I am severely allergic to nickle and no reaction at all to these so very happy"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Rose gold studs","review":"I love these earrings, I have very sensitive ears , I can only wear sterling silver or 9ct gold, I got these earrings as it said surgical steel and hypoallergenic, said I'd give them a go I have them in my ears nearly a week and I am not allergic to them. And I can also sleep with them in and they don't jag me as they have screw back on."},{"name":"Jon Bridges","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" No worry stud earrings","review":"Bought this for my girlfriend, her words...\nI have been suffering with infected ears for years. I stopped wearing any and as a result my earring holes had to be pushed through every time I wanted to wear some. I needed a solution to keep the earring holes open but without infection and this product really delivered. I have been wearing them for weeks now and no infection. Popping them in for the first time was a bit fiddly but it is true that you are better off doing it without the mirror. I tighten them once in a while but they stay put even so I shower everyday, had several pool days and work out 5-6 days a week."}]},{"id":"TCZBUQ","title":"Kendra Scott Elisa Pendant Necklace for Women, Fashion Jewelry, 14k Gold-Plated","imageUrl":"https://m.media-amazon.com/images/I/61UnDywSfxL._AC_UY500_.jpg","price":"$55.00","description":"Add a splash of color to your look with this gorgeous necklace!\n14K gold plated over brass necklace with stationary pendant.\nLobster-claw closure.\nDue to the one-of-a-kind nature of the medium, exact color patterns may vary slightly from the image shown.\nImported.\nMeasurements:\nChain Circumference: 15 in\nAdjuster Length: 2 in\nPendant Height: 3⁄8 in\nPendant Width: 3⁄4 in\nWeight: 0.1 oz","totalReviewCount":"9,190 global ratings","averageStarRating":"4.7/5","reviews":[{"name":"Love those country roads","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Attractive","review":"This is a gift for a granddaughter. It is quite delicate and the stone is very pretty. The box in which it comes is attractive as well. I wish it had been anchored in the box. It is attached to a holder that is much smaller than the box which allows the necklace to bounce around in the box. I found a piece of packing from a necklace box of mine and used it in the box to hold the necklace in place. At this price point I think a nice presentation in the box isn’t too much to expect."},{"name":"Dawn","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Granddaughter loves","review":"This was a gift for my tween granddaughter who lives in another state so my review is based on pictures of her wearing it. It appears a bit delicate so probably best not worn if playing sports or doing other vigorous activities. Looks lovely on her and she loves it."},{"name":"Jake","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great quality!","review":"We ordered the rose gold druzzy necklace. We received the silver version instead. But they were listed at the same price and my daughter loves it regardless.. ill definitely be ordering one for myself."},{"name":"Jennifer Hollister","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Beautiful and trendy","review":"This necklace is beautiful and trendy with a lovely design, and is the perfect length. The detail is unique. The value is good for the money because it is trendy, but not made of fine materials"},{"name":"Aspen","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" THESE ARE WORTH THE MONEY 100%","review":"This Kendra Scott necklace comes in such a cute box! The necklace is so adorable. I bought this with an  giftcard and it was so worth it!!"},{"name":"Ena Pira","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Nice!","review":"Very nice! Good quality, I was looking forward to getting this on Christmas. It was very nice and it had good packaging"},{"name":"Lauren L.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" LOVE THIS","review":"Love this. I wear it so much and it hasn't tarnished. I've slept swam and showered in it. GREAT"},{"name":"Syniah Ancion","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" worth it","review":"love my necklace, wish i went with a longer chain but its perfect"},{"name":"Luna","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Not a good product!","review":"Keep flipping on the neck."},{"name":"Rose nord","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" pretty","review":"pretty"},{"name":"Courtney","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Five Stars","review":"Beautiful necklace!!"}]}]