[{"id":"aIwBd7","title":"14KWhite Gold Plated Initial Heart String Bracelets for Women Men Teen Girls Boys Handmade Rope Braided Bracelet Minimalist Jewelry Matching Couple Bracelets","imageUrl":"https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/51zd5YlseSL._AC_UX385_.jpg","price":"$0.95","description":"Product Details\nOrigin\nImported\nAbout this Item\nThe Bracelet Is The Perfect Gift For Your Family, Lover And Friends. Perfect For The Beach, Pool, Surfing Or Any Other Occasion In Summer, It's Sure To Give You Compliments\nThis 26 Heart Initial Can Represent Your Name, But It Can Also Represent Your Lover And Family. Anklet Is Still The Highlight Of Clothing Collocation.\nThe Meaning Our Dainty Name Bracelet To Represent You Or Your Loved Ones.\nBest Gift Our Delicate Gold Initial Bracelet Is Packed With Love. It's A Perfect Gift For Your Kids, Child, Best Friend, Daughter, Wife, Mom, Men, Husband, Boys, Brother, And Even Grandmas Love Them Too. The Letter Bracelet Is Lightweight And Comfortable To Wear.\nGreat Gift For Birthday, Wedding Anniversary, Valentine's Day, Christmas, Mother's Day And Other Holidays\nDescription\n\n14KWhite Gold Plated Initial Heart String Bracelets for Women Men Teen Girls Boys Handmade Rope Braided Bracelet Minimalist Jewelry Matching Couple Bracelets\nBeautiful 26 letter bracelets are perfect for matching belly dance outfits\nThe bracelet is the perfect gift for your family, lover and friends. Perfect for the beach, pool, surfing or any other occasion in summer, it's sure to give you compliments\nMaterial: copper\nThe bracelet accessories are made of copper and Braided rope, the surface is electroplated, and the color: vintage letter bracelet, durable and durable, very beautiful and shiny\nChain length Size: 30cm (adjustable Length is 8-15cm）\nThis can represent your name, but it can also represent your lover and family. Bracelet is still the highlight of clothing collocation.\nColor:\nwhat you get: 1 × bracelet\n\nSee more\nAbout this Item","totalReviewCount":"9 global ratings","averageStarRating":"4.3/5","reviews":[]},{"id":"HM-1RR","title":"ManRiver 26 Letters Rings for Women - Diamond Rhinestone Studded Zirconia Open Adjustable Rings Jewelry Accessory Gifts","imageUrl":"https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/51NZqK1YW+L._AC_UX385_.jpg","price":"$6.80","description":"About this Item\n【Arrive for valentine's day !!!!!!! 】 This stylish rhinestone ring is in a special design,excellent workmanship and unique structure.\nAmaping - It is a good gift for your lover, family, friends. Ladies will be more charming and attractive with it.\nEasy to match your bracelet,necklace,watch, bag or daily dress.Amaping\nOccasions: Party, Gift, Daily Life, Prom, Ball, etc. women rings ring gold silver wedding sterling silicone engagement nose diamond women's toe steel rose stackable band men stainless 14k jewelry knuckle thin vintage birthstone finger clearance anxiety ring sterling silver ring spinner bead ring\nSIZE：Multi-size Choice - Standard: 7-15 Days To Arrive\nDescription\n\nWELCOME To ManRiver Online Store ! women rings ring gold silver wedding sterling silicone engagement nose diamond women's toe steel rose stackable band men stainless 14k jewelry knuckle thin vintage birthstone finger clearance anxiety ring sterling silver ring spinner bead ring Selling point: Simple and stylish High quality metal Inlaid rhinestones make you more outstanding Suitable as a gift for mom, girlfriend and good friends Suitable for all occasions. Like weddings, parties description: Size: adjustable Material: Alloy Color: golden Attention. The product is open style, can be adjusted by yourself, the product picture is a kind of effect There is no fixed inner diameter for openings like this. When you break it, try not to break the joint, although it is not so easy to break, but that is the most vulnerable place. contain: 1 x ring\n\nSee more\nAbout this Item","totalReviewCount":"953 global ratings","averageStarRating":"3.4/5","reviews":[{"name":"Alaisha.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" you get what you pay for!","review":"i liked this product except for the fact that i had to wait a month or two for it to arrive. and when it did arrive it came in good condition. but as for it being a gold ring that is not actually gold, i had to put nail polish in the inside of it where my finger would go. to prevent my finger from turning as we know, “green.” i never really got to enjoy it as much as i would like to because the same day it arrived was the same day i miss placed it. and never seen it again. that was my fault, but overall it was a nice TEMPORARY item!"},{"name":"Izanable","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Everything came in good packing but one my ring’s snapped while adjusting it on my finger","review":"It snapped easily"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" A good value","review":"Great gift for my girlfriends."},{"name":"Kayde Lee","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Pretty but broke in a week.","review":"Loved it and wore it for about a week and then randomly felt something lose on my finger and it broke in half"},{"name":"Diane platte","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Gift","review":"This was a gift and it was liked very much."},{"name":"zella green","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Good buy","review":"The stone fell out the first out the first time I wore it"},{"name":"Ruth Hessaa","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" This fell apart the K came off not worth the money","review":"The K fell off when my daughter wore it"},{"name":"Yessica","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Y","review":"Muy bonito y cómo es abierto emboba muy bien al dedo y buena calidad para el precio lave trastes y no se puso feo !!"}]},{"id":"G3FeY6","title":"dincle 14 Pcs Gothic Cross Necklace Women,Hip Hop Cool Emo Necklaces Jewelry Set Y2K for Women,Chokers Grunge Punk Necklace Set Gothic Jewelry for Man Teen Girls","imageUrl":"https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/61e+Io4Pa2L._AC_UX385_.jpg","price":"$11.99","description":"About this Item\n❤【Excellent material】The necklace is made of high quality alloy brass stainless steel material, which does not contain any nickel lead and is absolutely hypoallergenic. Together with advanced surface plating technology, it can be worn with confidence on a daily basis.\n❤【The package contains 9 necklace sets】Including key lock necklace, butterfly angel cross necklace, bell pendant, vintage cross necklace, love necklace, Saturn love necklace, crystal pendant, cherry necklace, thorn necklace.\n❤【Unique Style Design】 9-piece necklace set, drawing inspiration from the mystery of Gothic architecture, the destruction and reconstruction of the punk series, the dark loneliness, and the madness of the rock style, the quirky necklace is a magic weapon for everyday or Halloween dress up, especially cool.\n❤【Best Gift Choice】The 9-piece vintage grunge necklace set is perfect for everyone to wear in your everyday life, being your coolest self shouldn't be limited by age, or you can reserve it for yourself to wear on a date, anniversary, Christmas or other holiday. This is the perfect gift for girlfriends, boyfriends, best friends, daughters, and teenage girls.\n❤【After Sales】100% satisfaction with problem solving. 60 DAYS “NOT ARTIFICIAL DAMAGE” FULL REFUND OR FREE REPLACEMENT GUARANTEE. If you have any concerns about Square zirconia bracelet, please feel free to contact us and we will help you as soon as possible.\nAdditional Information\nCountry of Origin\nChina\nSee more\nAbout this Item","totalReviewCount":"2 global ratings","averageStarRating":"4.5/5","reviews":[]},{"id":"RFAf1F","title":"Flower Girl Gift - Flower Girl Necklace {Set of 2} | Girls' Jewelry | Flower Girl Necklace | Flower Girl Gifts from Bride","imageUrl":"https://m.media-amazon.com/images/I/61jgLCSwUBL._AC_UX385_.jpg","price":"$12.99","description":"About this Item\n🌸 YOU GOT THE RING, NOW IT’S YOUR TIME TO GIVE THE BLING! Help your flower girl feel like a special part of your special day with our GORGEOUS necklace! You know you can’t “Tie the Knot” without her, so make your flower girl’s day with this PERFECT FLOWER GIRL necklace.\n🌸 OUR PRECIOUS FLOWER GIRL NECKLACE comes in pack of 2 and on a PREMIUM card with ROSE GOLD foil printing. Available in 2 styles. Cards either read “Thank you for being my Flower Girl” or “Will you be my Flower Girl?” Dazzle and delight your flower girl with a gift she’ll CHERISH for years to come!\n🌸 YOUR LITTLE LADY DESERVES THE BEST! We use the HIGHEST QUALITY, premium rose gold plating chain and pendant that will have the little star of your “I DO CREW” showing off her special gift to the WHOLE WEDDING!\n🌸 READY, SET, GIFT! Each necklace comes on a premium giftable card, with an adjustable chain. So what are you waiting for? Our flower girl necklaces make the perfect flower girl gift or flower girl proposal!\n🌸 AT POP FIZZ DESIGNS, FUN IS our middle name. We’re a small USA-based family business & believe life was meant to be celebrated – every moment. WE LOVE HELPING CUSTOMERS TO make their celebration special. IF, FOR ANY REASON, you don’t absolutely love your flower girl necklace, WE WILL MAKE IT RIGHT\nSee more\nAbout this Item","totalReviewCount":"102 global ratings","averageStarRating":"4.7/5","reviews":[{"name":"Graceann Tozzi","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" nice for a fancy party","review":"I got this for my flower girl and she loved it."},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" So cute!","review":"I love these little necklaces! The picture makes the flowers look big but they are daintier and so adorable. I’m so happy with them and I can’t wait to give them to my flower girls!"},{"name":"Tina","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Adorable","review":"These were adorable to give to my two little girls for my brothers wedding. They absolutely love them."},{"name":"CW","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Cheap","review":"Necklace broke within minutes of opening the package"},{"name":"Colleen","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Only received one of the two necklaces...","review":"Only received one of the two necklaces..."}]},{"id":"AW7dZt","title":"Eternal Necklace by Eternal Rose - 24k Gold Dipped Rose Necklace for Women - Real Rose Pendant Necklace - Gold Ladies Evening Jewelry - Gift for Her - Ideal for Weddings, Marriage Ceremonies, Anniversaries, Birthdays, Parties, Special Occasions, Homecomings, Graduations","imageUrl":"https://m.media-amazon.com/images/I/51kwUZRoGZL._AC_UX385_.jpg","price":"$130.00","description":"Elegant, personal and meaningful, our Eternal Necklace by Eternal Rose collection is perfect for showing that special person just how much they mean to you, as well as adding sparkle to your own look. Each necklace features a real rose pendant dipped in 24k gold and stylised in exclusive colors or shades only available from Eternal Rose. Perfect on its own or as part of a themed Eternal Rose set. Eternal Rose is the gold standard in one-of-a-kind 24k gold rose jewelry and gift items. We are proud to be unmatched in the quality and presentation of our products. Each and every Eternal Rose piece is a hand-picked fresh rose that is handcrafted through a 65-step process into a stunning jewelry item. It is then dipped into 24k gold and preserved to last for eternity. As nature intended, no two roses in our collection are ever the same, however they all share the same glossy lacquer finish and are presented in our signature velvet presentation box. Made in the USA. Carefully packaged to arrive at your door in pristine condition. Includes a 14-day warranty in the unlikely case you are unsatisfied with your order.","totalReviewCount":"83 global ratings","averageStarRating":"4.7/5","reviews":[{"name":"Jimmy Thompson","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Beautiful","review":"The colors."},{"name":"Beth","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Nice size. Nice color.","review":"Bought this to match a ring, then added some rose earrings and they looked elegant."},{"name":"navreader","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Most Lovely Necklace","review":"It was for my wife's birthday and boy did she love it. Wears it often, get appreciative comments wherever she goes. The most lovely necklace she received, she said at her opening the present."},{"name":"patrick walker","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" HER SMILE","review":"HER SMILE MADE IT WORTH BUYING"},{"name":"Renee DiPasquale","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" A Show-Stopper","review":"What a lovely gold necklace with red rose highlights. I have enjoyed wearing it and have received several compliments."},{"name":"Roger d. and Thassia","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Better than expected and so unique!","review":"Absolutely in love with my eternal rose. The blue stood out to me the most, and it's such a stunning shade. I wore it to go out on a date with my husband. Would definitely like to add other colors in the future. The craftsmanship is impeccable, down to the logo of the company on the back of the rose. Fun fact, you can see how translucent the petals are when you shine a light behind it, revealing the real rose that became \"eternal\". Truly mesmerizing and such a good idea for a gift for mother's day or birthday, etc."},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great gift","review":"My girlfriend loved it"},{"name":"carol hallgarth","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" gift","review":"It was a surprise gift from my husband. When I received it I was so surprised. It is beautiful."}]},{"id":"Hyg22R","title":"Flower Girl Gift - Flower Girl Necklace {Set of 2} | Girls' Jewelry | Flower Girl Necklace | Flower Girl Gifts from Bride","imageUrl":"https://m.media-amazon.com/images/I/71aAUkkDPYS._AC_UX385_.jpg","price":"$12.99","description":"About this Item\n🌸 YOU GOT THE RING, NOW IT’S YOUR TIME TO GIVE THE BLING! Help your flower girl feel like a special part of your special day with our GORGEOUS necklace! You know you can’t “Tie the Knot” without her, so make your flower girl’s day with this PERFECT FLOWER GIRL necklace.\n🌸 OUR PRECIOUS FLOWER GIRL NECKLACE comes in pack of 2 and on a PREMIUM card with ROSE GOLD foil printing. Available in 2 styles. Cards either read “Thank you for being my Flower Girl” or “Will you be my Flower Girl?” Dazzle and delight your flower girl with a gift she’ll CHERISH for years to come!\n🌸 YOUR LITTLE LADY DESERVES THE BEST! We use the HIGHEST QUALITY, premium rose gold plating chain and pendant that will have the little star of your “I DO CREW” showing off her special gift to the WHOLE WEDDING!\n🌸 READY, SET, GIFT! Each necklace comes on a premium giftable card, with an adjustable chain. So what are you waiting for? Our flower girl necklaces make the perfect flower girl gift or flower girl proposal!\n🌸 AT POP FIZZ DESIGNS, FUN IS our middle name. We’re a small USA-based family business & believe life was meant to be celebrated – every moment. WE LOVE HELPING CUSTOMERS TO make their celebration special. IF, FOR ANY REASON, you don’t absolutely love your flower girl necklace, WE WILL MAKE IT RIGHT\nSee more\nAbout this Item","totalReviewCount":"557 global ratings","averageStarRating":"4.8/5","reviews":[{"name":"nora szagut","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" They do come beautifully","review":"They came fast and they r so beautiful"},{"name":"Beverly Halford","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Girls loved them","review":"They were so cute"},{"name":"Macknelson","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Comes in a 2 pk","review":"I bought these for my flower girls as a gift. They loved them! Perfect cheap gift that looks nice & is so cute"},{"name":"Christina","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect","review":"For our wedding, I was looking for something in a soft peach that my daughter could wear, our colors are royal blue and soft peach. As the flower girl, this necklace couldn't be a more perfect way to incorporate peach into her outfit and what a sweet way to officially ask her. 💕"},{"name":"Crystal Lawrence","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very cute!","review":"This necklace was a perfect gift for my flower girl! She absolutely loved it."},{"name":"Jason Elgin","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Flower girls","review":"Can't wait to give these to my flower girls"},{"name":"Jessica R.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Big hit!","review":"These were a big hit with my flower girls. Product is exactly as described"},{"name":"Holly Kathol","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Get what you pay for","review":"Were as expected, but would probably be best for only special occasions. One of them broke but was easily fixed"}]},{"id":"4N3oe3","title":"MAIBAOTA 10 Pcs Crystal Necklace Healing Amethyst Crystals Carnelian Chakra Necklaces Evil Eye Necklace Vintage Hippie Wiccan Boho Rose Quartz Obsidian Moon Sun Jewelry Heart Gemstone Aventurine Turquoise Pendant for Women Wholesale","imageUrl":"https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/71aynpoPjkL._AC_UX385_.jpg","price":"$16.99","description":"About this Item\n★10 Pcs Crystal Necklace Set Originally designed by Mai Baota Jewelry Store★★10 Piece Crystal Necklace Set in a {gifted} velvet bag and Mai Baota unique gift box★if you have any product questions, you can always contact us via  contact us.\nThe 10-piece healing crystal necklace 7 chakra necklace, evil eye necklace, vintage sun moon necklace, amethyst necklace, rose quartz necklace, rose quartz heart necklace, carnelian necklace, obsidian green aventurine necklace. A variety of vintage style hippie boho fashion necklaces that are very beautiful you can match with different styles of clothing.\nThese crystal pendant necklaces in different shapes and fashion styles are suitable for mom, girlfriend, wife; perfect surprise gift for birthday, christmas, mother's day, valentine's day, anniversaries, etc.\nNatural energy healing crystal necklace pendant, can make you feel calm and relaxed, help you focus, keep your mind clear, relieve stress and anxiety, lift your spirits, get rid of dullness and boredom, and also bring you good luck and health.\nHealing Crystal Necklace Jewelry is made of stainless steel alloy and energy crystal, it is sturdy quality, very stylish, not too heavy, very easy to put on and take off.\nSee more\nAbout this Item","totalReviewCount":"1,052 global ratings","averageStarRating":"4.5/5","reviews":[{"name":"Iyonna pearce","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Crystals","review":"I love these necklaces. It turned pretty easy. And it broke a lot but if ur careful and match them well these necklaces can take u a long way. I love them. And I wear mine to this day. My black necklace broke faster but it’s okay I had another one. And I gifted my roommate and my boyfriend one of these necklaces and they love them."},{"name":"Kathy","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Nothing broke, came in a good package with a thank you card","review":"Very high quality packaging, the neckolace quality is something you would get from 5 below, crystals obviously aren’t real, the heart one is about the size of a penny, they give you the string so you can attach each one and choose what string. Received on time"},{"name":"Ace","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great for the price","review":"I put this on my wishlist and got it for Christmas and they are BEAUTIFUL. I wear them almost every day and they are great to accessorize with. They are such great quality for your money and I highly recommend buying them."},{"name":"dara","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great gift","review":"All of the crystals were very nice the necklaces I had to kind of just tighten a little bit at no big deal"},{"name":"Artie Hall","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Absolutely love","review":"Got a day early. I don’t have a photo of all the necklaces but I’m wearing this one rn :0 love these. Great quality especially for price"},{"name":"lori c.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" The stones are very nice!","review":"The stones themselves were surprisingly beautiful and nice quality. I can’t really speak on the chains that are included, as it’s a gift that has t been used yet. Even if the chains aren’t great, the stones are well worth the cost."},{"name":"Amanda","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great gift","review":"I bought this set for Christmas and split them up between a few girls as a little extra gift to go with their main gifts. Great quality and everyone was happy with them."},{"name":"linda hively","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" They are very beautiful and I gave them as a gift.","review":"My daughter loves all of the pieces and she even shares with me."},{"name":"LESLI CHRISTIE","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" A gift for your heart ♥️","review":"I’ve just come back from the post office.\nI went outside in the fresh air and sat underneath my Tree. (I wanted to charge my crystals in todays sunlight.) I sat down on the crunchy fall leaves, smiled, breathed deeply, and opened the beautiful red box. Inside was a Heartfelt note to me. It felt personal and I smiled as I read it. I then flipped the card over and read it again. These are Very pretty talisman 😍(in my opinion) and I love the care put into the packaging. Thank you so much! What a bargain for the joy it brings."},{"name":"KFjeld","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Very nice!","review":"I love this product, would have given a 5star, only one thing missing. A description of each crystal and the healing power behind them would be great for people who are new to Crystals"},{"name":"Linda Vespera","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Beautiful","review":"I buy this stuff all the time and this id one of the most beautiful sets ever! You simply cannot beat the price!! I absolutely love it and will buying this as gifts in the future!!!!"},{"name":"Monica Frigon","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" beautiful","review":"well made, only one is fake. (the white one)"},{"name":"Krystal B.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" I'm not sure?","review":"I'm pretty sure these pendants are all glass? Although very pretty. The cable chains aren't very secure. The first one I put on broke and fell off somewhere? Now I'm scared to wear any of the others."}]},{"id":"BqDYt3","title":"1/4 Carat Diamond and Oval Smoky Quartz Ribbon Pendant Necklace for Women in 14k Rose Gold (G-H/Fancy Brown, VS2-SI1, cttw) on 18 Inch Chain by LeVian","imageUrl":"https://m.media-amazon.com/images/I/81vbmlFNAGL._AC_UY395_.jpg","price":"$639.00","description":"Product Details\nMaterial\nMetal\nCountry of Origin\nChina\nAbout this Item\nELEGANT SIMPLICITY - This glamorous handcrafted 14 karat rose gold pendant necklace by LeVian features a cut and polished Chocolate quartz with an original checkerboard cut nestled inside the curve of a ribbon shape. An 18 inches long chain accompanies the pendant\nUNMATCHED QUALITY RING - Our high-quality standards are unsurpassed in the industry, and our items are sure to impress. We offer our own exclusive designs made from real precious metals and rare precious and semi-precious gemstones. This item is 100% 14k rose gold nickel-free, hypoallergenic, and 100% safe for sensitive skin. We check each item as it leaves our workshop to ensure it’s a piece we are proud of. You’ll love the level of craftsmanship of all our jewelry\nA MEANINGFUL GIFT - Our skillful jewelers handpick each gemstone and put them in complex settings to be sure that your jewelry will exceed your expectations. Making our Jewelry the Perfect gift - for a Special Occasion, an Anniversary, Birthday, Engagement, Valentine's Day, Mother's Day, Christmas, Wedding, Hanukkah, or just to show your love and care and are a classic gift for any Woman such as a Bride, Bridesmaids, Fiancée, Wife, Girlfriend, Daughter, Granddaughter or even a Grandmother\nA SPECIAL GEM FOR EVERYONE - Le Vian was founded to highlight the natural beauty of genuine gemstones. Shop our store to find the unique gem for every birthday, anniversary, astrological Zodiac symbol and star sign, and Biblical Hebrew tribe. Our meaningful jewelry is designed and made by hand by real people - skilled artisans who have polished their craft over a lifetime. We want everyone to learn about the incredible history, beliefs, and stories behind these exquisite stones\nYOUR SATISFACTION IS 100% GUARANTEED - All our items come with a gorgeous Gift Box\nSee more\nAbout this Item","totalReviewCount":"11 global ratings","averageStarRating":"4.4/5","reviews":[{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Lovely","review":"But a lot bigger than i thought it would be"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Gorgeous","review":"Birthday present to match ring."},{"name":"Charles A.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" Nice pendant. Chain was in at least a dozen knots.","review":"Pendant was beautiful but the chain was in several dozen tight knots. On a chain that thin it's almost impossible to untie. Might end up buying separate chain from somewhere else."},{"name":"Kindle Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" My wife loved it","review":"Bought necklace for my wife"}]},{"id":"uXpcPY","title":"36 Pairs Gold Earrings Set for Women Girls, Fashion Pearl Chain Link Stud Drop Dangle Earrings Multipack Statement Earring Packs, Hypoallergenic Earrings for Birthday Party Christmas Jewelry Gift","imageUrl":"https://m.media-amazon.com/images/I/81ho8aIItXL._AC_UX425_.jpg","price":"$12.79","description":"","totalReviewCount":"1,716 global ratings","averageStarRating":"4.4/5","reviews":[{"name":"Doni","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Good variety","review":"Great purchase for the variety. Quality to be expected with the price but you get some great pairs. This pack would also be good for those with double piercings !"},{"name":"Ivy","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect fashion jewelry","review":"Love the styles. Doesn't feel cheap. Good value for amount you get. I wasn't expecting much because of how cheap they were but I'm more than pleasantly surprised. We'll just have to wait and see how they do over time."},{"name":"Isandrina","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Muy nice","review":"Me gustaron los aretes."},{"name":"Elizabeth OBrien","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" THE BEST EARRINGS!","review":"I love love love these! Such cute styles and SO many options! Love that it comes with extra backs as well. The only downside is they don’t stay gold if you wear them often but what can you expect for the price point."},{"name":"Gheeti Nusrati","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" LOVe these","review":"I LOVE these earring sets!! They’re so cute and great for sensitive ears! The packaging and hand written note were a great touch!!!"},{"name":"Antwine jordan","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" GET THEM","review":"Love these earrings I paid 12$ for 36 pairs in love with all of them! Obviously fake but they are so cute ! 10/10🥰"},{"name":"Vallan Marie Lewis","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Super Cute","review":"They’re super cute but they fade fast so clear polish them"},{"name":"Noelle H","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Love!!!","review":"Omgggg so worth the money. You get so many different types of earrings and they’re all so cute. Could be used for many different occasions. Love this. Would definitely recommend"},{"name":"Jeremy Gaylor","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Exactly what you pay for!","review":"I was sooo unsure about purchasing these because it seemed unbelievably cheap for the amount of earrings you get, but, I Absolutely love every pair! Amazing deal if you’re looking for a variety of fake/cheaper gold earrings for a good price!! also came in a cute bag with this sweet hand written note :) really really happy! Thank you!"}]},{"id":"3yZs-C","title":"fxmimior Dainty Boho Gold Silver Chain Bracelets Set for Women Adjustable Fashion Beaded Chunky Flat Cable Chain Punk Bracelets Jewelry for Women Girls Gift Set of 4 (Silver)","imageUrl":"https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/61uBt8606zL._SY355_.jpg","price":"$8.60","description":"","totalReviewCount":"994 global ratings","averageStarRating":"3.9/5","reviews":[{"name":"Sam","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Cute","review":"Cute👍"},{"name":"elizabeth","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Good gift idea !!","review":"I am satisfied w/ the quay for the cost of the gift !!"},{"name":"Gary runion","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Worth the money","review":"Very pretty"},{"name":"alicia","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" No like","review":"El tamaño es pequeño, la calidad no es muy buena ."},{"name":"Barbk65","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Very cute!","review":"Very cute on, but very hard to get in and off. Wish there was an easier way!"},{"name":"JDizzle1001","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" I'm in love","review":"Very light weight and stylish. Also came with long extenders. Not exactly what I expected but it'll work!"},{"name":"Maria Lisa","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Boho Bracelets","review":"I ordered in silver and I just wasn't thrilled...gold probably looks much better. One bracelet was missing. Had to return as I don't wear gold."},{"name":"doccom","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" Looks cheap","review":"This is the first article of jewelry that I've bought from  that I don't like"}]},{"id":"WIMupf","title":"HELPFLOWER CH Handmade Fairy Simulation Butterfly Wing Earrings Foil Rhinestone Earring Romantic Jewelry","imageUrl":"https://m.media-amazon.com/images/I/61mmIJXwl4L._AC_UX385_.jpg","price":"$6.89","description":"","totalReviewCount":"457 global ratings","averageStarRating":"4.3/5","reviews":[{"name":"Momma3","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Cute","review":"I can’t give it 5 stars because one was broken I think it will be an easy fix but this should have been checked prior to shipping and was not damaged in transport it was packaged well. It is cute though"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Prettier in person","review":"These are just lovely in person! I will be looking to get other colors in the future!"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Excited but sad","review":"Very excited to get these. They’re gorgeous, but showed up broken. I will be keeping them and just supergluing the broken part on. Other than that, I love them"},{"name":"Destiny","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Not quite what I expected","review":"The pictures make them look more delicate and vibrant. They are cheap and plastic. They served their purpose but not what I was expecting."},{"name":"Nayeli","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" fragile","review":"These earrings are sooo pretty but very cheap/fragile. Mines fell on the floor and it broke so therefore be very gentle with them!"},{"name":"Lennys Mom","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Not sure of durability but….","review":"These earrings are adorable! I am a bit wary of the fragility but they are so gorgeous!"},{"name":"Alea Laughery","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Just what I was looking for","review":"These feel chunky, but they are really light. I dressed as the Ant Queen from Bug’s Life and wanted wing earrings to represent her wings. These were perfect. Just haven’t found other things to wear them with in my day to day life, so that’s the only negative."},{"name":"Emma Gold","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Magical!","review":"I already liked them when I saw them on the website. But when I got them in person I was about to cry (happy tears). They are so lightweight, carefully designed with detailed rhinestones and glitter and they look elegant. I bought them to wear to a fantasy-themed event. But, to be honest, I’ll wear them with jeans and a cute top as well! :)"}]},{"id":"cVT75n","title":"Tasiso Dainty Pearl Necklace for Women Tiny Pearl Pendant Necklaces Half Pearl Paperclip Toggle Necklace Barque Pearl Pendant Necklaces Pearl Chain Choker Necklace Simple Bridesmaid Jewelry Gifts","imageUrl":"https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/516G6GQmv-L._AC_UX385_.jpg","price":"$13.99","description":"About this Item\n♥Quality - This adorable trendy pendant necklace is plated in gold to ensure a long lasting finish that is nickel free, lead free, and hypoallergenic.\n♥Pearl Design - Reimagined with a modern design, timeless and stylish,Pair the pearl necklace with your casual or formal attire, it will spice up your clothes. Handmade Vintage Trendy Jewelry,baroque pearl style is such a statement piece\n♥Size -The length of delicate necklace is 14 inches with 2\" extender chain,, this gold pearl chain link necklace for women is simple enough for layering with other necklaces in your collection.\n♥Perfect Gifts - This dainty necklace can be given to your relatives and friends during the holidays, making it the ideal gift for women and girls.It's also great for dressing up for any occasion.Valentine's Day, wedding, Mother's Day, party, engagement, class, date, beach, home, office and daily life.\n♥Service - 90 DAYS FREE REPLACEMENT GUARANTEE: TASISO Jewelry is more than JUST jewelry - it’s our commitment to you for a pleasant shopping; Be it 30 days, or 3 months - you’ll get a new item from us FREE OF CHARGE if ever any of our jewelry break, fade,or simply don’t live up to your highest expectations; We’re TOP QUALITY Jewelry - Buy it once, own it for a lifetime.\nAdditional Information\nCountry of Origin\nUSA\nSee more\nAbout this Item","totalReviewCount":"150 global ratings","averageStarRating":"4.5/5","reviews":[{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect for \"Coastal Grandma\"","review":"Wore this in Hilton Head SC and felt super cute! Lasted after sea, salt, sunscreen, and pool time!"},{"name":"Bastet","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great gift for ladies with style","review":"I have this as a Christmas gift to two women who are hard to shop for and they were delighted with the pearl necklace."},{"name":"Haley Johnson","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Exactly as expected!","review":"I love pearls and wanted to incorporate them into my engagement photos. It worked out! This necklace is dainty and didn’t take away anything from me or the outcome of the images. Will certainly be wearing it again!"},{"name":"Priscila Rodriguez","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Beautiful","review":"My sister bought me this for my graduation and it one of my favorite necklaces I absolutely love it"},{"name":"Victoria","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Super cute!","review":"It’s super cute and just the right length. The only thing I would change would be the size of the pearls, they just seem a little on the larger side."},{"name":"kelsey","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" So cute","review":"I bought this for my boyfriend, and he absolutely loves it. It’s definitely masculine enough for him to wear, but I could also wear it too. The quality is high and comes exactly as pictured."},{"name":"W. M.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Sweet gift","review":"Perfect for young girls; sweet gift for June birthdays"},{"name":"Lady Diane","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very Kate Middleton, Princess of Wales (early days)","review":"I love this immalist satellite necklace. It is light weight. You can wear to the office, job interview, special event, or just every day. Also, a great starter piece to layer other necklaces with. This necklace reminds me of the Tiffany bracelet Kate Middleton, Princess of Wales use to where in her early days as a royal. She is my fashion icon ( I am a fan of the other royal women's fashion as well.). Reasonably price. It arrived in a short amount of time. It would make a great gift. I would recommend this vendor."},{"name":"Eva","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Muy lindo","review":"Se ve muy bonito. Espero que la cadena no se haga fea con el uso. Recién lo compré."}]},{"id":"u6grJx","title":"Dainty Layered Initial Necklaces for Women, 14K Gold Plated Paperclip Chain Necklace Simple Cute Hexagon Letter Pendant Initial Choker Necklace Gold Layered Necklaces for Women","imageUrl":"https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/513jmV-V1aL._AC_UX385_.jpg","price":"$14.99","description":"About this Item\nSIZE: Size of the gold paperclip chain initial necklaces is 18\"+2\" extension, and the layering paperclip chain necklace is 14\"+2\" extension, perfect dainty layered necklaces initial necklaces for women girls wear.\nMATERIAL: Made of high quality brass material, 14K real gold plated, nickel free and lead free, no harm to skin.\nLAYERING INITIAL NECKLACES: Gold layered paperclip chain letter initial necklaces set with hexagon charm, engraved with initial and heart in back and front, large initial pendant dainty necklaces for women teen girls jewelry.\nPERFECT GIFTS: Comes with an elegant free gift necklace box, perfect gifts jewelry for women girls teen girls wear....\nAFTER SALE SERVICE: 180 Days after sales service and exchange, reply you within 24 hours to solve your problem.\nSee more\nAbout this Item","totalReviewCount":"35,789 global ratings","averageStarRating":"4.6/5","reviews":[{"name":"Peyton","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Gorgeous","review":"Rose gold is probably my favorite thing in the entire world. So when I saw this, I knew I needed to have it. I’ve worn it 24 seven for about two weeks now and it has not turned my skin green or faded in color at all. I’ve even worn it in the shower, and it is still fine. I wouldn’t recommend showering with it, but I’m just saying that I do and the necklaces haven’t been affected. I have received many compliments on it, and was very satisfied with my purchase."},{"name":"Hillary","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" AMAZING AMAZING AMAZING!!","review":"I had actually ordered from this company before and got the gold initial bracelet (which is also very amazing). The quality of this necklace is unbelievable. It feels so expensive and looks amazing. I have worn the necklaces of course together as well as separate and I absolutely love it! It comes so nicely packaged. Hands down 10/10 recommend! It is so so so nice! Does not look cheap at all, does not feel cheap, nothing about it says cheap. So if you are giving it as a gift, it comes in a cute little black box and then each necklace is in its own back and then those bags are places in another bag. A small shinning cloth is in the box as well. It's incredibly nice. Love this company!"},{"name":"Brianna","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Good for price","review":"I’m very skeptical buying stuff off  especially jewelry and clothes. The color is very yellow gold and the material feels cheap almost like plastic. However for the price I love it. It adds a lot to a lot and I would recommend.\nI also got sent the wrong letter and this company sent me the right one immediately."},{"name":"Lacey","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Durable, but looks nice","review":"I have gotten soooo many compliments on my necklace. People were asking me where I got my necklace because they had paid a lot of money for theirs and theirs broke within the same day/week. I have a 9 month old boy who pulls on my necklace multiple times a day, and still staying strong with no issues. I love it and it is such little cost for this! And it looks so nice!"},{"name":"Kelsey Owens","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Love this set! Excellent as a gift!","review":"I’ve brought this necklace set 5 times now for friends and family. I get compliments every time I wear it! Can be worn separately as it’s two pieces, not connected. So far the gold hasn’t turned…quality seems great!"},{"name":"nicolle clark","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect","review":"I bought this to wear to a wedding and have worn it everyday since the wedding. I get compliments on it all the time. I shower with it on and it has not changed or tarnished. Amazing for the price. Love wearing the smaller chain by itself too."},{"name":"EiMadeULook","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Trendy","review":"The gold is deceiving - looks a tiny bit more rose gold than other gold necklaces I have, which makes it hard to mix and match with other necklaces. I do like that they are separate necklaces and not attached."},{"name":"Laura young","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Cute necklaces","review":"I will say these necklaces are very cute! However, if you have sensitive skin, they may not be for you. I do not like taking necklaces on and off again, and this necklace tends to leave me with rashes because of it. Otherwise, good quality necklaces."},{"name":"Anita Bock","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Lovely","review":"Love this necklace set, seems to be lasting well without discolouring so far"},{"name":"Shirley Heng","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Good quality Jewelry. Value for the the spend.","review":"As advertised. Looks like the pic provided. Good quality and came nicely packed. Will be great as gift. A lot of details put into this precious handmade Jewelry."},{"name":"Anonymous","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Amazing quality, I’ve had so many compliments!","review":"I love love love these necklaces!"},{"name":"Molly","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Beautiful necklace","review":"So lovely, great quality.\nWorth the money have bought more necklace's from this collection."}]},{"id":"XNpYRk","title":"LOUISA SECRET Infinity Heart Necklaces for Women Gold Plated and 925 Sterling Silver Infinity Forever Love Pendant Necklaces, Birthday Anniversary Jewelry Gift for Her Wife Mom","imageUrl":"https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/714PBmyw8RL._AC_UX342_.jpg","price":"$109.99","description":"About this Item\n💕Sparkling and symbolic: This infinity heart necklace combines the symbol of infinity and eternity with a heart. The uniqueness of infinity is that it has no beginning and no end, so it symbolizes eternal love. It can be romantic love, friendship and family bonds. This is the perfect gift to let her know that you will always be with her and love her forever.\n💕Versatile and eye-catching: This birthstone necklace has cubic zirconia which is Valued for its sparkling appearance and beauty. It is made of 925 sterling silver, 18k gold plated, Nickel-free, Lead-free, Cadmium-free and Hypoallergenic. Chain length: 18+2 inches, Gift Box Package.\n💕Perfect Gift for Women: This forever love heart necklace has an elegant and unique look, easy to match with a variety of clothes, perfect jewelry to expand a female's fashion wardrobe. It's a great gift for yourself, your wife, lady, friend, girlfriend, partner, daughter, sister, grandmother, or mom.\n💕Elegant and unique: A blend of romance & elegance, the infinity heart necklace easily helps you exude class, personality, and grace whenever you wear it. Whether it's a birthday, Valentine's Day, anniversary, wedding, Mother’s Day, Christmas Day, graduation, or any special occasion.\n💕After-sales service: 12 months of no artificial damage, full refund, or free replacement guarantee. If you have any problems with jewelry for women, please feel free to contact us.\nSee more\nAbout this Item","totalReviewCount":"38 global ratings","averageStarRating":"4.7/5","reviews":[{"name":"Mary","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Gorgeous","review":"The Packaging Was Superb, The Necklace Is Absolutely Gorgeous. It Was A Gift Too My Girlfriend, She Was Absolutely So Proud And Happy. 23 Year's Together. Absolutely Most Beautiful Piece Of Jewelry. Boxed Beautifully. With Cleaning Cloth. Very Impressed."},{"name":"Lee","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Birthday Present","review":"I bought this for my wife’s birthday, and she loved it."},{"name":"Mike D.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great value!","review":"Beautiful craftsmanship. She was very happy with it."},{"name":"Kesich Family","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Perfect For Anybody!","review":"This necklace gives the perfect sparkle with an infinity loop leading to a larger stone. The packaging keeps the necklace secure as to not tangle the chain on the necklace. This is a necklace I would recommend."},{"name":"Dean D","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Stunning","review":"This birthstone charm and necklace is absolutely stunning. There is a great amount of detail on the heart as well as the infinity symbol in the middle. The gemstone is a perfect clarity, I’m not sure if it’s genuine or if it is manufactured but it is very beautifully made. The necklace could be a little bit thicker it is most definitely a petite necklace. And the length of the necklace overall is a good length. I gave this four stars because I would just expect it to be a little higher quality of a necklace, however the charm itself is absolutely stunning as I mentioned and high-quality."},{"name":"Shawna Kay","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Beautiful necklace","review":"This necklace looks just like the picture and is very dainty and beautiful. The chain is the right length too."},{"name":"crystal peppe-kinard","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Purple heart","review":"My favorite color and a gorgeous necklace"},{"name":"Serena H.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Shiny!!!","review":"Beautiful heart necklace with a red stone. Nice and shiny pendant that comes with long chain. Very gorgeous to wear with any outfit off your style. Perfect gift idea that any woman would love to have. #FoundItOn"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very nice","review":"Very nice"}]},{"id":"cBAUQr","title":"Sea Glass Necklace, Wire Wrapped Beach Necklaces with Starfish Pendant, Freshwater Pearls, Sea Glass Jewelry, Handmade Necklaces Gift for Women Girls","imageUrl":"https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/61F-z5vlCjL._SY500_.jpg","price":"$19.99","description":"Product description","totalReviewCount":"77 global ratings","averageStarRating":"4.4/5","reviews":[{"name":"Catherine","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Beautiful BUT no extension option as advertised","review":"Necklace is really pretty but chain is only 18 inches. They advertise a 2” chain extension but the extra 2 inches has no clasp so you can’t actually make the necklace longer. I brought it to wear as a 20” necklace."},{"name":"Brett","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Wife Loved It!","review":"Bought it for my wife before we go to Mexico. Thought it would compliment her outfits. Gave it to her for Christmas. She loves it! Be careful though, it's very delicate."},{"name":"CMC","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Pretty","review":"Granddaughter loves it"},{"name":"K Kline","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Beautiful","review":"This beauty made for a wonderful gift for my 10 year old granddaughter."},{"name":"Urmi J","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Excellent jewellery quality","review":"This necklace is very cute and good quality. I liked the length as it's not too long or too short and fits perfectly to pair with outfits. This jewellery is versatile and can be used for western or beachwear outfits. It has a Boho vibe and is fun to wear."},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very pretty and same as shown in the picture..Absolutely Loving it","review":"I used this product for wearing it as a necklace and it beautifully matches and suits me.."},{"name":"Ashley S.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Even prettier in person!","review":"This necklace is beautiful! The pictures don't do it Justice! Good quality, good price!"},{"name":"mary nell southard","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Nice color","review":"Blue glass fell off necklace. Will try to repair."}]},{"id":"8jxjoZ","title":"Lanzer 925 Sterling Silver Jewelry for Women,18K Rose Gold Necklaces for Women,Birthstone Diamond Heart Pendant for Christmas,Anniversary Jewelry Gift for Her Wife Mom,Girlfriend Necklaces Gift for Valentine’s Day","imageUrl":"https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/71EFA6zcpfL._AC_UY445_.jpg","price":"$119.99","description":"","totalReviewCount":"30 global ratings","averageStarRating":"4.7/5","reviews":[{"name":"Sherry Hayes","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Looks Great","review":"This necklace is smooth and feels and looks as though it is made from quality materials. Our daughter really likes the look of it and the pretty stone is not fake-looking."},{"name":"pete c","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Good looking necklace!","review":"Got this for my wife and she was delighted by it! She's a big fan of pretty much anything Rose gold so I knew I had a winner on my hands from the start. The photos in the listing match what I got perfectly. The necklace was about the size I was expecting, not a ton smaller than what I thought or hoped I was getting. The writing is a font I can actually read and the birthstone has a brilliant color to it and just looks perfect.\nThe only thing I'm concerned about is the longevity of the necklace. Since this isn't a Kmart special, I'm hoping the rose gold doesn't wear off very quickly, or at all for that matter! Time will tell and hopefully I'm not adjusting my review in a few months!\nOther than longevity, I have no concerns or complaints about this necklace."},{"name":"George A.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Beautiful sterling silver chain","review":"As stated, the sterling silver chain is beautiful, but the actual pendant or heart was not of high quality silver. The lab grown stone is beautiful. However, I would say definitely decent quality. The chain is of what is highest value"},{"name":"kim","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Beautiful","review":"I gave this beautiful necklace to my grandma for her 71st birthday, and she loved it!! She is into birthstones, so I knew it would be perfect. I didn't get to take a pic of this one, but I have posted a picture of my January birthstone in another review. Now she and I have matching birthstone necklaces. It made her feel very special since recovering from a stroke."},{"name":"Mandy","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Beautiful necklace!","review":"This necklace is beautiful and shiny.\n\nAbsolutely great materials were used when making this.\n\nWill last for a long time with good care.\n\nLove the gift bag and jewelry box that was included.\n\nPresentation means so much.\n\nThis isn't a cheap necklace and is very elegant.\n\nDefinitely an eye-catcher!"},{"name":"Travis Robinson","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Gorgeous","review":"This necklace and pendant are absolutely gorgeous and great quality for the price! The clarity of the birth stone and of the pendant overall is just GREAT! Packaged very well and is very giftable in original packaging. The chain is thin and dainty, but still durable and sturdy. Very comfortable to wear."},{"name":"brownsugars","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" November","review":"This is absolutely gorgeous and so beautiful and great quality for the price. It looks and feels expensive, the stone is just lovely. Came with beautiful packaging if you need to gove as gift but I'm keeping this one for me."},{"name":"Jeannie MacNeil","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" December Baby","review":"My birthday is 12/7, and I got this necklace for ME! It's just lovely, and looks far more costly than it, um, costs. The chain is quite thin, so I hope it never breaks, but even if it does, it'll be worth replacing. The heart charm is just the right size, and the stone is nice and clear. Very happy with my birthday present!"}]},{"id":"Z3aF-Y","title":"DUMBEN Hidden Message Bracelet - Meaningful gifts for Women, Great Friend Gifts, Unique Friendship Jewelry, Perfect Birthday Gifts for Women Freind BFF Sister..…","imageUrl":"https://m.media-amazon.com/images/I/61xPBOms2JL._AC_UX342_.jpg","price":"$12.89","description":"","totalReviewCount":"3,777 global ratings","averageStarRating":"4.8/5","reviews":[{"name":"Kiara Noah","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect gift","review":"I got 2 of these as gifts. One for my sister, one for my best friend & I absolutely love them. I love that it comes with a little card too."},{"name":"bcrox","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Absolutely perfect gift","review":"Cute durable funny and at the same time sweet I bought 3 and they all loved them!"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" great","review":"its super cute and the packaging is pretty good. its worth the money for sure."},{"name":"Spruillie03","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Wish I Had Gotten it for Myself","review":"I bought this as a gift. Not only did she love it, but I really want one for myself. It's super sturdy and heavy, but still dainty"},{"name":"Carly Rae","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great gift.","review":"I have a great bunch of girlfriends. I got one for all of them. Very affordable and they all loved it."},{"name":"Brandy Weinstein","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great Gift","review":"Came just like the pictures showed, in the box."},{"name":"Catherine King","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" It was delivered with care","review":"I love this for my sister because we always say this"},{"name":"Janine Harrison","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" My best friend loved it! Nicely made. Very happy!","review":"Well made perfect gift!"}]},{"id":"owdRGB","title":"LOUISA SECRET Love Heart Birthstone Necklaces for Women 925 Sterling Silver Rose Gold Pendant Forever Diamond Jewelry Valentine's Day Christmas Anniversary Birthday Gifts for Wife Girlfriend Mother","imageUrl":"https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/71ZMhsF4QqL._AC_UX385_.jpg","price":"$89.99","description":"About this Item\n💗【FOREVER LOVE HEART NECKLACE】The double-heart design symbolizes love for each other and everything that goes with it, in a fashionable way. The love heart birthstone necklaces for women with a gemstone pendant makes your relationship stronger and is the good choice to express your love for her on special day. And the meaning behind the design makes it a sentimental gift for that special someone. I LOVE YOU FOR ALWAYS AND FOREVER !\n💗【925 STERLING SILVER MATERIAL】Pendant size for the love heart necklaces women : 0.87\"ⅹ0.85\" | Zircon size : 0.3\"ⅹ0.3\" | Chain length : 17.72\"+1.97\". The pendant and the chain are made of 925 STERLING SILVER with rose gold plating. These safe materials are hypoallergenic and antioxidant and won't rust, fade, corrode, tarnish or turn your skin green. GIVE YOU A BETTER PRODUCT EXPERIENCE ！\n💗【12-MONTH BIRTHSTONE MEANINGS】EACH MONTH IS REPRESENTED BY 12 DIFFERENT COLORED BIRTHSTONES. A gem-quality cubic stone is embellished in the middle of the pendant, with high precision and fine cutting, it reflects extraordinary brilliance. The wearing of rose gold necklaces for women also can be bring good luck, health, and protection. MAKE YOUR DEAR EVERY MOMENT MORE BEAUTIFUL !\n💗【IDEAL GIFT FOR YOUR DEAR】A necklace like this will never go out of trend – it mixes the past trend to the present and future. A sparkling women diamond necklaces would best express your feelings towards your beloved and would make a perfect Birthday, Mother's Day, Valentine's Day, Christmas, Wedding, Engagement, Anniversary, Thanksgiving Day gifts for girlfriend, wife, mother, her. IT'S A GREAT IDEAL ROMANTIC JEWELRY GIFTS FOR YOUR LOVER.\n✅【1 - YEAR QUALITY SUPPORT】THE JEWELRY FOR WOMEN IS “NOT ARTIFICIAL DAMAGE” WITHIN 12 MONTHS FOR A FULL REFUND OR FREE REPLACEMENT. The beautiful gift box for storing rose gold heart diamond necklaces that will prevent scratches and damage. If you have any questions about the women necklace jewelry gift, please feel free to contact us. DON'T HESITATE TO BUY NOW !\nSee more\nAbout this Item","totalReviewCount":"51 global ratings","averageStarRating":"4.6/5","reviews":[{"name":"randall c turner","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Beautiful.","review":"This is a Christmas gift for my wife. This is a very classy elegant piece of jewelry. It is more beautiful in person than the pictures on line. The packaging is also very high quality."},{"name":"R. A. Piekarski","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Gorgeous!","review":"A beautiful yet relatively inexpensive piece of jewelry that made my wife very happy."},{"name":"Shawn T.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Beautiful design and looks great.","review":"This was a Christmas gift and the fact that it also represents birth stone makes it extra special."},{"name":"Blessed","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" beautiful","review":"The necklaceis nice and a fair price"},{"name":"Mervin Hamilton","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Love it","review":"My wife love it"},{"name":"robert rubino","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" To small","review":"To small"},{"name":"LearningPhotography1245","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Great Package and What a Sparkle","review":"The necklace was well packaged so that it would not flop around during shipping. Not all companies take this extra step, sometimes leading to knots in the chain. Not so with this thing!\n\nThe light catches the birthstones quiet well and they just sparkle. The charm, with the stone in the center, is appropriately portioned and it presents very well. My only complaint - why it is listed as a 4 instead of a 5 - is the chain. It is not the most sturdy in the world but I do appreciate the clasp they attached to it.\n\nNot a bad little birthstone set for you."},{"name":"Terry","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Well Crafted","review":"This necklace will be an extra birthday present for my wife. I don't know much about jewelry, but I know enough to know that it looks really good! I got the April birthstone (not her birthstone) because her month wasn't available and I'm so glad I did. Looks like a real diamond to me. Nowhere in the seller's description or on the box does it say what the stone is. I'm guessing topaz? It's somewhat smaller than I imagined, but she doesn't like large jewelry anyway. I've looked at it with a magnifying glass and the cut is neat. No shoddy worksmanship at all. It's packaged elegantly and I'm certain she'll like it."}]},{"id":"Gxrjzz","title":"PAVOI 14K Gold Plated Crystal Birthstone Bar Necklace | Dainty Necklace | Gold Necklaces for Women |","imageUrl":"https://m.media-amazon.com/images/I/51QZVt8RWoL._AC_UX385_.jpg","price":"$13.95","description":"About this Item\nFEATURING - This Dainty choker necklace showcases a Crystal November Birthstone.\nCRAFTED - The necklace is 18\" long plus a 2\" extender and is finely crafted with a 14K Yellow Gold Plating to ensure a long lasting and brilliant finish.\n✦ 90-DAY GUARANTEE ✦ Your happiness is our number one priority. To ensure your complete satisfaction, we offer a hassle-free 90-Day money-back guarantee. To get in touch, email or chat with us - a member of our team will be happy to help you.\n✦ SUSTAINABILITY ✦ We’re committed to protecting the planet. That’s why every piece of PAVOI jewelry is crafted with 100% recycled materials and we package in 99% recycled and compostable materials. We are proudly carbon-neutral and completely offset our plastic consumption by removing over 275,000 plastic bottles from our ocean annually. Learn more about our sustainability efforts here.\n✦ PROUDLY AMERICAN-OWNED ✦\nSee more\nAbout this Item","totalReviewCount":"2,568 global ratings","averageStarRating":"4.5/5","reviews":[{"name":"Alazae","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very surprised!","review":"This is a really good necklace. I’ve had it for on for a good while and there is no green around my neck what so ever and I have forgotten to take off at time and I have it on with me in the shower sometimes. It’s very durable and Is very classy and simple. I most definitely will be buying my mom and sister one for Christmas."},{"name":"Cheryl DiAntonio","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Delivered on time for Christmas","review":"Gift for my niece. She loved it!"},{"name":"Carolina Mead","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Cute thing","review":"Very cute!!! I loved it."},{"name":"maggie13","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great so far!","review":"I bought this to replace my “through thick and thin” friendship necklace from another brand because the finish was worn on the other necklace. The price of this necklace was great, and it seems to be of good quality so far!"},{"name":"PR","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect dainty necklace","review":"I refuse to hop on the initial letter necklace train. This is perfect, can wear it with anything. Very dainty and simple. Could easily wear with other necklaces. Seems like great quality for the price! Easily a personable giftable gift for someone. I love it."},{"name":"Chrissy C","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Nice quality","review":"This would make a great gift for a young girl. It's cute and dainty. The gold is a beautiful color and looks real. Very well made. My only complaint is that it is too light weight for me. If you are on the thinner side then this necklace will fall around your neck perfectly. If you are on the chunkier side, then it won't lay correctly and you may end up trying to adjust it all day long which can be annoying. But overall a great product, quality and very beautiful. I've gifted this item to 2 young girls and they loved it :)"},{"name":"MorganB","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Long lasting.","review":"Has not turned my neck green. Minor to no scratches. Can wear in the shower."},{"name":"La","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Worth it","review":"I'm allergic to fake jewelry but this one is worth it! It's a little small but it is worth it"},{"name":"Jennifer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Bonito","review":"Muy bonito delicado y sutil, se ve muy bien y llegó rápido."}]},{"id":"T7nUOv","title":"MONOZO Gold Initial Bracelets for Women, Dainty 14K Gold Filled Layered Beaded Letter Initial Bracelet Personalized 26 Alphabet Disc Monogram Charm Bracelet Jewelry Gifts for Girls","imageUrl":"https://m.media-amazon.com/images/I/71errqQgxyL._AC_UY395_.jpg","price":"$14.99","description":"About this Item\nSIZE: Layered Gold Initial Bracelet 6”inner diameter +2\" Extension chain, with a satellite beaded chain bracelet make a layered Gold Bracelet or to simply to wear on its own.\nMATERIAL: Dainty Initial Bracelet is 14k gold filled, nickel and lead free, sturdy and durable. Never fade ,rust and tarnish. Gold initial bracelet never turn skin green.\nWOMEN BRACELET: Gold disc letter bracelet is packed with love in a lovely Jewelry Velvet bag, ready for gift giving on every occasion, Birthday, Wedding, Mother's day, Thanksgiving Day, Valentine's day, Christmas day, and Anniversary, gifts for bridesmaids, Wife, Girlfriend, Mother, Daughter, other women and girls.\nINITIAL BRACELET: This unique gold bracelet is made of hand stamped personalized initial disc charm. you can choose letters to signify your name, favorite initials, parent's names, children's initials, special phrase, or anything else meaningful.\nAFTER SERVICE: 100% Satisfaction! No Hassle, Full refund or exchange within 90 days of receipt of purchase.\nSee more\nAbout this Item","totalReviewCount":"1,652 global ratings","averageStarRating":"4.5/5","reviews":[{"name":"Sharon","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Bracelet is so cute","review":"This bracelet is soooo cute! I got this for myself with my boyfriends initial on it and I love it! Definitely my style I just wish it didn’t move around a lot even when you put it to the tightest setting and I wish the bracelet was just one big piece instead of two separate bracelets because then it kinda tangles. But it’s prefect!"},{"name":"Limor","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Nice gift , very gentle and cute","review":"I liked the gentleness, came with a nice box and a cute card."},{"name":"karen","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Sweet!","review":"Delicate and classy. Adjustable too!"},{"name":"Larry Woods","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" My daughters loved them","review":"My daughters loved them, they both said they would cherish them forever."},{"name":"g","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Pretty","review":"The packaging was very well done and the bracelets came out better than I thought they would !"},{"name":"Nana","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very pretty","review":"This is a present for my granddaughter it’s very pretty I know she’ll like it."},{"name":"Reader lmf","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Cute and inexpensive","review":"For a jr high (or younger) girl, really cute. Nice small gift for Christmas. Will it last forever? No. Would an older girl or woman wear it? probably not."},{"name":"Robert & Debbie Chatman","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" So cute","review":"Dainty and so cute. Love these little gold bracelets. Perfect gift for ladies of all ages."}]}]