[{"id":"aBtX4-","title":"Statement Heart Pendant Necklace In 25 Sterling Silver Jewelry For Women.","imageUrl":"https://m.media-amazon.com/images/I/61sB99-BKJL._AC_UX385_.jpg","price":"$33.17","description":"Size: Flexible and adjustable size, suitable for adult men and women.\nMaterial: Made of 925 sterling silver. Not easy to allergic, not easy to oxidize. This necklace has moderate hardness, skin-friendly and comfortable, not easy to deform, soft and durable.\nDesign: This necklace is perfectly designed, meticulously crafted, and finely polished. It's glamorous, elegant, gleaming and smooth, and it's trendy and versatile.\nFunction: It can enhance your charming and elegant temperament, increase your beauty and imagination! Can be matched with any style of clothing and accessories.\nHigh-quality after-sales service: uninterrupted 24-hour high-quality service.","reviews":[]},{"id":"y2b7ac","title":"925 Sterling Silver Love Heart Pendant Necklace Cuff Stackable Bangle Bracelet Jewelry Gifts for Women","imageUrl":"https://m.media-amazon.com/images/I/51OyZ4L4zLL._AC_UY395_.jpg","price":"$65.00","description":"About this item\nWELCOME To Jewelry Web August 2022 Fine Jewelry Gifts Offering; 925 sterling bangle bracelets in sterling silver ; Width: 2.25MM ; Height: 13MM ; Hypoallergenic ; Nickel Free\nThis heart bangle bracelet is a great gift for a heart love friends relationship admirer and is hand-wrapped in a beautiful jewelry gift box.\nSATISFACTION GUARANTEE: To ensure you are completely satisfied with your purchase, we offer a 45 day money back guarantee! Your satisfaction is our #1 Priority! Please contact us with any issues; We understand Value-for-Money and we will do our best to resolve it quickly. ; This item does not ship with a chain\nMETAL PURITY: All of our jewelry are manufactured from High Quality Premium Materials; Gems; Faceted Stones; with authentic metals and Hand-Stamped for Authenticity to pass FTC regulations on jewelry. They are solid stamped ;14k ;Yellow Gold ;White gold ; or stamped; 925 ; Sterling Silver\nCOLLECTION THAT IS YOU; We hope that this collection can help you enhance your everyday fashion; decorations; color; and statement, while you celebrate your most memorable occasions","reviews":[]},{"id":"Xth_qr","title":"Leafael Women’s Silver Plated Infinity Love Heart Pendant Necklace with Birthstone Crystals, Jewelry Gifts for Her, 18 + 2 inch Chain, Anniversary Birthday Mother's Necklaces for Wife Mom Girlfriend","imageUrl":"https://m.media-amazon.com/images/I/71mcsYMN6QL._AC_UX385_.jpg","price":"$39.99","description":"Lobster closure\nHeart Silver Necklaces - Our Infinity Love heart necklace for women is an original design from our studio in Boston and features a precious Austrian birthstone crystal. All of our jewelry products are polished by hand.\nDelicate Fashion Jewelry Gift that Fits - This woman’s necklace is adorned with a 0.75 x 0.88-inch Light Sapphire Blue birthstone for March and December. They are rhodium plated and designed with an 18-inch chain plus 2-inch extender, and a lobster claw clasp.\nStrict Safety Standards - These birthstone charms and love gifts meet rigid safety standards. Our jewelry collections pass European 1907/2006 REACH Regulation Annex XVII Item 23,27, and 63, and are lead free, nickel free, and allergy free.\nCrystal Necklace for Ladies Like You - Honor your inner royalty with this unique crystal heart pendant necklace. Presented by Miss New York - Nicole Kulovany, this heart necklace is a regal, symbolic statement piece that unveils your feminine spirit.\nThoughtful Gifts for Women and Girls - Looking for exceptional birthday, anniversary, holiday, Christmas, Valentine’s Day, and Mother’s Day gifts for your wife, mom, sister, daughter, or girlfriend? Each Leafael necklace is stored in an elegant white, silver-embossed gift box and gift bag, making it an ideal ladies necklace for the special women or girl in your life.","reviews":[{"name":"T. Prentice","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" My necklace turned green","review":"I strongly advise NOT to purchase this necklace. Within 6 weeks of wearing the necklace it tarnished and turned an ugly green color. It was a gift to my mom for her birthday. I was completely embarrassed. Do not purchase this for yourself and DEFINITELY NOT for a loved one."},{"name":"Roberto R.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" It Does not worth a dollar","review":"After 2 weeks of use my girlfriend send this pictures to me, I feel so bad because I give her this necklace as a gift and I know it will not be the finest necklace, how ever I certainly hope that It will last longer than 2 weeks, nothing on this necklace worth the shame.\n\nI've learn my lesson... never buy jewelry online!"},{"name":"SnarkyTexan","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Buyer Beware","review":"My fiancée had gifted this to me for Christmas. I was excited as the color and setting is beautiful. I noticed the metal looked cheap. I didn't see 925 or any karat notes for the quality of the metal. So I checked the post on  before I decided to wear the item 24/7 as I do with gifts from my SO. I was surprised to find that the necklace has a description of “white gold plated\" but further down in the details it says brass plated rhodium. No. This is not worth $50! My poor fiancée, who is not very technologically inclined, got duped into purchasing a $10 item for 5x its value! I returned the item immediately before it started turning colors and showed its true value.\n\nShame on you seller, for your wording. Be honest about what you're selling. Karma will get you eventually."},{"name":"Andrew","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" I received nothing","review":"I purchased this for mothers day as a gift for my mother. When I opened it imagine my surprise when inside there was a little plastic bag with 2 broken metal pieces, no heart, nothing. Very upsetting. Idk what happened but I'm doing a return"},{"name":"stacy jenkins","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Valentine's day gift","review":"It was a Valentine's day gift and she loves it. Told me she got compliments from everybody who saw it!"},{"name":"Jorge","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" No sirve","review":"No sirve duro una semana"},{"name":"D.B.H.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Stunning beauty.","review":"I got this for my wife and she absolutely loves it. The only minor thing is that it tends to flip over exposing the back of the necklace."},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" My Birthday gift to myself","review":"This is my birthstone and my favorite color. I get the most compliments on this necklace. I wear it almost every day"},{"name":"Peter Evans","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Nicely made jewellery","review":"A gift to my wife for a wedding anniversary which she was delighted to receive. Not the sort of thing I would normally buy online because it’s the kind of gift that you need to see touch and feel but was pleasantly surprised at the quality of the product… lots of house points for me"},{"name":"Pam Carr","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Lovely Jewelry item","review":"Bought this pendant necklace for my friends birthday and she was very pleased."},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Gorgeous","review":"Great colour and lovely quality pendant. The chain is flimsy, I threw that away."},{"name":"mrs j m vine","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect stone","review":"What great present to get it comes in great sealed box."},{"name":"Mo","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Lost its shine after first use","review":"Not worth the money paid for."}]},{"id":"5DaOc6","title":"LANTAI 16-20 Pairs Trendy Acrylic Earrings Rattan Earrings for Women-Summer Beach Straw Woven Earrings Resin Leaf Dangle Drop Earrings Geometric Statement Earrings Vacation Jewelry","imageUrl":"https://m.media-amazon.com/images/I/71Cjr-ryvpS._AC_UY395_.jpg","price":"$21.99","description":"PACKAGE - One set 16 pairs earrings including 3 pairs rattan earrings, 1 pairs metal earrings, and 12 pair mottled acrylic earrings. Each pair of earrings is individually packaged.\nHYPOALLERGENIC MATERIAL - They are made of high quality material. Lightweight and durable, which won't burden your ears. Lead free, nickel free. Anti-sensitive, reduce skin irritation.\nFASHIONABLE EARRINGS BULK -Unique rattan dangle earrings, trendy mottled acrylic earrings enough styles to meet your summer earring needs!\nAPPLICABLE OCCASIONS - These bohemian style earrings are perfect for daily life wear as well as parties, weddings and celebrations. Unique design matches different styles of clothes, which will makes you look more charming and elegant in the crowds.\nPERFECT GIFT - The exquisite earrings are are specially designed for women and girls. You can give them to your girlfriend, wife, mother, daughter, as a gift for Valentine's Day, Mother's Day, Graduation, etc.","reviews":[{"name":"dpayne1973","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" As described, good value","review":"For the price you pay, it's a good value. 9 earrings, which I will probably wear all of them. The ones I might not wear are the ivory rattan/tassels, because the posts are bright white. I may paint them to match, it just doesn't look right together, imo. A lot of reviews say the rattan doesn't match on the sets, mine does. Or that they break easy, so time will tell. For what you pay, even if you wore 2-3 pairs, it's worth it."},{"name":"Kristin P","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Best gift to give","review":"I bought this gift for a friend who loves to dress up and go on vacation. These are such a great variety and quality with small plastic packaging for each set and enclosed in a perfect plastic hard case for traveling. I think I’m gonna have to buy some for myself now too I love them."},{"name":"Pat","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Lovely Statement Earrings","review":"I love these so much I bought my best friend a set for Xmas. The value, quantity, and quality is amazing for the price."},{"name":"Juliejkirk","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Super cute and doesn’t matter if you lose one!","review":"These are fun + colorful, great variety. They make a great stocking stuffer or a gift add on… Quality is comparable to the price, but I give a 10/10 based on this. Perfect for dressing up a casual outfit or a beach day, etc."},{"name":"Ligia","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Nicely packaged! Very Cute!","review":"Bought these for a cruise and wasn't expecting much. I was pleasantly surprised."},{"name":"WWAD","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Earnings earnings and more earnings","review":"Totally worth the money. So fun for vacations, trips with other girls and being able to share and style a new pair every night!!!"},{"name":"Sunni Hart","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Earrings go with every outfit!","review":"I absolutely loved this product! I’ve never been a dangling earring person but these earrings are just awesome to wear! These are a must buy!"},{"name":"Rebekah F","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Love these!","review":"Super cute!"}]},{"id":"Mhzsxz","title":"Chargances Bohemia Gold Moon and Stars Necklace for Women Fashion Gold Choker Necklace Delicate Moon Stars Jewelry for Women and Girls","imageUrl":"https://m.media-amazon.com/images/I/61o0GWQJ8TL._AC_UX385_.jpg","price":"$8.98","description":"❤Material: Rhinestone, Alloy Wire in a very high quality.\n❤ Handmade: Perfect workmanship, We use the traditional craftsmanship to create your unique, subtleties show the ingenuity.\n❤Unique and fashionable design works well with your daily outfit,Can wear it with many things go to many occasions.Such as Valentine’s Day, Christmas’ Day, Mother’s Day,Thanksgiving Day,Birthday, wedding, party, anniversary, prom and casual days.Acrylic Acetate Drop Earrings ,give you charming look and win more compliments\n❤Best gift choice for family, friends, and your girlfriend,or any girls you love on any thoughtful date that you want to keep in memory\n❤100% satisfaction and money back guarantee. If you have any questions, contact us at any time.","reviews":[{"name":"Charles Stansell","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Good quality","review":"Quick delivery and gold quality."},{"name":"Rhonda","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Nice","review":"Looks nice"},{"name":"X~tina D","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" 2 peice necklaces : (","review":"I was disappointed when I received this. I thought it would have more \"sparkle\" to it. You have to make the chocker very tight in order for it to not fall forward. That would be too warm for the Summer months I bought 2 but I'm returning both. Their not what I thought they would be. I was going to gift one, but I don't think my friend would like it either :( sorry."},{"name":"Pat","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" Actual items look cheap","review":"I chose this set because I love the design, the looks. But upon arrival, the material looks so cheap, something I could have picked up at a dollar store! I don't know how long it will last before it turns green. I would be willing to pay more for better quality."},{"name":"Andrea","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Looks cheap","review":"This item doesn't look as expensive as pictured. The stars and moon placement makes them lay funny. Also as a plus size this did fit tighter than expected."},{"name":"rowanwynn","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" You het what you pay for","review":"Just got it today...looks just as cheap as it was. Probably not even worth returning for the cost."},{"name":"Tiffany Besserman","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Cute for the money, top layer won't sit right.","review":"Cute design but the top layer doesn't lay right. It ALWAYS turns upside down."},{"name":"Lanna","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" very cheap material","review":"it didn’t fit right and it didn’t look like the picture and the material was so cheap Not worth buying so disappointing 🤨"}]}]