[{"id":"ZCn_fq","title":"PAVOI 14K Gold Plated 3mm Cubic Zirconia Classic Tennis Bracelet | Gold Bracelets for Women | Size 6.5-7.5 Inch","imageUrl":"https://m.media-amazon.com/images/I/610VsCaFMXL._AC_UY395_.jpg","price":"$15.45","description":"About this item\nTennis bracelet featuring round 3mm AAA+ cubic zirconia stones in four-prong basket settings. Measures 7.0 inches in Length\nCubic Zirconia set in Lead-free, Eco-friend and hypoallergenic setting. This stunning bracelet is then Gold Plated to ensure a long-lasting and brilliant finish.\n✦ MADE WITH LOVE ✦ This unique and heartfelt product is beautifully packaged and ready for giving. Makes a sentimental surprise for any awesome lady. Great gifts for Mom or Grandma on Mother's Day, anniversary, birthday, or wedding celebration.\n✦ 90 DAY GUARANTEE ✦ To Ensure Your Complete Satisfaction, We Offer a 90 Day No-Questions-Asked Money Back Guarantee. All the metals we use are lead free, nickel free and hypoallergenic. Excellent customer service. PAVOI 100% guarantees your satisfaction.\n✦ PROUDLY AMERICAN OWNED ✦ We are an American owned and operated company! Please search PAVOI on  for more of our designs!","reviews":[{"name":"Mike Seymour","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" 🔥","review":" This thing is so bomb, especially for the price!! A little tip- for amazing sparkle use a disposable mascara wand and Jo Malone hand soap and gently scrub the CZ/diamonds. And then to keep costume jewelry from tarnishing, spray it with a polyurethane clear coat. Thank me later :)"},{"name":"Lana Rhee","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Makes me feel like a million bucks","review":"Beautiful! I feel like a princess when wearing this. Such great quality at affordable prices. Absolutely recommend"},{"name":"Brooke","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Surprised","review":"I bought this to start stacking with my smartwatch. I'm very glad I did. It hasn't faded, no stones have come out, and hasn't turned colors."},{"name":"MercedesMom","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Beautiful bracelet!","review":"This tennis bracelet is amazingly realistic looking. I have a 6 carat REAL diamond tennis bracelet and in a way this \"imitation\" is prettier because the stones are more like PERFECT diamonds which are not found in the average diamond tennis bracelet. I purchased this inexpensive bracelet to wear in situations in which I would not feel comfortable wearing my REAL diamond bracelet. I am interested to see how long this bracelet remains nice looking and holds up to normal wear since it is such an affordable price. I hope the gold plating and construction of the bracelet will hold up. But for now, I can say the bracelet is beautiful and very believable if a diamond tennis bracelet of this size is within your budget range."},{"name":"Nicole Ernst","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" GORGEOUS!!!","review":"Absolutely GORGEOUS!! I have really small wrists so I ordered the 6.5\" in white gold, and it fits PERFECTLY!!!! I can't wear this bracelet enough. It's so pretty! Doesn't look cheap and can be casual yet classy at the same time. I'm definitely happy with my purchase. It looks just like the product picture shown, and has zero defects.\n***If helpful, please click 'Helpful'*** :)"},{"name":"Tara","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great Clarity Prong Set Tennis Bracelet - Matches my real Diamonds","review":"Such a beautiful piece! Was contemplating buying a real tennis bracelet during a sale at my jewelers... Stumbled upon this and saved myself thousands. It really does look like a real tennis bracelet with true clarity diamonds. Not like a regular tennis bracelet though, but exactly like those set on prongs so that even though it’s a small CT count, the diamonds look extremely large. A really nice optical illusion. this bracelet nails it! Matches my real diamond bracelet and doesn’t dull down the clarity of the real diamonds - making for a perfect match that no one can tell apart. Definitely going to buy a few more so they can look like stackables! Absolutely buy if you’re contemplating!!"},{"name":"Queen","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Really Nice!","review":"Tennis bracelet is nice, worth the price. Has a nice shine to it, I kinda wish the gold was a little darker; just my preference. It is really nice otherwise."},{"name":"Suzie Q","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Sparkly, but not durable","review":"This bracelet really sparkles, and I love the size of the stones, but I fear it will not hold up to much wear. My biggest concern is the stiffness the bracelet. Other tennis bracelets I own lay flat on the dresser. But this one has to lay on its side, curled up. If I were to force it to lay flat it would definitely break. The links also kink and \"catch\" on each other and if I don't work them loose careful, again, I am sure it would break. I decided to keep the bracelet and just take extra care, but I'm not expecting it to last long."},{"name":"Yuliana","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very sparkly!","review":"Read lots of good reviews about this bracelet and decided I need it also. It's very very sparkly! Not sure though about it looking like read diamonds as one lady wrote about silver one...\nOn photos I took on Pandora bracelet for comparison, as for me smaller stones would look better on this bracelet. It's bit not my taste so presented to my sister and she loves this bracelet!"},{"name":"Cliente ","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect!","review":" Stunning! I’ve been searching high and low for a tennis bracelet but didn’t want to break the bank plus these often come in very big sizes and my wrists are small, this one fits me perfectly (6,5 inch) hope it holds up nicely over time :)"},{"name":"Angela","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great quality and sparkly","review":" Excellent quality, well made and very sparkly. Looks sparkly and complements my jewellery"},{"name":"Essex Musician","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Looks more expensive","review":"Very pleased with this pretty bracelet. Nice quality cubic zirconias but not too flashy to wear every day. Good strong clasp which is easy to fasten."},{"name":"jo","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" excellent value","review":"I thought this bracelet was excellent value for the cost. It is very good quality compared to others i have bought, small and sparkly, it looks like the real deal!"}]},{"id":"B2tIdH","title":"Kendra Scott Ari Heart Adjustable Length Pendant Necklace for Women, Fashion Jewelry","imageUrl":"https://m.media-amazon.com/images/I/61U8x7kHtgL._AC_UY500_.jpg","price":"$65.00","description":"Delicate and Dainty: If you love to layer or gravitate towards simpler styles, this piece is perfect for you. You won’t get tired of the Ari Heart Adjustable Length Pendant Necklace, because it was made with everyday wear in mind.\nColorful: We’ve never shied away from incorporating color at Kendra Scott, and with the Ari Heart Adjustable Length Pendant Necklace in your jewelry box, the perfect pop of color is never far away.\nDetails: This necklace measures 0.49 L x 0.57\" W Pendant On 15\"L Chain With 2\" Extender.\nGift Box & Jewelry Bag: Your Kendra Scott Jewelry will arrive pre-packaged in a genuine branded gift box and jewelry bag. This necklace makes a perfect gift for Valentine’s Day, Christmas, your wedding anniversary, Mother’s Day and birthdays.\nHow to Care for Your Kendra Scott Jewelry: To protect the plating, remove your jewelry prior to hand washing, swimming, exercising, cleaning, and before applying any kind personal body products. Maintain your jewelry’s high shine by avoiding contact with soap, perfume, lotion, makeup, hair & cleaning products.","reviews":[{"name":"Ryan Thompson","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Presentation is horrible in plastic bag!!","review":"The description of this necklace says that it becomes in a beautiful jewelry bag and Kendra Scott box. However, it comes in a plastic bag that could easily damage the necklace. Not only does this look horrible for a piece of jewelry by making it look cheap I was giving it as a gift and now I have to go find a box to put it in. If you were going to state in your description of how it will arrive please make sure you do this. Obviously I did not read the reviews before I purchased this but I wish I had because I seem to not be the first person. Please send item correctly!!"},{"name":"Brittany","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Love!","review":"I wear this necklace everyday! It hasn’t changed colors in the shower or at the beach! Super cute and dainty looking"},{"name":"Jan","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Two different necklaces as gifts to siblings, one came with box and one without","review":"Ordered the Gold-Iridescent Drusy first and soon after the Rhodium-Ivory mother of pearl. The Gold-Iridescent Drusy was prettier even than pictured, and came with a box (as advertised), so we expected a repeat performance of customer satisfaction.\n\nWhen The Rhodium-Ivory Mother of Pearl arrived it came without a box, and is lovely though almost plain next to the Drusy. So now we have two necklaces for two girls who will be opening their gifts together, which means we can't use the lovely gift box--such a waste. It really does make a difference in terms of a wow factor being able to gift this in its box... the inconsistency was disappointing enough to give it three stars on this go-round.\n\nAlso, a P.S.-- I just noticed before writing this review that In the picture of the box and bag it says \"All genuine Kendra Scott jewelry will come with a bag and a gift box\". This makes me wonder if this is a fine print way of saying \" some of this is not genuine\". Buyer be aware-- if you want a guaranteed Kendra Scott treatment, just buy direct from their website--sometimes it is worth it to forego convenience for guaranteed quality. You have to decide when that's the case for you.\n\nP.P.S- Just looked into it and found that the first was delivered by Jewelry Pro, the second by Zappos. Upon reading the merchant's credentials, Jewelry Pro proudly states that they are the only authorized Kendra Scott merchant on . GO DIRECT THROUGH JEWELRY PRO if you want the box. Everything else will be a toss up."},{"name":"Velma J Laird","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Arrival","review":"This is a birthday gift for my oldest grand daughter she has not seen it yet so I hope she likes it. I am very satisfied with delivery cost and the necklace thank you"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Recommended","review":"Beautiful color. Excellent quality. Nice to get product with complete satisfaction. My daughter will love this."},{"name":"D L Roach III","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Pretty","review":"Bought for my wife for Valentine’s Day. Was a good gift. Chain and heart are on the smaller side. Would be perfect for a child as well."},{"name":"Noa","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Adorable!","review":"Such a cute and simple piece! I receive so many compliments every time I wear this necklace. It also never tarnished, I wore it in the shower for weeks!"},{"name":"JOSEPHINE FRASER","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" DAINTY AND SWEET NECKLACE!","review":"Very dainty and adorable necklace! I just wish the chain was a bit longer. It’s a perfect length if you like chokers but I wish chain extension was a couple of inches longer. Other than that, it is perfect!"},{"name":"kailey","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Favourite necklace","review":"Haven’t taken it off since I’ve bought this necklace! Probably my favourite necklace! It matches with everything! Danity, which I love as well"}]},{"id":"-JZwUd","title":" Collection 14K Gold Round-Cut Diamond Stud Earrings (1/4-2 cttw, J-K Color, I2-I3 Clarity)","imageUrl":"https://m.media-amazon.com/images/I/71LJMHvcWJL._AC_UX500_.jpg","price":"$403.00","description":"Classic solitaire studs featuring diamonds nestled in four-prong settings and screw-on backings\nCarat weight listed is the total for both studs\nAll our diamond suppliers confirm that they comply with the kimberley process to ensure that their diamonds are conflict free\nMade in the USA","reviews":[{"name":"JSM","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great Little Studs","review":"I ordered the .25 ct pair. I am not experienced in the world of diamonds honestly, but they are as pictured. I think they’re beautiful and better than I’d hoped actually. They were a gift to myself, so thank you, me!!"},{"name":"Weagle99","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" The left earring looks like it’s half diamond half quarts rock fused together","review":"Received item today, returning tomorrow. The left earring looks like it’s half diamond half quarts rock fused together. I am extremely disappointed and can’t for the life of figure out how someone would look at these earrings and think they were worthy of selling. The left earring is beautiful, but I didn’t order this for one earring. I will update this when the issue is resolved; for now 1 star only and that’s because I have to click at least one."},{"name":"Brad O","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very impressed!","review":"I bought these for my wife for her birthday, replacing a pair she had lost several years ago. Having been in the jewelry business for the first 20 years of my adult life, I was prepared to be disappointed. I must say, when they arrived and I looked them over, I was very impressed! They are a least as good a quality as represented if not better. No flaws visible to the naked eye and no noticeable hint of color. I didn’t measure them, but they seem a little “thick”, making them a little smaller in diameter then they should be. For the price, you have to expect to give up something, but overall I still say five stars. They brought my lovely wife to tears."},{"name":"david mazzilli","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great Value and Great Quality","review":"I bought these earrings for my wife. I was not 100 percent sure about ordering earrings online but I have never been so happy with a purchase. There couldn’t have been better quality earrings purchased anywhere else. I would 100 percent recommend these to anyone interested in buying earrings. One of the best purchases I have made in jewelry in a long time and I will definitely purchasing from this collection again!"},{"name":"Elizabeth Jackson","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Sweet small studs for second piercing","review":"Love these and leave them in the second piercing pretty much all the time. Classy, very nice looking and I wanted a small diamond stud just for this purpose-perfect! I did lose one right away and read that someone else did too so make sure they’re screwed on the back well. My pet sitter actually found it on the bathroom floor-I was shocked but it’s shiny!"},{"name":"CEmons","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Nice earings for the price","review":"I bought the 1/4 carat earrings for my wife for Christmas. They arrived on Christmas eve, just in time for her to open. The 1/4 carat were a bit too small for her so I returned for the 1/3 carat studs which she liked much better. The threaded stud takes a bit getting used to but hopefully will prevent them from falling off."},{"name":"Leslie","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" I love them!","review":"Absolutely beautiful! Speedy delivery and just as described. I just wish the box they came in was better quality as I bought these as a gift for my daughter."},{"name":"Brian Caceda","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" ... got these earrings for my girlfriend's birthday and she loved them. Perfect gift for any special occasion","review":"I got these earrings for my girlfriend's birthday and she loved them. Perfect gift for any special occasion, very reasonably priced, and great quality. The diamond is perfectly sized, the sparkle is brilliant, and the earrings look great on her ears."},{"name":"DE","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Not certified - full of inclusions","review":"These maybe 1/3 ct, the size is what I expected, but the quality is bad. That and there's no AGS number, just a made in USA sticker.\n\nYou can see one stone (right side) has two big 'bubbles' right in the center. The inclusions were big enough I could see them with the naked eye, the loup confirmed how big it was\nThe second has smaller specs and the both look pretty yellow.\n\nIf it was certified I may have kept them but will be returning."},{"name":"pondscum","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Beautiful Studs","review":"These earrings are so pretty. Very sparkly and good quality. Cannot tell the difference between them and my \"Jeweler's diamond pendant\". These same size earrings at my jeweler's were priced at $1300.00!!. Great color and they have screw on backs so you won't be losing them. I will most certainly be buying another size of these."},{"name":"Coton de Tulear","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" I almost lost an earring when the screw on back fell off and I lost it. How can I get another back?","review":"They are beautiful. No obvious mistake or colour. To my husband and I they are perfect.\nAnyone who says they are yellow, too small.....do not trust these comments, they are beautiful diamonds. Thank you"},{"name":"barbara a","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" suprised","review":"I am happy with this purchase..I was not expecting them to be quite this nice...with a 10 times magnifyer you can see the clarity is not the best but that is normal for earrings..the flat surface of them looks colorless...so a more expensive colorless diamond would not look much different.....for the price these are a good buy"},{"name":"carminaburana","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Nice earrings 💕, but no certificate for diamonds","review":"I really love these earrings but I dropped a star because the posts are so thin and the butterfly stops are really tiny so they are rather difficult to put on without the risc of loosing the tiny pieces. Plus these diamond earrings come without any documentation/certificate, so how can you be sure they are really 2x25k diamonds."}]},{"id":"f5X5p_","title":"Lucky Brand Womens Pearl Delicate Necklace","imageUrl":"https://m.media-amazon.com/images/I/61ybG60d+QL._AC_UY695_.jpg","price":"$69.99","description":"Double-layered necklace featuring faux-pearl halo pedant and Y-shaped strand with faceted-bead finish\nImported","reviews":[{"name":"Carol","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great for teen","review":"Our teenage granddaughter is ready for nicer jewelry and Lucky Brand works very well. 'This is a very nice necklace and she loves it."},{"name":"Stacy lynn","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" I love this necklace","review":"I love this necklace. It is just the right length and the chain is of great quality. I get many compliments on it."},{"name":"Kindle Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Gift","review":"My sister loved this necklace"},{"name":"Terry S","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Love it!","review":"I love my necklace. I put it on have not taken it off since I got it. That was a month ago."},{"name":"kdelga2","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Loved the style","review":"Lightweight, delicate and cute. Love it"},{"name":"Seville Soto","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Beautiful Necklace","review":"Lucky brand jewelry is always worth the buy!"},{"name":"Levette","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Nice style","review":"These shoes are great style and very comfortable..runs a little big"},{"name":"Quality Control","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Beautiful necklace","review":"Gorgeous necklace, my girlfriend loved getting it for Christmas"}]},{"id":"zplZDt","title":" Collection Sterling Silver Pressed Flower Teardrop Earrings","imageUrl":"https://m.media-amazon.com/images/I/81VJABO2RgL._AC_UY575_.jpg","price":"$31.90","description":"Unique translucent teardrop-shape earrings featuring real dried flowers preserved in resin and surrounded by sterling silver settings\nThe natural properties of real flowers provides a one-of-a-kind look to each piece. The image may show a slight difference to the actual flowers in color and composition\nGrown in the fields of Taxco, Mexico, these miniature flowers are gathered by hand and preserved permanently in resin\nFishhook backings\nMade in Mexico\nThese silver pieces are built for longevity. This piece features a metal plating or flashing, or an electrocoating for a more lustrous appearance, but it can wear off with long-term or heavy use. To ensure the longevity of your plated items store your jewelry in a dark, cool, dry place such as a pouch or air tight box and avoid rubbing plated items together. Also try to avoid exposure to cleaning products and perfume which can both negatively affect your items. Your local jeweler can advise you where to send your jewelry if you would ever like them replated.\nAn  Brand","reviews":[{"name":"NYUser83954","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Blue-flower earrings: Very nice earrings. I recommend them.","review":"I ordered the blue-flower earrings as a gift. They look very nice, and they are very original. While the blue is not quite as bright as it appears in the listing's photo, it's still very nice looking in person, and I would recommend buying it. I have uploaded a photo of what I received so you can see for yourself."},{"name":"Dan","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Beautiful! Immediately re-ordered after seeing first pair.","review":"Bought a pair for my wife, upon receiving them I immediately re-ordered a second pair to give to my mother. They are awesome and both women get compliments on them when they wear them. The flowers look great in there, very very similar to what is pictured. The colors are super versatile and go with a lot of clothing. My wife doesn't wear a ton of dangly earrings - usually just studs, but these are perfectly sized. They aren't super huge and our infant doesn't grab them... which is nice - ouch!"},{"name":"Adriana","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" NOT GOLD OR SILVER POSTS. Tarnished after two wears.","review":"NOT GOLD or silver POSTS. I have always had an allergy to fantasy jewelry. Sterling silver and gold never make me have an allergic reaction. I even wear a gold earring that I never take off and have never had an allergic reaction. I wore these earring twice and the posts already began to tarnish and also began giving me an allergic reaction. So if you are expecting the posts to be gold or silver, be warned that they definitely ARE NOT. Really disappointing and false advertising. Especially since the earrings themselves are so beautiful."},{"name":"Michelle Comer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Gold overlay is not good - Metal turned colors","review":"I had bought these and the silver pair (beautiful by the way) for a couple of friends for Valentines Day. I got sick and had to cancel. Since then, their gifts have sat undisturbed in my bedroom. This morning, when I went to look at them, I noticed the \"gold\" ones had turned all different colors. So cheap. I scheduled dinner with my friends for this Friday and now I only have one set (silver) to give. I wish I could exchange them for another silver pair, but it doesn't look like returning them is an option due to the return time expiring. I'm so sad, but glad I didn't give them to my friend and them turn colors on her!"},{"name":"Kindle Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" A delightful surprise!","review":"I wasn't sure what to expect when I ordered the earrings. I knew by looking at various jewelry that there was often a disclaimer that the colors were more vibrant in the picture to enhance their appearance (*hint hint* to those complaining about this upon first seeing them in person) hence why I didn't put high hopes on them. I'm an optimist but image enhancement is a modern day reality. Oh well.\nTo my delight they were just as beautiful as the image. They are very light weight to the point I forgot I was wearing them until my daughter pointed that fact out when we were laying down for her bedtime story (several hours later). I was initially concerned about them not having backs but with the way the wire is curved they don't slip out. I kept them in until I was ready to turn in myself. They were that awesome! I will be wearing these over vacation in a few weeks since they match all my outfits to a T.\nI will most likely use backs while on vacation since it will be taking place in a large amusement park. Besides that, I don't think they're absolutely necessary. May differ from person to person though."},{"name":"Robin","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Lightweight; stoppers missing (& definitely needed!)","review":"I was on the fence as to whether to give these 4 or 5 stars. I gave them 4 because I have some concern about their longevity. Mine arrived in a black box, but completely loose -- shaking around loose in the box, having not had rubber stoppers put on the ear wires to keep them in place, or to help keep them on your ear (these totally fall off if I don't wear stoppers with them -- look how short the ear wire is! One fell off the first day I worked them without stoppers and a coworker found it on the floor). Totally unacceptable way to package these. Also, there is a small clear \"bump\" of plastic on the back of one of mine. It doesn't effect the appearance, since it's on the back, but still, not a good thing.\n\nAnyway -- I will say, to me they look exactly like the photo. The flowers also show up when I'm wearing them. However, I have fair skin and blonde hair...if you are lucky enough to have beautiful, rich, darker skin, and lovely chestnut brown hair, they may not show up as well. I posted a picture of the pair of earrings, one is placed against a darker background, one against a piece of white paper -- you can see how the background color affects how well you can see the darker color flowers. So, the yellow flower earrings may show up better against darker skin and hair (I'm not sure which the blue would work better with). I actually think they would still look lovely on anybody, because they're dangling in the air -- people will still be able to see the flowers.\n\nOne note -- these are NOT heavy. They aren't glass, they're plastic (or maybe acrylic or resin?). They feel warm to the touch like plastic or acrylic does, not at all cold like glass. They are also way too light to be glass -- they're so light, I can't even tell I'm wearing them, unless one swings and brushes against my neck slightly.\n\nAnd I HATE heavy earrings -- these are super lightweight. Just make sure to find a pair of rubber earwire stoppers or they will fall off!"},{"name":"Anna Miller","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" truly beautiful and unique","review":"I given these earrings as a present from a close friend. They are some of the most beautiful pair of earrings I own. My mother passed away in 2015 and her favorite flower was blue hydrangeas. I was nervous because I don't wear dangly earrings but once I put them on I knew they were perfect. They are perfect for casual and dressy. Very subtle and dressy at the same time. I absolutely love them; I was an art major and I appreciate different jewelry so these are perfect not to mention that it has meaning to me. I would highly recombined them!!!"},{"name":"LucienP","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" Arrived tarnished.","review":"Earrings arrived very tarnished. Bought as a Christmas gift for my wife but that backfired... Will definitely return as these are clearly not 14k gold plated on silver like they claim. Gold plated wouldn't tarnish like that. The flower part looks great however."},{"name":"tony","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" terrible came in a zip lock bag.","review":"2nd I bought first pair came in a black box. 2 ND set a cheap zip lock bag. I like the product but to try to as a gift in a zip lock bag it will look as if it a peice of junk. I won't be able to gift them. I will have to locate something else. Very disappointed"},{"name":"Sydney T.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" I was really pleased when they arrived and they were packaged carefully","review":"I purchased these for a friend for her birthday and she loooooves them. They look stunning with blue eyes! I was really pleased when they arrived and they were packaged carefully. I was really really hesitant to purchase them based on some reviews that said the colours weren't vibrant and/or the silver was tarnished, etc., but I'm so happy I did buy them, because my pair didn't experience either of those."},{"name":"Vancouvergal","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Deceptive looking in pictures","review":"I bought this from the  Deals and regretted it. I wish I had returned it but forgot. It's quite ugly and tacky in real life. The silver parts already looks tarnished. It is brand new but it looks like something someone found behind grandma's couch. Depending on what you wear, it does not go as well with an outfit as expected. I do not recommend this."},{"name":"Tiffany","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Nice earrings but overpriced for value","review":"Priced too high for the quality. I would have felt better about this purchase if these were priced 20 to 25% lower than what they are currently listed at. The glass in the earrings is not as smooth or lustrous as shown. Earrings are not symmetrical. The packaging is an oversized black felt box which doesn't show off the style of these either so not ideal for a gift. I still think the earrings are pretty and I look forward to gifting them, but overall they are overpriced. If priced more fairly I would rate them higher probably a 4 or 5. Earrings are stamped \"ATI 925 Mexico\"."}]},{"id":"F0av0N","title":"NINE WEST Women's Boxed Necklace/Pierced Earrings Set, Silver/Blue, One Size","imageUrl":"https://m.media-amazon.com/images/I/81M9zZH2xwL._AC_UY500_.jpg","price":"$69.99","description":"Necklace: L-16 in x W-0.4 in x H-0.8 in, Earrings: L-0.8 in x W-0.4 in x H-0.4 in\nBoxed Jewelry Set - Necklace and Earrings - Classics","reviews":[{"name":"sandra","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" BEAUTIFUL JEWELRY","review":"love this set of beautiful blue jewelry. OKAY IT'S NOT EXPENSIVE, BUT IT LOOKS EXPENSIVE..."},{"name":"Cara","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very pretty but","review":"Packaging was great. Value for money was great. The necklace set was so pretty"},{"name":"Carissa","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Beautiful","review":"It is wonderful! My daughter LOVES it!"},{"name":"Roger H.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Nice!","review":"Very sparkly and very well priced for the money. Quite attractive -- both the necklace and the earrings."},{"name":"Tina","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Beautiful","review":"Beautiful,and look expensive"},{"name":"NaeeNaee","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfection","review":"This was a perfect addition to my daughter's prom glam!! She loved it and it looked amazing.. it was well crafted for the price and was exactly as described!"},{"name":"Brenda Riggins Segafredo","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Gift","review":"When i was going thru Christ\nMas I found it. Very beautifully done."},{"name":"Tammy Wilson","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Beautiful and worth the money","review":"Absolutely gorgeous set!!!"},{"name":"cody francis","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Save your money","review":"Really cheaply made. Looks like its spray painted silver. Looks good from far. No where near worth the price its at. Returning to get something better."},{"name":"LaLocaDeLasGatas","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Un detalle para tu outfit","review":"Son un bonito regalo o auto-regalo. Ojo: no son de oro, ni tampoco tienen piedras preciosas. Pero se ven muy bonitos, y son ligeros. Por el precio, están súper bien. Además, son duraderos: no se les caen las piedras ni se rompe la cadena."},{"name":"Sue","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Tacky","review":"Way too shiny and fake looking. I can’t wear it. Looks like something a child might like to wear. I don’t recommend this for any adult."},{"name":"Mel M","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Bueno para regalo","review":"Lo compre a muy buen precio y lo utilizaré para un regalo"},{"name":"Laurie","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" So beautiful","review":"Stones look darker on site than in person but beautiful"}]}]