[{"id":"xO7JzS","title":"Ring Pop Hard Candy Pops, Variety Pack, 40 Count","imageUrl":"https://m.media-amazon.com/images/I/81OtNspO4aL._SX385_.jpg","price":"$69.99","description":"About this item\n40 pops\nEach individually wrapped\nWrapped in a printed sealed bag\nMany flavors\nNow including raspberry lemonade flavor","reviews":[{"name":"Catherine S.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Fed Ex shipping is the worst!","review":"Great prize candy but delivery is through Fed Ex who threw my package out at the open gate over 500 ft from my house! Laziest drivers around!"},{"name":"mini 1123","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Expect to possibly not get exactly what you ordered.","review":"Bought the 40 original, received this 44 mixed pack. Not mad, pleasantly surprised. None were completely shattered; though I can tell quite a few have a some chips out of the rings because of some sound coming when I shake the bag. All in all I received 5 tongue painters, 5 pink mystery, 1 blue mystery, 4 sour cherry, 2 sour watermelon, 9 original strawberry, 9 blue raspberry and 9 berry blast."},{"name":"Monica","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Kids love them","review":"These are exactly what we expected and the kids love them!"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Nice variety","review":"Nice variety for prizes. Kids love these!"},{"name":"Thomas Carlisle","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Brings back memories of my childhood","review":"Grand baby loves."},{"name":"Lord Mastodon","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" will be handing these out for halloween this year. ...","review":"will be handing these out for halloween this year. may also reenact captain planet \"our powers combined\" dialogue. whoa, I'm at work now and I swear one of my coworkers just started talking about ring pops while i was writing this right now. i blame the NSA. i must log off now to avoid capture. god speed"},{"name":"HLStudent","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Ring Pops!","review":"You know what's cooler than a ring pop? 40 ring pops. These are authentic hunks of crystallized, flavored sugar on a child-sized plastic ring, with the circular plastic guard so you don't get sticky hands. There are three conventional flavors (red, green, and blue) and two mixed flavors. The mixed flavors are more opaque and will stain your mouth, which could be a plus or minus."},{"name":"Ray ray","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Best ring pop","review":"Grandson loves them"}]},{"id":"rk1ytE","title":"ZOKU Ring Pop Molds, 8 Easy-Release Gem and Heart-Shaped Ice Popsicle Molds with Ring Sticks and Drip Guards, BPA-free","imageUrl":"https://m.media-amazon.com/images/I/71F3Cp2k3NL._AC_SY450_.jpg","price":"$19.99","description":"About this item\nPops slide out of the moulds easily straight from the freezer, no need to warm the mould first\nReusable pop sticks have ridged designs that allow pops to adhere securely\nSet Includes: Ring Pop Mold, 8 Sticks w/drip cups, Instruction Booklet\nBPA and phthalate free","reviews":[{"name":"Austin","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Don't lose the rings!","review":"I wish the rings were sold separately. Other than that, my kids love them! I like to use yogurt, then wait for it to freeze. Then I use a layer of juice or something, sick the rings in (they have to be level) and boom! They each get a ring everyday. Meanwhile, I have used about 1 serving of yogurt and one juice box, for all 8! Super Dad!"},{"name":"MyReview","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Expensive but worth it","review":"I bought this to make small healthy desserts when I fancy something sweet after dinner. They're the perfect size and are easy to remove from the container. I don't know why but there are about eight small screws in the underside of the unit. I can see these rusting over time but I make sure I dry the areas properly after washing to try and prolong the life. This is pricey, but I've not seen them advertised in the shops so I think it's worth it. I was a bit worried it would be too big for the tiny freezer compartment in my under counter fridge freezer but it fits fine with plenty of room to spare. Go for it!\n\nIce lolly ideas:\n\nChocolate / Strawberry / Banana milk\nAny type of yoghurt\nSquash\nHome made or shop bought fruit smoothies\nMelted chocolate and strawberry chunks (yummy but not healthy!)\nJuices"},{"name":"J Macs","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Not difficult to extract the lollies at all. A ...","review":"Not difficult to extract the lollies at all. A little awkward to clean and dry but when done swiftly after use and tipped over a few times while drying it gets the job done. I suffer with issues in my hands so really struggle with many jobs and the ease of extracting the lollies balances the small extra effort to dry it. Possible some screws may rust in future but they are not in contact with the food storage parts."},{"name":"mr k minnett","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" No replacement holders available","review":"Very good, but if your children loose the holder or bin it by mistake you can’t get replacements."},{"name":"Mizzvee","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Cute!","review":"Who doesn’t want a gem shaped ring on a hot day?\n\nMy LG thought these were the best things ever, she wasn’t wrong."},{"name":"Adri h.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Best lolly maker for babies and kids","review":"Wouldn’t change it for anything! I make these ice creams with full fat yogurt and my baby loveeees them"}]},{"id":"31U-Qv","title":"Funko Pop! Rides: Lord of The Rings - Witch King with Fellbeast, Multicolor","imageUrl":"https://images-na.ssl-images-amazon.com/images/I/61hCI4MxCtL.__AC_SX300_SY300_QL70_FMwebp_.jpg","price":"$37.38","description":"About this item\nPackage dimensions: 6.0\" L x 7.0\" W x 8.0\" H\nThis pop Ride is perfect for any Lord of the Rings fan\nCollect all Lord of the Rings items from Funko\nMade in Vietnam","reviews":[{"name":"Colton","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Witch King & his fell beast","review":"Lord of the Rings is one of my favorite movies and I was so glad that Funko decided to make a pop of the witch king and his fell beast. The detail on this pop is amazing and really well done."},{"name":"Malaura Ashley","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" This is so AWESOME!","review":"I am an avid collector of the vinyl pops. I display them in their box (unless they are common then I do take them out). I have had plenty of incidences where the product box comes damaged which affects the value. I was excited to open the box to see the condition of the box and vinyl pop was in great condition. I love the detail and overall product appearance!"},{"name":"Kirby","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Showpiece of the collection.","review":"This Pop Vinyl was well packaged and protected. Arrived in mint condition. Looks flawless.\nVery happy with my purchase.\nA lot bigger than I expected, which I'm happy about. Will look great on my display shelf.\nDefinitely recommend this pop."},{"name":"Daniel","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Awesome","review":"Watch out stupid Frodo!!!!!"},{"name":"Draw4Luv","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Nazgul-riffic!","review":"I have a lot of Lord of the Rings figures, including the Funko Pops... This may just be my favorite! Nice size, great detail, perfect balance of whimsy and Funko terror!"},{"name":"icepunch","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" This piece looks epic","review":"I love it and already got a compliment from a friend out of nowhere. I guess it just stands out because it is kinda big for a FUNKO. I'm really happy with it."},{"name":"Denise","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Love my fellbeast pop!!","review":"Love these movies and I love this pop! It looks even better in person. Excited to add a new Lord of the rings pop to my collection."},{"name":"Travis","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Excellent Figure","review":"Honestly, this is one of my favorite Funko pops that I've gotten to date. It's one of the few that have very high quality and detail. Worth every penny."},{"name":"Bernie","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Bought as a gift","review":"Arrived in perfect condition and my nephew is going to love it. Bought for a Christmas present."},{"name":"Buyer01","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" A nice addition","review":"Fast Delivery and in perfect condition. Love it."},{"name":"Oliviero Del Grosso","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" Came damaged","review":"The product itself is great, given the low rating because it came slightly damaged"},{"name":"ClaudioSnake333","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Compra 100% recomendada para fans de LOTR","review":"¿Qué puedo decir?...¡Me encanta!\n\nHasta el momento es mi funko favorito, la verdad esperaba que fuese mas pequeño, pero cuando llego quede asombrado por el buen tamaño de la figura; además de que el jinete es desmontable de la criatura.\nCabe resaltar que la textura del \"Fellbeast\" esta muy bien lograda, las alas, las escamas, el casco, dientes, en fin...muy hermoso.\n\nEl \"Witch King\" no se queda atrás, ya que cuenta con muy buenos detalles, destacando principalmente su yelmo.\n\n¡Anexo fotos del producto donde se puede apreciar mejor la figura!, pero hay que destacar que no es lo mismo verlo en fotos que tenerlo físicamente...se ve mejor ya teniéndolo en manos.\n\nCompra 1000% recomendada.\n\nEl paquete llego en tiempo y forma."},{"name":"Tania00","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Estupendo!!!","review":"Fue un pedido para darle una sorpresa a mi compañero, que desde que lo vio por internet se enamoró al instante. La figura es impresionante. Pesa, y ahí se nota la calidad, la figura se puede quitar, es un funko pack. Está muy bien realizada con muy buenos detalles, ya que he visto otros funkos de personajes que no han logrado el aspecto y no se parecen. Pero este sí. Me ha encantado."}]},{"id":"GCa_HS","title":"POP! Movies: Lord of The Rings/Hobbit - Frodo Baggins (Styles May Vary)","imageUrl":"https://images-na.ssl-images-amazon.com/images/I/61Od4zcvIcL.__AC_SX300_SY300_QL70_FMwebp_.jpg","price":"$15.80","description":"About this item\nPackage length: 10.16 cm\nPackage width: 12.7 cm\nPackage height: 19.05 cm\nProduct Type: TOY FIGURE","reviews":[{"name":"callidora7","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great Pop for any LotR fan!","review":"UPDATE\nMy local Toys R Us received a shipment of the LotR Pops! this morning and I was lucky enough to be able to purchase the rest of the line, other than the Balrog. As I can't review the rest of the LotR Pops! as they haven't been released on  yet, I just wanted to share a few photos of them in this review. I'm very happy with Samwise, Gandalf, Saruman and the Nazgul. I think Funko have done a brilliant job with the LotR line and I would even go as far as to say they're some of the best Pops! they've ever made, and this is coming from someone who has hundreds of them. Their molds and paint jobs are perfect, and they look just like the characters from the films - just in cute Pop! form. Samwise Gamgee is holding The Phial of Galadriel, otherwise known as Light of Eärendil, which glows in the dark and is such a cool little detail. I also really like the detail on his backpack where they've given him his pots and pans. I should also add that Saruman's palantír is made of an almost clear (but isn't because of its dark maroon color) plastic which has an appropriate shine to it - a nice little touch. I mention in my review of Frodo below how he is slightly smaller than a standard Pop! I've now added a photo of Samwise standing next to Gandalf just so you can see the difference in height, even if it is minimal.\n\nAll in all, these LotR Pops! come highly rated. I think any Pop! collector and/or LotR fan need to add these to their collection.\n\nReview of Frodo Pop!\n\nI was pleasantly surprised to receive my Frodo Pop! so early! I have all the LotR line pre-ordered and I wasn't expecting them until July, so getting an email off Amazon just last week saying it was shipping soon surprised me! I'm also rather glad I didn't get the Chase version, as whilst the collector in me would love it, I'd rather him look normal alongside Samwise Gamgee.\n\nThe Pop! itself is a really good rendition of Frodo, and it seems because he's a Hobbit they have made him just a tiiiiiny bit smaller than a standard Pop! figure. I've stood him next to several other similar Pops and while it's slightly difficult to notice, he does look a fraction smaller in height - which is appreciated! There is good detail on his sword Sting, which has very fine Elvish writing. There is also good print on the Leaf of Lorien, his brooch. The paint job overall is almost perfect and I think it's a really great looking Pop! in general.\n\nAs a pretty huge collector of Pops, I was a little frustrated to discover the Funko box was a bit damaged. Funnily enough, it was because Amazon had packaged it so tightly with the storopack air bags that they were crushing the Funko Box and causing it to crease inwards on the back. Other than a little crease that's still visible, I've managed to flatten the box out again so I'm not too bothered like others might be, but it's a word of warning! I appreciate Amazon packaging it securely, but maybe use a little less storopacks next time!\n\nVery happy with my little Frodo Pop! though, and I can't wait for the rest of the LotR line to arrive. Highly recommended!"},{"name":"Cesar A.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Frodo Baggins","review":"This Funko is great, one of my favorites. I was undecided which character to get but settled on Frodo since he is one of the main heroes and the one who sacrificed the most in the end. I am happy with it. It is a legit product, made of good quality materials. I am a huge fan of the films and can say it is worth every penny. I got the product exactly as described and free of damage to the box as you can see on my pictures."},{"name":"Elizabeth","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" You know what’s weird?","review":"Elijah wood follows Sean Austin on Twitter, but after 3 movies of following Frodo to Mordor, Sameise doesn’t see fit to follow poor Elijah back on Twitter."},{"name":"MP","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Frodo as a Pop","review":"It's Frodo as a Pop! I'm in love. It's easily recognizable as Frodo and in my opinion even looks like Elijah Wood as Frodo. I wish the paint was slightly sheen like they have in the glam of the Pop because the glam looks so awesome and makes the Pop \"pop\". But in reality it's a non-luster paint, which makes me a little sad. That's my only complaint, otherwise I love the sculpt of this model. I had to buy this and of course the rest of the LOTR Pop release as well..."},{"name":"Hi from WA","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" \"Even the smallest person can change the course of the future.\"","review":"What would the LOTR be without Frodo?! I cherished the movies so much, I am so happy there are Funko Pops! The Frodo figurine is awesome...they really captured him right down to his furry feet! I love he's holding Sting as well. The box I got was in good shape too..thrilled. Now...what's that Samwise up to? Think I gotta find out."},{"name":"Lucas Zavala","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" The detail is AMAZING.","review":"I recently started getting into The Hobbit/Lord of the Rings and wanted to buy something for it. Lego was out of the question, as it was way too expensive. So I started looking for Funko pops. I found this one and loved it. I purchased it and the paint job is pretty good. the detail is pretty good, and highly recommend buying ."},{"name":"Beth Ann Reed","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" great funko pop","review":"this funko pop has a lot of detail."},{"name":"Chris Odinson","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Frodo Funko Pop","review":"My son's happy with his Frodo pop, it came in perfect condition and it even came with a protective case so we're happy with this purchase. 5 stars."},{"name":"Louise Fenney","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Pop review.","review":"Pop is great, delivery is great, just slightly bothered by the fact that he doesn't stay up very well, which usually means it's a fake, but Pop doesn't seem to be a fake. Bizzare!"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" The ring is mine","review":"“I WILL TAKE THE RING THOUGH I DO NOT KNOW THE WAY.”"},{"name":"RhombusGeorge","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Concerning Hobbits...","review":"Best quality Funko Pops I've bought, usually the paint on Pops isn't up to standard but the LOTR hobbit ones are great!"},{"name":"Thrillhouse","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Mr Frodo","review":"Arrived in perfect condition and was the last one needed to complete the fellowship."},{"name":"Maya","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Damaged box","review":"The pop it self is awesome, sadly was hoping for the chase version but got the normal but it’s still a very cute pop. Sadly the box came damaged!"}]},{"id":"mjWctL","title":"Funko POP! Movies: Lord of The Rings/Hobbit - Aragorn Collectible Figure Brown, Standard","imageUrl":"https://m.media-amazon.com/images/I/61tSYXZEyAL._AC_SX425_.jpg","price":"$69.99","description":"About this item\nPackage Quantity: 1\nProduct Type: Toys And Games\nPackage Dimensions: 9.652 cms (L) x 13.716 cms (W) x 20.32 cms (H)\nCountry Of Origin: China","reviews":[{"name":"Selenus","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Surprisingly Super Nice","review":"Before we begin, I have to disclose that I know nothing about this character. I'm going to use it for a custom funko Dragon Age pop so he's not staying looking like this for very long and say goodbye to his head.\n\nNow, despite that fact, I really like this funko pop! He's incredibly detailed as shown in the pictures I provided he does have mud on his boots. But what really gets me is the little tree details on his arm bracers, it's such a tiny detail but I like it! Even the little leaf pattern on his cape cuff is well done. It's become pretty clear how much a licensing company will pay for a good funko just based on the paint job alone. His outfit has very little fading and color bleed, even under his tunic and the cape, it really in impressive. It's obvious they paint the body first, the put the cape on. That being said, the cape is fastened onto the body so it doesn't move. I did notice a very small spot of the skin tone paint on his shoulder, confirming that.\n\nHis head leaves some things to be desired. the hair around his face has color bleed on one half while on the other side the hair tone bleeds onto the skin. I guess you could pretend he has longer sideburns. Speaking of the beard, it's the nicest funko beard I've seen. It goes under the head and stops at the neck disk. The head tilt advertised is sort of weird, because mine doesn't really seem to have that. I'm not sure if the head tilt in the in the photo is an accident or if he's suppose to have one. I could say mine has a very, not noticeable one if you look long enough but, that's just me.\n\nAll in all if you like Aragorn, this is the funko for you!"},{"name":"M","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" I love him!","review":"Aragorn is one of my favorite characters of all time, so of course I had to buy him in Funko Pop form. The case also came in good condition, for those who keep their Funkos in their cases. (However, I recently took all of mine out of their cases and found that I like them much better when they're free!)"},{"name":"Minion","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very Aragorn-like!","review":"Aragorn son of Arathorn, called Elessar, the Elfstone, Dúnadan, the heir of Isildur Elendil's son of Gondor, will make a very good addition to my collection.\n\n... I like that 's funkos usually arrive intact i.e. the boxes are pretty decent since I like to leave them in-box for display purposes currently."},{"name":"Maggie M","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Love love love","review":"Aragorn's already my favorite character (besides Samwise), so there is nothing I can complain about. I've collected the entire Fellowship in funko and he was the 2nd one I got. A few years old at this point but still in pristine condition. Very scratch resistant even after several tumbles from my bookcase"},{"name":"Robert Wardius","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Impressively high quality","review":"This was purchased for my father, a lifelong LOTR fan, and it was VERY impressive! The detail on the robe and hair is better than any other Funko Pop I've seen so far, and it's very movie accurate. The plastic is high quality, and while the sword is a little flimsy, it shouldn't be a problem unless you want to use it like an action figure. The cardboard display box was a little bent and ripped on the top. It didn't really matter all that much to my dad, but I know people collect these in the boxes, so maybe keep in mind that the box might get a little damaged.\nAlltogether, a really neat and high-quality display piece for the super LOTR nerd in your life. Best when served with Legolas and Gimli."},{"name":"Elo","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Painted correctly, couldn't find a flaw on mine.","review":"Having received a terribly painted \"Pickle Rick\" Pop on release date, I was expecting this one to be a mess as well, but I was very careful inspecting this item and realized that POP increased their quality control and I am definitely pleased with this one.\n\nLord of The Rings TFoTR is my favorite movie so I was very picky on details. I'm happy with this one."},{"name":"mogosprz","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Wonderful toys for kids of all Ages!","review":"These toys are a MUST HAVE for any TRUE LOtR fans! Great gifts you can place ANYWHERE that add the FUN to Funko! The Funko product offering is huge and there is something for everybody! Enjoy!"},{"name":"r.jacob","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Cute","review":"Love funco pop Hobbit characters"},{"name":"Fiona Moran","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" 🤷🏻‍♀️","review":"Love it, but the box was bashed when it arrived. The outer packaging was perfect, so I assume it was damaged when it was stock."},{"name":"Nyeriin83","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great service","review":"Awesome pop! Delivery was on point and the packaging was great, would highly recommend."},{"name":"Laura","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great","review":"Great product for any funko collector. The packaging was also great meaning it arrives with zero damage"},{"name":"Luke Reynolds","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" A kings pop","review":"The king has arrived. Great POP"},{"name":"Cameron Cochrane","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Amazing","review":"Exactly what you would expect. It arrived in perfect condition as well"}]}]