[
	{
		"id": "2QQtw6",
		"title": "Ring Pop Bag 4-0.35 OZ (10g), Net Wt 1.4 OZ (40g)",
		"imageUrl": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/515QbiEgZhL._SY445_.jpg",
		"price": "$4.30",
		"description": "               \n                             About this item            Contains a selection of strawberry, watermelon, blue raspberry and cherry. Perfect for trips, outdoor activities and parties. Each pop is fat-free and has 60 calories.     \n                     ",
		"reviews": [
			{
				"name": "Renee",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Just what I needed",
				"review": "Just what I needed"
			},
			{
				"name": "Lauren",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Ring Pops Great, But Half Broken",
				"review": "These are the Ring Pops you’d expect, but half of them came broken, as other reviewers have mentioned. I only needed two to ask my nephew to be my ring bearer, so it worked out ok. I think these need to be packaged better than they were."
			},
			{
				"name": "Angelina Benza",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " really good",
				"review": "perfect taste and didn’t come broke"
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Amazing and great customer service!!",
				"review": "This is my second time purchasing from this Seller. I love how cheap the item was compared to a lot of other shops on . Not only was it cheap, but the Seller shipped out the item very fast. I got it in 4 days and my little nieces were very happy to get their hands on it!! I will definitely be making another purchase in the future!!"
			},
			{
				"name": "Ripken2131cal",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " She said yes!",
				"review": "Then she dumped me before the wedding:( These were temporary until I got her a real ring"
			},
			{
				"name": "Trixie Berg",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great value",
				"review": "Perfect for gift bags"
			},
			{
				"name": "Jaush",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "2/5",
				"reviewTitle": " 3 ≠ 4",
				"review": "Package says 4 but only contained only 3.\nThe package also displays 4 flavor options, Strawberry, Watermelon, Blue Raspberry and Cherry. One would think you’d receive one of each of the four flavors to make up the 4 pops per package. Instead I got two Strawberry and one Watermelon. You might have better luck. Thankfully the pops weren’t crushed like others have mentioned."
			},
			{
				"name": "henry terifay",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " It was poggers",
				"review": "They tasted like rainbows"
			},
			{
				"name": "Jessy",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Très cher pour 4 morceaux !!",
				"review": "Je croyais qu'il y avait 40 bagues pour 17$ au lieu de 4.. je ne l'aurai jamais acheté !!!"
			},
			{
				"name": "Emm🏳️‍🌈She/They🏳️‍🌈",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Great",
				"review": "fast shipping and taste good"
			},
			{
				"name": "lukas",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Missing item",
				"review": "Only came with two instead of 3???"
			},
			{
				"name": "William Wright",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Misleading",
				"review": "Package is misleading too small"
			}
		]
	},
	{
		"id": "EHdLK2",
		"title": "Bazooka Candy Brands Holiday Candy Box - 18 Count Lollipops W/ Assorted Flavors From Ring Pop, Push Pop, Baby Bottle Pop & Juicy Drop - Candy Gift Box For The Holidays - 12.4 Ounce (Pack Of 1)",
		"imageUrl": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/91mGRW3yDoL._SX425_.jpg",
		"price": "$13.68",
		"description": "               \n                             About this item            BULK HOLIDAY CANDY BOX: 18 Count candy box contains 6 Ring Pop, 4 Push Pop, 4 Baby Bottle Pop, and 4 Juicy Drop Lollipops for a variety of fun during the holidays!     SWEET TREATS: Perfect Christmas gift candy box for friends, take with you to holiday parties, or share with your friends and family this holiday season     ASSORTED CANDY FLAVORS: Each box contains a selection of mouth-watering fruity flavors including Strawberry (all), Blue Raspberry (all), Cosmic Strawberry Lemonade (BBP), Cherry Watermelon (PP) Watermelon (RP), and Wild cherry Berry (JD), so everyone can have their favorite during the holidays!     HOLIDAY VARIETY PARTY PACK: Bazooka Candy Brands' variety of lollipops in bulk make deliciously fun treats for kids ! The perfect treats to share, use as holiday party favors or give as a gift at your next holiday party     FESTIVE SHELF-STABLE TREATS: Perfect treats to have around the house for kids and the whole family to enjoy. Or give it as a candy gift for your upcoming holiday party because everyone loves Ring Pop, Push Pop, Baby Bottle Pop, and Juicy Drop!     \n                     ",
		"reviews": [
			{
				"name": "Jeramy J.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " What to do, ohhhh what to do....",
				"review": "I bought this to put in my 8 yo son's Christmas stocking. But as good as it looks to eat, I'm not to sure any of it will make it til Christmas morning. Such a horrible predicament for me to be in. Think he'll notice if I sneak an item or two??? I should've ordered 2 of them. I still might order a 2nd lmao."
			},
			{
				"name": "Christina Keifer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Product exactly as described",
				"review": "My first initial order was bad candy. Looked like it got wet then dried. Immediately contacted support and a replacement was sent out. Very happy with the new product and the customer service"
			},
			{
				"name": "jaz",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Best Halloween ever!",
				"review": "We had full sized candy bars and these ring pops and push pops for Halloween. The kids went NUTS about the push pops and ring pops, some of them ran away shouting to other kids to come get some. It was awesome! Both younger and older kids chose these over full size candy bars, we should’ve had more of these because we ran out of these first. We will definitely get two or three boxes for next year, it made us a very popular trick or treat house and we are all about Halloween so we were really happy with the enthusiasm."
			},
			{
				"name": "Rosalyn Saguidi",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " We still have some",
				"review": "I got this for my daughter but I have also had a ring pop and a push pop or two she likes the juicy drops and the sour candies in the store. We pay about two dollars for one. This was an excellent buy"
			},
			{
				"name": "Cathy schlabach",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " My son loves these",
				"review": "I bought this for my son because they were all his favorite candy in one package! Great deal and a happy camper! Cuddos"
			},
			{
				"name": "Bianca Del Rio",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great!",
				"review": "As described and great price! Shipping was fast"
			},
			{
				"name": "Tay The Critter Mom",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Best candy!",
				"review": "I got this for my niece and myself and i ended up eating most of it over the last several months lol. The watermelon ring pops are just EVERYTHING! Hate the blue raspberries, but my niece loves them, so it works out. Wish they were less expensive, but its worth it occasionally."
			},
			{
				"name": "Grace",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " A Kids sugar dream",
				"review": "My daughter loves this candy but picking up item in the store is sometimes $4 so when I came across this I purchased right away. I gave her one piece at the time here and there and saved myself some money. She loved it! Very inexpensive way to buy candy."
			}
		]
	},
	{
		"id": "PA-rHP",
		"title": "(51 Pcs) Fidget Toys Pack, Popits Fidgets Set for Classroom Rewards, Sensory Toys Autism Autistic ADHD Children, Bulk Fidget Set with Pop it Fidget Spinners Figet Cubes Fidget Rings and More",
		"imageUrl": "https://m.media-amazon.com/images/I/91Xl5X+pTgL._AC_SY355_.jpg",
		"price": "$16.99",
		"description": "About this item\n🔥FIDGET TOYS – Stay focused, fidget less and keep your hands occupied with our fidget toys bulk pack. Packed full of 51 items it contains a range of toys that can be utilized in a range of different situations\n👉GREAT FOR KIDS – We all know kids can find it hard to concentrate, some more than others, which is why our toys are ideal fidgets for classroom environments. There are more than enough toys in each fidget box for a classroom full of children to enjoy. They can choose their favorite to use while their brain focuses more on learning\n❤️BUMPER SELECTION – We’ve included fidgets that stick, twist, stack, pop, wobble, flip and more. We’ve got small fidget toys, larger fidget toys, toys made of hard plastic and more rubbery flexible toys too. Great for classrooms, meetings, studying, travelling and even for relaxing in front of the TV. Also great for pinata prizes and bingo prizes.\n😍HELP FIGHT ANXIETY – Studies show that fidget toys help those who suffer with anxiety. Designed to offer a calming effect to those with sensory issues such as ASD and ADHD fidget toys can help to offer a relief to symptoms in hands and fingers by keeping their hands busy\n🎁A GREAT GIFT – Know someone who is always distracted? Do you have a child who has attention issues? Our fidget toys for adults and kids contains everything anyone could need to keep their hands busy so they can concentrate on the task at hand. Treat someone to our bumper pack of fidget toys and they will have multiple options for their needs\nUSA Company Owned",
		"reviews": [
			{
				"name": "Talia",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " fantastic gift for children with autism",
				"review": "great gift for kids with autism!"
			},
			{
				"name": "Maria goretti Toledo Ponce",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Excelente para regalar a nuestros niños",
				"review": "A mi hija le encantò ,los pidiò como regalo de navidad y lleguè a buen tiempo y quedô fascinada con todos los juguetes incluidos !"
			},
			{
				"name": "Mayra",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Too small!",
				"review": "It was a birthday present for a 2 years old and the fidgets were too small. When I saw the small box I was confused it was way too small for 51 pieces. Plus I got my delivery on wrong address 🤦🏻‍♀️"
			},
			{
				"name": "Shar",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " I would buy again so many pieces and so much to share",
				"review": "Great for kids to share while watching their faces glow due to the colors and amount of pieces."
			},
			{
				"name": "Khelsey",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " So cute!",
				"review": "There is a lot included in this little box! The slime was really sticky but everything else was perfect. My 8 year old bought it with her birthday money and she loves it."
			},
			{
				"name": "Victoria",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "2/5",
				"reviewTitle": " Blahhhhhh",
				"review": "things broke quickly but that’s to be expected. Nothing was good quality."
			}
		]
	}
]
