[{"id":"a0MIcl","title":"Ring Pop Bag 4-0.35 OZ (10g), Net Wt 1.4 OZ (40g)","imageUrl":"https://m.media-amazon.com/images/I/515QbiEgZhL._SY445_.jpg","price":"$4.08","description":"About this item\nContains a selection of strawberry, watermelon, blue raspberry and cherry. Perfect for trips, outdoor activities and parties. Each pop is fat-free and has 60 calories.","reviews":[{"name":"Trixie Berg","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great value","review":"Perfect for gift bags"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Amazing and great customer service!!","review":"This is my second time purchasing from this Seller. I love how cheap the item was compared to a lot of other shops on . Not only was it cheap, but the Seller shipped out the item very fast. I got it in 4 days and my little nieces were very happy to get their hands on it!! I will definitely be making another purchase in the future!!"},{"name":"Misty","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Good","review":"They are what they are."},{"name":"Ted","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" classic ring pops","review":"nostalgia"},{"name":"tennille.turner","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" It was good","review":"It was good"},{"name":"Angelina Benza","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" really good","review":"perfect taste and didn’t come broke"},{"name":"Cooking With Carlee","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect booty for our pirate birthday party","review":"These ring pops were a perfect filling for my little guy's treasure chest birthday cake! Plus it was a great chance for us to relive our childhood too!"},{"name":"David Bozenski","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" 📯","review":"🎷"},{"name":"Jessy","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Très cher pour 4 morceaux !!","review":"Je croyais qu'il y avait 40 bagues pour 17$ au lieu de 4.. je ne l'aurai jamais acheté !!!"},{"name":"Emma","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Great","review":"fast shipping and taste good"},{"name":"William Wright","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Misleading","review":"Package is misleading too small"}]},{"id":"8PyKxb","title":"Bazooka Candy Brands Variety Summer Candy Box - 18 Count Lollipops w/ Assorted Flavors from Ring Pop, Push Pop, Baby Bottle Pop & Juicy Drop - Fun Candy for Summer Parties - 12.4 Ounce (Pack of 1)","imageUrl":"https://m.media-amazon.com/images/I/91yq7bKl2WL._SX425_.jpg","price":"$11.84","description":"About this item\nBULK SUMMER CANDY BOX: 18 Count candy box contains 6 Ring Pop, 4 Push Pop, 4 Baby Bottle Pop, and 4 Juicy Drop Lollipops.\nSUMMER TREATS: Great for kids' party favors, Bachelorette party accessories, 4th of July snacks, or just a fun and sweet summer treat.\nASSORTED CANDY FLAVORS: Contains a selection of mouth-watering fruity flavors including Strawberry (all), Blue Raspberry (all), Fruit Punch (BBP+JD), Watermelon (RP), and Wild cherry Berry (JD), so everyone can have their favorite this summer.\nSUMMER VARIETY PARTY PACK: Bazooka Candy Brands variety lollipops in bulk make deliciously fun treats for kids. The perfect treats to share, use it as party favors or a gift for your next pool party.\nSHELF-STABLE TREATS: Perfect treats to have around the house for kids and the whole family to enjoy. Or give as a candy gift in a care package because everyone loves Ring Pop, Push Pop, Baby Bottle Pop, and Juicy Drop.","reviews":[{"name":"Nea2p","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" 18 pops total","review":"4 juicy drop pops, 4 baby bottle pops, 4 push pops and 6 ring pops! This is great cause it will last a while! With so many choices! Bought this cause it’s cheaper than buying individually so 2 thumbs up from me!"},{"name":"E_Wagner","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" My kids LOVED this!!","review":"I didn't even have a chance to even think about taking a picture if I had wanted to LOL!! As soon as my kids saw this they were ecstatic!!! Immediately asked if they could open it! Considering each of these candies (except ring pops) go for 2 bucks at the convenience store, the price was definitely worth it, not to mention my kids faces when they opened the package LOL!!\n\nWith Covid-19 going on, I was NOT risking my family being around strangers, and so many people especially (most not taking proper precautions)... So we decided to celebrate at home doing fun family things like making up halloween games and I just bought them a bunch of candy so at least that was one halloween tradition. Out of ALL the candy I bought, this was sooooo a favorite by ALL THREE!! Yes 3 kids all agree on something lol, and it's not often that happens :)\n\nHope everyone had a SAFE and FUN Happy Halloween :D"},{"name":"Hesteen","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" As described but with less flavor variety.","review":"Item as described, for the most part. The product was fresh, a good price and shipped quickly and safely. The only downfall was that there was not as much variety in the flavors as shown in picture. This was not enough of a disappointment to remove a star.\n\nMy box contained: 6 ring pops (3 strawberry, 2 blue raspberry, 1 watermelon); 4 push pops (2 strawberry, 1 blue raspberry, 1 cotton candy); 4 baby bottle pops (1 unicorn, 1 watermelon, 2 strawberry); 4 juice pops (1 watermelon, 2 punch and 1 blue raspberry)."},{"name":"Kevin Hansen","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" great price","review":"very good suckers great price too"},{"name":"Brandi Pearl","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" I Love These","review":"I love these, especially Push Pop and Baby Bottle Pop, so it is nice to be able to get them in a variety pack together, especially with other products I enjoy. Great value for the money!"},{"name":"Living That Blessed Life","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect for kids!","review":"I have 4 kids, and anytime we go to a little store the kids always want to purchase a baby bottle pop or ring pop etc, and they totally rip you off and jack the prices up at the store lol so this was a steal of a deal to keep on hand at home"},{"name":"theofficefan","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great","review":"I wanted to buy my niece a box of candy and this was cheaper and looked nicer than buying everything separately and putting it together myself. Everything was intact and as expected."},{"name":"Delilah","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great value","review":"I gave these away for Halloween I got a bunch of boxes and the kids loved them it was a big hit!"}]},{"id":"EzKlcK","title":"Butterfly Cell Phone Ring Holder, 360°Rotation Phone Ring Grip, Compatible with iPhone, Samsung Galaxy, LG Google Pixel, iPad, Rhinestones and Enamel (Rose Gold and White)","imageUrl":"https://m.media-amazon.com/images/I/61-O3wAyuEL._AC_SX522_.jpg","price":"$12.99","description":"About this item\nThis cell phone ring holder finger stand is suitable for all kinds of phones. The phone ring can be rotated and flipped 360 degrees to achieve personalized usability, which is convenient for you to watch movies, TV shows, video etc.\nThe finger ring kickstand is made of high-quality alloy and stainless steel with 5 layers coating. The finger ring holder grip stand with rhinestones and enamel process are elegant and amazingly sparkly!\nThe beautiful butterfly phone ring holder provides you with a unique ring stand to make your phone more beautiful.\nThe sturdy sticker enhances the adsorption force and prevents the device from accidentally falling and slipping. Note: Please do not use the phone ring kickstand within 24 hours after installation.\nWorryfree Service: All phone ring holder have been 100% QC tested. You’ll get a 30 Days 100% money back guarantee and lifetime replacement warranty if damage occurs. What you get: ring holder*1, 3M tapes*3, PE film*3, instructions*1, scratch cards*1, phone buckle*1.","reviews":[{"name":"paul thomas","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Good value. Is Sturdy and attractive. Adhesive seems to be good so fR.","review":"Attractive, sturdy, adhesion seems to be good."},{"name":"Jlca","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Love it.","review":"I used liquid adhesion on this to ensure it doesn't come off. Those using this as a phone stand are the ones with the negative reviews. I use this as I have anxiety and need my phone attached to my hands some how. It does it's job and it's BEAUTIFUL and sturdy. Like I said I used another adhesion as I didn't trust the product on its own considering it's going to be used constantly but all in all 10/10"},{"name":"JennyR","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" All made","review":"I was worried because my phone cover is a gel back with glitter inside, and this said it wouldn't work well. But so far it's doing great. So if you use it properly, it should be even better!"},{"name":"Mary","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Awesome ring for my phone","review":"I love this ring holder thingymabob. It looks so pretty on my butterfly phone case. So sturdy and easy to put on. This ring adheres to my case so good I don't have to worry about it coming off any time soon. Tks"},{"name":"Robert","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very sturdy and comfortable!","review":"It was easy to put on my case, its comfortable to hold, and it seems to be very sturdy! The butterfly is so beautiful in person. 10/10."},{"name":"Jackie Willen","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Super cute! Lots of compliments!","review":"The ring folds down so I can put it in my purse/pocket, embellishment is flat enough that it fits easily in my hand. I get lots of compliments on it. Highly recommend!"},{"name":"20critters","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Love this pretty and convenient.","review":"Pretty, convenient, eaiser to hold phone at times seeing I have tendonitis and can not always open my fingers all the way to hold the phone, also great for propping up on a table to watch a video clip."},{"name":"murrie56","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" I Absolutely LOVE This Butterfly Ring!!","review":"It says not to put it on a silicone case. I did, & it's fine so far. It looks beautiful on my rose gold Glitter case! It dresses the case up so nice! Plus, I use it for a stand. I wish I could take a picture of it! I would recommend this for sure!"},{"name":"Cliente de ","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" hermosos cómodos","review":"Me gusto mucho pero cuando se lo preste a una amigo le empezó a despegar el\nCirculito transparente, me gustaría que vendieras repuestos de las pegatinas adherentes, y de la cinta doble cara de la abeja"},{"name":"Patricia Zamora","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" I love the Butterfly ring","review":"I attached to my phone as a handle"}]},{"id":"bMYidT","title":"Three Pack-Ring Phone Holder Bracket Stand Kickstand for Smartphones,Tablets,Pads-Mandala Flower","imageUrl":"https://m.media-amazon.com/images/I/71J1baNd45L._AC_SX522_.jpg","price":"$9.99","description":"About this item\nThree Pieces\nMetal Ring + 3M adhesive\nCompatible with most cellphones such as iPhones,Samsung, and Other Smartphones\nProviding all around protection for your phone and preventing your phone case from the daily damage and scratches\n100% quality guarantee.We would serve you with all our hearts.","reviews":[{"name":"Heather","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Rotate the ring until the adhesive gums up in the middle, peel off that blob, THEN stick it","review":"First one came off in a day. Looking at the adhesive after it came off, it goes over where the ring rotates in the middle. So, when you turn the ring the adhesive bunches up and the ring comes unstuck.\n\nPut a second one on, and same thing. However, this time I caught it before too much gunk made the adhesive no longer sticky and peeled out the little glob of adhesive in the middle over where the ring attaches. I stuck it back on, and there it has stayed ever since.\n\nIf you buy these, make sure you rotate the ring until the adhesive gums up in the middle, peel off that glob, AND THEN stick it on your phone/case. Otherwise it will just come off.\n\nOverall, the rings are pretty and sturdy!"},{"name":"Lori R","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Satisfied with purchase","review":"Though there were several substandard reviews on this product, I purchased it anyway because I liked the mandala design and also because the ring has a flat side which I wanted so it could be used as a stand (wasn't sure how well the round rings would support my Pixel 3XL phone). I received all 3 designs as described by the seller. I've had no issues with adherence. You do need to press firmly and allow it to \"cure\" before much use. The ring is stiff at first use, but over time it becomes easier to adjust. If it was real loose and easy to adjust, the kickstand would not work properly. I'm happy I purchased this product - it works as described."},{"name":"Chris Orr","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Wonderful","review":"I have used pop socket after pop socket on my phone and they only last about a month or two before breaking. This popped up as I was looking at some pop sockets...I didn't even know ring phone holders existed...(although I did see one on a phone, but I had no clue what it was lol)....anyway I've only used one out of this pack and this applied to my phone case perfectly, and it was a little struggle to get used to, but wow it's so much nicer and doesn't ever hurt using this ring holder....my only negative is, when I talk on the phone my hair gets caught somewhere in the ring holder and no matter how I try to turn it to free my hair, I always have to break my hair off...other than that I recommend this product."},{"name":"Gabriella","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect","review":"They're sturdy, not bulky, and they work even better than pop sockets. Glad I bought them"},{"name":"PurpleHippo","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Best Impulse Buy in a While","review":"I was on the fence if I wanted one of these for my phone because it would change the profile. And I didn't think I would use it much because I don't watch TV or prop my phone up much. Turns out these are fantastic. I end up using it the hold the phone all the time and not worry about dropping it. I am super clumsy so this is great. The designs are really cute too."},{"name":"S. Smoter","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great Ring!","review":"I can't live without a ring-type phone grip - it's like having a third hand. Seriously, I use this to attach the phone to my car's dash so I can see the nav app easily, plus my phone doesn't get lost. I frequently use the ring as a stand to watch videos. I am always depending on the ring to ensure I don't throw my phone while walking the dog (he always jerks the leash). And, this ring let's me carrying my phone and lot's of packages into the house at one time. I love this! And, this products comes in many cool designs and colors. You won't be sorry! Then, add in you get 3 for the price of 1, and this is so great!"},{"name":"Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfection","review":"I got this almost a year ago and it hasn’t BUDGED. I’ve only used one and gave the other two to friends, because again I only needed the one because it works so well. These are so much less expensive than those dumb pop sockets and SO much more useful! I’ve had similar ones by a different brand in the past and the hinge had gotten loose, but this one is working like the day I got it! And I have a red phone and a clear case and it looks SO cute. Identical to the description pictures. I used a random mirror selfie from when I was comparing my phone Look to my friend’s. I don’t know how I would hold my phone without this!"},{"name":"Steven P. Spinella","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" It's a ringer!","review":"If you like sliding your phone in a back pocket with nothing protruding, this is not for you. However, \"there is another...\" Some people, perhaps mainly women, like to keep their phones in purses, backpacks, and leave them laying around. They worry about them falling to the ground, hitting the pavement while they're out walking, and cracking the screen (twice in 3 months, no kidding!). They even like to prop them up on the table, either vertically or horizontally. These are the people of the ring.\nIf you are one of these, or want to join their tribe, you will love this ring. It has attached itself firmly to the TPU case and not budged since, \"we\" have now gone several months without dropping said phone, \"we\" enjoy slipping our cute little finger through the ring so we can hold it more securely, and \"we\" think it looks cute.\nOh, if you are into wireless charging, this may not be for you. The phone will still charge wirelessly if I pull the case off. (We have attached the ring to the case, not the phone, although both are possible.) Since the ring sits right on top of the wireless charging spot on the back of the phone, you probably already knew you couldn't do both at the same time."}]},{"id":"xC8sVt","title":"MINDSKY Phone Ring Holder Finger Kickstand Retractable 360°Rotation Ultra-Thin Cell Phone Back Grip Foldable Cellphone Stand for iPhone iPad Smartphones Tablets ( with Universal Magnetic Car Mount)","imageUrl":"https://m.media-amazon.com/images/I/71AUBjJeL1L._AC_SY355_.jpg","price":"$13.79","description":"About this item\n【Ring Grip and Table Stand 2in1】Double folded design provides infinite possibilities. The ring grip can perfectly adapt to various occasions, prevent your phone slipping from your hands on crowded bus and subways. Secure your phone for walking, traveling, hiking, playing game, selfies by one hand. Also a perfect solution to place your smartphone on office desk, kitchen counter or bedside table.\n【Flexible Multi-Angle Design】 360° Rotation and 2 adjustable arms make it more convenient to provide you more viewing angles than any other cell phone ring holder or phone stand. The phone finger ring is tested to withstand 10000 times of folding without getting loose.\n【Premium Material】The phone kickstand is made of high quality zinc alloy metal material, features its ultra-durability that keeps fresh and unfading colors as new even after using for a long time. With powerful and sticky 3M tape attaching well to smartphones, tablets, kindles and switch lite. We will provide an electrostatic disc, help to stick firmly on smooth plastic, TPU, metal or most phone /phone case. It will NOT stick to fabric, glass, liquid silicone or non-flat textured surfaces.\n【Grip+Magnetic Mount Combination Set】The package includes a cell phone ring holder and a magnetic car phone mount. This powerful magnetic phone holder is compatible with various car models and can also be used in kitchens, offices, cabinets and other scenarios. You can simply attach or remove your phone with one hand and prevent the mobile phone from falling off when driving on a rugged mountain road.\n【NO WORRIES】If there are any quality issues with this smartphone kickstand, please don't worry. We will provide 24h*7day timely customer service to solve the problem better. If you don't like the phone grip for whatever reason, we'll refund you or replace it.","reviews":[{"name":"Saphiya","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Fantastic kickstand for my Samsung Galaxy Z Fold2!","review":"I don't write reviews but I had to express how much I love this kickstand! I have the Samsung Galaxy Z Fold2. I truly love my device but it is heavy, add in the case, and it's even heavier, and bulky. I read a lot on my phone, but my hands do start to hurt from holding it. This kickstand has exceeded my expectations. Being able to use the kickstand for both the front screen and the larger inner screen at multiple angles has been a dream! I read at one angle, watch videos at another angle, and it's always perfect. It's only been a few days but even if the adhesive were to come off I'd reorder a replacement or find some other adhesive just to keep using the kickstand. Sooo happy with this purchase!"},{"name":"H. Merdian","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Company contact info invalid! Loose swivel after 2 months","review":"I loved the stand when I first got it, but after only 2 months, the swivel became very loose. The phone no longer stays in position. So I tried to email the mindsky_service@gmail.com like the instruction pamphlet indicated. I immediately received a failure notice indicating that email address does not exist. I also tried going to the www.mindskytech.com, via the QR code on the instruction pamphlet, and my phone notified me that my \"connection is not private\"...\"attackers might be trying to steal my info...\" so I am at an impasse. I do not recommend this company or this product. I gave this product 1 star for that reason. Had they been easy to contact regarding a replacement/troubleshooting, this review would not have been necessary."},{"name":"C. Garcia or D. Maez","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" SO MANY WAYS TO USE IT!!!","review":" I have to admit when I first got this thing I was thinking hmmm a little big but then realized it was amazing after putting it on my phone (iPhone Mini) with Pelican Shield case. There are so many uses for this thing its crazy and it looks so good and is so handy I will probably buy some more for other people as well! It’s a permanent stand for your phone and has great height. It's totally adjustable so you can put your phone in landscape or simply turn it into portrait mode. You can hang your phone on things and it folds up so nice and neat on your phone and is thin enough you forget it’s there. Also if you have a smaller phone (like the iphone mini) and sometimes your fingers get in the way when taking pictures this thing is also perfect for that as you can just use this thing to grab and take pictures no problem. I would recommend this to just anybody. It really amazing."},{"name":"Erica Takaesu","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Pretty Awesome","review":"This is by far the BEST phone stand ever!! It’s so universal. I can make my phone sit either vertical or horizontal or extend it out as a short selfie stick. It’s a life saver for keeping my phone propped up for my kids.\nSo far the adhesion is doing what it’s supposed to do. No sign of it coming off my phone case.\nI previously had a pop socket so getting used to holding the phone with this stand takes some getting use to. Its definitely something I would recommend!!"},{"name":"Sue","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Sturdy holder","review":"A friend recommended this holder, so I figured I will give a try. It turns out this holder is quite handy. It is 360 rotational, allows me to watch shows at different eye level. I used the protector shield sticker on the back of the phone with the holder, so far so good."},{"name":"Maia","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Ring too large to hold with one finger. Adhesive super sticky.","review":"I love how it stands up high so you can watch shows on your cell without straining your neck. The only issue I had was the ring part was too big to hold the phone with one hand. That’s the purpose of the ring holder for me is to be able to slip my finger through and hold it with one hand. The packaging was very nice and there was a lot of extras in it. Very sturdy adhesion. Would recommend if you're ok with the large ring holder."},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Solves all problems for me","review":"I had the pop-up kind of holder and regular ring holder. But you can't stand the phone up vertically with those. I also have a magnetic holder in my car, which I personally have found to work better than the bracket kind. This items resolves all issues. I can stand the phone either way, and use it with my magnetic holder. I comes with a magnetic holder, which I can use elsewhere."},{"name":"Danny","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Awesome phone grip + stand","review":"The versatility of this grip + stand is amazing. I was a bit worried about using this with my Pixel 3XL as it has a glass back, but I don't seem to have any issues with adhesion so far. I love how I can put my phone into different positions with various angles. It is also sturdy enough to hold the position very well. I haven't used the magnetic strip yet, but the strength seems to be plenty for mounting the phone to any surface. The only downside is that the grip is a bit awkward at times due to the oval shape, but the versatility of the stand function more than compensates for it. Overall very happy with the product!"},{"name":"King111","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Would be great, but sticky patch doesn’t hold.","review":"I received this a week ago and initially was raving about it, telling all my family they should get one. It transforms the phone by adding a sturdy but lightweight stand that can be put on any position or attached magnetically to a base magnet you can stick on car dashboard. It is compact enough to to fold flat and not take up much space on your phone cover, but extends to create a really useful stand so you can make your phone independent at any angle. I have used phone rings for years so am a big fan and this is definitely the most versatile and the most useful.\n\nHowever this morning the ring came off my phone when the phone got a sideways knock... it was the clear sticky pad that sticks to the case that came off, even thought it initially stuck on very well. I will add that no phone ring I have ever used has come off my phone - I’ve literally had to yank them off if I needed to change to another.\n\nI have discovered that once this sticky patch comes off, it then continues to do so... it has since come off three more times today, and I guess it will soon become non sticky and therefore useless.\n\nI hope the seller will send me a new sticky patch as it is the fail point. Interestingly the box includes a few extra of the small stickie patches used to stick the stand to the large sticky patch... why are there no more replacements for the large a s most important patch - the one that stocks the gadget to your phone case? I may try sticking it on with super glue... but it may not work, in that case I will have to return it. For such a seemingly great product to fail after just two days is a huge disappointment. And other buyers have reported the same issue.\n\nIt will be interesting to see how the seller responds and if they have a solution, as apart form this key issue, the phone ring holder would be excellent, and I am so disappointed to be writing a negative review."},{"name":"Ms Millward","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Useless","review":"This could be a great item but sadly after just a month it has gone limp and spins freely meaning I can't use it to hold up my phone anymore\n\nUpdate: a week later the handle came off its hooks. I was able to use it a bit by reattaching but it'd come off intermitterntly\n\nUpdate again: another week on and the whole thing has come apart at the adhesive. Very unimpressed"},{"name":"Twinkle_Toes","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" It's good, until it isn't","review":"Received mine 22 June and it had been working great. Really sturdy and did the trick. However, 3.5 months later the kickstand is loose and swinging all over the place and is not fit for purpose. Whilst I don't expect these things to last years, I do expect them to work longer than a few months.\n\n have been great and have said they'll issue a refund upon return of the item."},{"name":"Alice","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" Great idea but no suitable for long term use","review":"I really liked the idea behind this phone stand and when I bought it 10 months ago was showing it off to everyone. I liked that it gave me extra security holding the phone, the magnet was great to attach to my dashboard (I already had a Yoshi car vent holder so haven't used the bit provided from this product) and it worked really well as a stand in both portrait and landscape. The adhesive was really secure and the colour was pretty. Unfortunately after the first month I found that the outer ring started to become less stiff and wouldn't hold the weight of the phone so much and by this point the rose gold layer was noticeable scratched. Over time this degenerated to the point where the rings will come away from the back of the phone about 30 degrees just due to gravity (or without intending to move them). About two days ago any friction on the outer ring completely lapsed and the whole thing just dangles and noisely clatters around. I've finally accepted it's beyond the end of its life and won't be purchasing another one. It's such a shame there wasn't a way to tighten up the connections over time. Overall not worth the .oney as this statt d to be an issue after only a month of use and I just persevered with it."},{"name":"Bella","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great phone stand, ring holder. Good quality","review":"I bought this to help with keeping phone upright when on zoom calls, watching videos etc. I have a case with appliqués on the back so had to put it on off centre it still works and is a great quality stand. It does add a bit of bulk to the phone (I run so may be tight in some pockets) but I can take the cover off If I need too.\n\nIt’s comfortable to hold and I’m very happy with the item."}]},{"id":"cerR-Q","title":"Bazooka Twisted Ring Pop, 0.50 Ounce (Pack of 24)","imageUrl":"https://m.media-amazon.com/images/I/61hCpmoZYiL._SY445_PIbundle-24,TopRight,0,0_SX335SY445SH20_.jpg","price":"$24.95","description":"About this item\nIconic wearable lollipop ring with an enormous eye-catching candy gem twisted with 2 flavors each\n24 - 0.5 Oz individually-wrapped Ring Pops per Box, 12 Oz Total\nContains a selection of 3 mouth-watering fruity flavors: Twisted Berry Blast, Twisted Blue Raspberry Watermelon, and Twisted Citrus Craze\nProudly made in the USA\nGreat for kids, birthday parties, party favors, weddings, engagements, bachelorette parties, bridal showers, baby showers, graduations, and other celebrations","reviews":[{"name":"Patrick S.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Repackaged","review":"I’ve had enough ring pops in my to know when they’ve been sucked on before 😂 The package I received had all but a few that tasted like they were licked on then repackaged and sold smh. First and last buy for me personally."},{"name":"Anthony O.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" 😊AMAZING DELIVERY AT AN AMAZING PRICE VALUE😊","review":"I was ecstatic with the courteous delivery and I was truly amazed🤩"}]}]