[{"id":"jguXxj","title":"Among Us Crewmate Figures | 8 Among Us Toys Out of 16 Collectibles in 1 Box | Among Us Merch Incl. The Peeled and The Clogged | 2 Hidden Impostors | Mini Toys with 5 Add’l Hats","imageUrl":"https://m.media-amazon.com/images/I/812Es+KPCrL._AC_SX425_.jpg","price":"$29.95","description":"About this item\nGET 8 AMONG US FIGURES AT ONCE. These are small toys representing the game’s characters, including the Peeled, the dead body (report it!), the purple impostor (beware of the tongue!), and two unknown extras! The five additional hats include the Knighted, the Cap-tain, and the Floaty Flamingo—and they’re just like in the game! The blister package playfully hides two Among Us toy pieces in it from you—to remind you that there’re always impostors among us. Find out who the impostors are this time!\nAMONG US GIFTS WITH THE TOTAL OF 16 FOR YOU TO COLLECT. Find all these Among Us toys for boys and girls including the four rarities: the purple Punkin head, the cyan Floaty Flamingo head, the red Chop-chop head, and the lime one wearing the Great Goalie (the Jason mask?)—and he’s running! Two of the characters in each deluxe box are hidden impostors whom you can’t see before you open the pack, so the whole deal with collecting this AmongUs stuff turns into a real quest. Collect them all!\nUSE THE TOYS AS AMONG US PARTY SUPPLIES. For parents and kids, toys can work as both party décor and entertainment as they bring a mood and a theme to a party and invite children to an activity—just play with them! These Among Us toys for kids can inspire them to have an offline match or two of their own and find the impostor. Throw a simple Among Us party or even an Among Us birthday party with this Among Us stuff, and hear your kids happily shout “Emergency Meeting!” now and then.\nGENUINE AMONG US TOYS LICENSED BY THE GAME’S DEVELOPERS. P.M.I., the manufacturer of these mini toys, is licensed by InnerSloth, the company that created Among Us. The kids’ toys are authentic-looking and in line with the game’s original style. Minimalistic as they are, these Among Us party favors show the producer’s great attention to detail, like the 5 accessories included in the deluxe box. Spark your children’s interest in the game, or reward them if they’re already fans.\nPERFECT AS AMONG US GIFTS. A whole pack of Among Us merch is a great gift idea, especially if your or your friends’ children have tried out and liked the game. The pack will also come in handy if you’re looking for simple Among Us birthday party supplies, and it can even be used as Among Us birthday decorations. Get the right pack to help a young enthusiast complete their collection or start one from scratch. Perhaps, an adult AmongUs small toys collector will appreciate the gift, too.","reviews":[{"name":"marie vee","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":"  yasss","review":"Let me tell you these amongus things are no joke they are hard to find and  just has them and affordable Yass💕"},{"name":"Jonny","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Red is highly sus","review":"I saw red venting."},{"name":"Jessica","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Too cute but you can’t swap hats around.","review":"These are cute but you can’t swap hats around. Don’t buy for the accessories, just for the figures, which were cute."}]},{"id":"Qi7XI6","title":"12 Inch Plush Toys, Soft Stuffed Plushie Space Figure Doll Toys with Bulging Eyes, Best Gifts for Game Fans and Kids Birthday","imageUrl":"https://images-na.ssl-images-amazon.com/images/I/71I92822gUL.__AC_SX300_SY300_QL70_FMwebp_.jpg","price":"$15.99","description":"About this item\n【Unique Design】This plush toy is inspired by the combination of the famous space game, with cute hat, big prominent eyes, three-dimensional full body, beautiful multi-color combination, giving you a different character experience and unexpected surprises.\n【Soft Material and Portable Size】The plush toy is made of high-quality cotton material, which is soft and comfortable to touch; the doll is full and will not change its shape even after long-term use. The size is about 30cm/12 inches, portable and perfect for kids to play.\n【Wide Application】This is a very cute Among plush toy, you can put it on your desk, bedside, shelf, counter and sofa as a beautiful decoration. The plush toy is so soft that you can hug it as a stress-relieving plush toy, and it will also be your child's best companion before bedtime.\n【Durable and easy to clean】Every detail of the fabric is carefully sewn to ensure its quality, the soft plush doll is hand washable and machine washable, so don't worry about getting dirty and enjoy your playtime. Tip: It is vacuum packed, please pat it with your hand after you get it, and let it dry in the sun for a few hours to restore the original state.\n【Perfect Gift】The cute design looks realistic and fun, perfect for watching movies, long trips, relaxing and sleeping, it's an ideal gift for game fans and for kids birthday and Christmas present.","reviews":[{"name":"Ssj2 Sanji","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" When two worlds collide!","review":"I had originally got an Among Us plus from the local Best Buy for one of my kids. My youngest birthday was coming up so I decided to look on  for one. To my big surprise I saw plushes of not only Among Us, but in different characters also. My kid loves Among us and Pokémon so this purchase was a no brainer for me! She loves it and I couldn’t be more satisfied with how fast I received it! I loved it so much that I got my other kid one of Baby Yoda!"},{"name":"MagicMommyB","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" A must have Pika-Amongus plush","review":"An amazing sussy disguise or a legendary evolution, either way it went off as a huge hit with my kids.\nMy son & daughter went crazy for this plushie. The both love and play several pokemon games daily & are among us gamer fans as well!! They have a 8 year plushie collection and growing and this plushie definitely made the cut. High quality made it is so soft and pretty large in size for most plushies out there. No defects, flaws I would have thought this would have been a higher price limited edition plushie that came from the creators from both gaming companies the design and quality is that good!! 2 for 1 plush high profile characters you just cannot beat that I give it 5 stars and will be purchasing more!!"},{"name":"A.Mom","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" So very cool!!!","review":"From the moment I pulled this plush out of the  box, my 7, 9, & 12yo began fighting over this plush. They were honestly beyond thrilled. An Among Us and Pokémon mashup... well that's a combo of their two most favorite things!\nI am happy to report this plush was a lot bigger in person than I expected it to be. And it feels really well made too. They're very happy that I found this super sweet merch. I'd come back to buy other mash up plushies from this company, for sure. It was an excellent find!\nHope this review was helpful!"},{"name":"Arzach","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Amongachu","review":"Another weird Among Us crossover. I guess they will capitalize on anything, expecting us to lap it up like good little capitalist stooges. We might be outraged if it didn't make us laugh so much! Very sus..."},{"name":"Lee4kids","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" adorable","review":"my seven year old loves this, came vacuum sealed but fluffed right away, great carryable size, soft, good quality and makes a great gift for any child,"},{"name":"Megan H","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" My son loves it!","review":"It does come vacuum sealed in a bag, so it was really wrinkled when I took it out. However, after you toss it in the dryer on gentle for a few minutes, it looked good as new! No weird chemical smells, which was a plus for us since my son has eczema and asthma."},{"name":"Leeshie","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Cute","review":"Cute plush toy if you have a child who loves Among Us and Pokemon. It's a decent size, quality is good - it's also very soft. My son loves it."},{"name":"MyPenName","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Needs more stuffing","review":"Very cute, but definitely needs more stuffing. It is rather floppy all over and the ears do not stick out or up at all. Needs more stuffing."}]},{"id":"EWKoco","title":"LEEPED Hot Space Kill Game Figures Building Blocks Toys (2022 New Blocks) The Best Gift for Kids（No Box）","imageUrl":"https://m.media-amazon.com/images/I/71tUNCDZBDL._AC_SX425_.jpg","price":"$18.99","description":"About this item\nPERFECT GIFTS:This Toy is inspired by the famous game, which is an ideal gift for this game fans, and they will fall in love with it. A great gift choice for your kids, friends, family.\nScene Decoration:Combine with the game Look at the cute astronauts and you won't be able to resist interacting with them in real life 。\nUsage:Cake decoration decoration, Birthday giftcollection, Doll decoration, capsule gifts,car dolls, micro landscape ornaments\nPackaging: 8pcs/set, in order to save space, we do not use boxes, but use bags for packaging, a total of 8 bags. Material: Eco-friendly High quality ABS plastic.\n[Installation Notes]: The product contains detailed installation instructions, you can complete all the installation according to the instructions!Wish you have fun playing！","reviews":[{"name":"Esteban Garcia","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Legit","review":"Kids loved it had no problem building"},{"name":"Joe in NYC","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Fun Toys-Great Sleepover Activity","review":"My son got these for his friend's 9th birthday. He's sleeping over and we just had a photo texted with the boys focused on building the toys. The fact that they'd rather play with these than play with technology, is a very good sign."},{"name":"jabloke","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Awesome","review":"Great alternative to lego's."},{"name":"Kimberly","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Adorable","review":"They were super small so not for little ones but we have had fun with them."},{"name":"Amanda Schaapveld","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect for the Among Us fan","review":"My daughter loved this toy!"},{"name":"Rachel A.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Fun set for kids","review":"Great set and the kids love it but it did not have instructions for assembly so they had to look at the online photo and figure it out. Each “task” comes in its own bag so that made it a bit easier."},{"name":"Vivian and Alex","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Kids love it","review":"My kids love this."},{"name":"Diego","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Llegó en el tiempo indicado, vendedor confiable","review":"Fácil de montar"},{"name":"Alejandra Martinez","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Mala calidad","review":"Mala calidad, las piezas no embonan bien y las instrucciones no son claras."}]},{"id":"U5a-06","title":"Werewolf Kill Games Building Blocks Toys,Space Alien Figures Peluche Game Model Kit Bricks Classic Kids Toy for Children Gift Mini Statues,Figures Game Mode(334-528PCS)","imageUrl":"https://images-na.ssl-images-amazon.com/images/I/51rLlwQtpCL.__AC_SX300_SY300_QL70_FMwebp_.jpg","price":"$26.88","description":"About this item\n【Perfect Gift】Inspired By The Famous Game, This Werewolf Game Block Toy Is The Ideal Gift For Fans Of The Among Game, Who Will Love It. A Great Gift For Kids, Friends And Family. The Figures Stand Approximately 1.6 Inches Tall And What'S Even More Fantastic Is That They Can Be Combined To Form Different Scenes.\n【Scene Decoration】Combine With The Among Wolfman Game Block Toy And Watch The Cute Astronauts, You Can'T Help But Interact With Them In Real Life And Decorate Your Room, Bedroom And Living Room.\n【Use】Birthday Gift Collection, Doll Decoration, Capsule Gift, Car Doll, Micro Landscape Decoration.\n【Packaging】High-End Gift Packaging, Environmentally Friendly And High Quality Abs Plastic.\n【Perfect After-Sales Service】Us Products Are 100% Non-Toxic And Non-Harmful. We Are Sure That Your Child Will Love It And Become A Loyal Supporter Of It. If You Are Not Satisfied With The Product After You Receive It, Please Contact Us And We Will Get Back To You Within 24 Hours With A Satisfactory Answer.","reviews":[{"name":"Tina","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" 11 year old loves it!","review":"This was a Christmas gift for my Among Us obsessed 11 year old. He was very excited to open it and put it together. He was impressed with how close the set is to the game."},{"name":"Melissa Gillette","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" It took me forever to put it together! Like 4 hrs","review":"It's really detailed and cool looking. My 9 yr old loves it. I just didn't like spending 4 hrs of my Xmas day to put it together. It Has alot of small pieces like guns and bones. Things I hope he won't lose but probably will in no time"},{"name":"Krista","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Legos","review":"Grandson loved it! He is 7 and kept him busy for about 1/2 a day. He was happy with it."},{"name":"Tiffany","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great","review":"My son loved these."},{"name":"Cassidy","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Not as Advertised","review":"I ordered this Lego set as a birthday gift for my son who is obsessed with Among Us. Got it in the mail and opened it up just to find out it’s just the space ship….. no Among Us! I will be sending this back and ordering something different. Definitely not happy about it 🙄"},{"name":"Alblav","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" My kid loved it.","review":"My kid loved this blocks. Some blocks where a little hard for him to put together, but he enjoyed them anyway."},{"name":"Rebecca L. Nance","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Christmas gift.","review":"What's important is that my grandson loved it."},{"name":"Sharon Odom","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" NOT WORTH IT!!!","review":"It's much smaller than described, barely the size of the small 5$ lego sets. Do NOT waste your money!"}]},{"id":"wmhyno","title":"Werewolf Kill All Among in Us Hot Game 13 Alien Figures Imposter Building Blocks Toys Space Kill Characters Model Kit Bricks Desktop Dolls Gifts Cake Decoration for Fans Children Kids (195pcs)","imageUrl":"https://m.media-amazon.com/images/I/7165150kL4L._AC_SX425_.jpg","price":"$18.99","description":"About this item\n【13 Space Kill Game Figures】This 13 vivid minifigures inspired by a popular game are assembled from 195 pieces of building blocks. They can not only improve the children's hands-on ability, but also experience the joy of the game. The hats of the thirteen Characters can be replaced at will to increase your imagination ability.\n【How to Play】You can define any one as an impostor, then start among in us game with your kids. also, can use your imagination to bring to life any building toy you want with these colorful toys, fostering kids’ playtime and building creativity throughout the process.\n【Usage】This figure toy is about 3cm / 1.2inch (without the hat). Small size, easy to carry and can be assembled anywhere. It is suitable to use with cake decoration decorations, birthday gift collection, Doll decoration, capsule gifts, car dolls, micro landscape ornaments.\n【Perfect Gifts】Among in us figures building block toys were inspired by the popular game, which will be an ideal gift for games fans. Great choices for for boys and girls between the ages of 6 and 99 years old.\n【High Quality】All our products are makes of high-quality ABS material and undergone rigorous testing and screening process. Compatible with other major brands, so you can mix use our bricks for LEGO sets. If you have lost a piece or there seems to be a missing piece, please reach out and we would be happy to replace it for you.","reviews":[{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" missing pieces","review":"We bought this for a child and he was very excited to put the pieces together. They look cute, but there are several pieces missing in the package. As you can see many people also reviewed that the package missed pieces. We are one of those people who received missing pieces package, too. This is a Knock off lego pieces and they have very bad Q.A so no one check on the pieces if they have enough pieces or not. We had to be creative and used some real lego pieces for replacement even though it is not perfect but it works. Also the pieces don't stay tight together and randomly dropped out easily."}]},{"id":"Kx3P-I","title":"16 Colors 3D Night Lights with Remote Control and Smart Touch, Atmosphere Bedside Table Lamp for Kids Birthday Gifts Bedroom Decorataion Game Lovers","imageUrl":"https://m.media-amazon.com/images/I/612NbI0L3cL._AC_SX466_.jpg","price":"$16.99","description":"About this item\n🎁🎁3D VISUAL EFFECT: 💝💝Novelty 3D illusion night light has a nice hologram effect, make your surroundings more lively. This 3d night light give you a perfect sense of 3D vision, amazing is that the night light lamp looks like floating, giving you more interesting, both for your room and your lives .\n🎁🎁16-COLORS 3D NIGHT LIGHT: 💝💝7 Single color light and 16 colors changing cycling: red, green, blue, yellow, cyan, purple, white; when pressing 8th times, it will automatic gradual changing for these 7 colors. 4 Flicker modes(Flash, Strobe, Fade and Smooth) and brightness adjustable. Multi colors and modes meet your different requirements. Comes with different styles that make more fun to play with, depending on your mood or surrounding.\n🎁🎁SMART TOUCH SWITCH: 💝💝3D ilusion night light is designed for children to play with, easy to use, one button operation, ideal gift for boys / girls to play with themselves.\n🎁🎁DURABLE AND SAFE FOR KIDS: 💝💝Easy to charge. Safe to touch. Sturdily constructure with toy-grade ABS base and high quality 3D light lamp doesn't get overheat. Two ways for power supply - 3 x AA Batteries (Not include) or USB cable.\n🎁🎁UNIQUE GIFT FOR BOYS OR GIRLS: 💝💝Creative and amazing night light unlike anything you've ever had. Perfect for gift giving, great present for boys girls baby; Decor lamp for your home, bedroom, child room, living room and any party. Also for festival gifts, such as birthday gift, Christmas gifts, and so on.\n› See more product details","reviews":[{"name":"David D","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Amazing!","review":"Was hesitant to purchase this due to no reviews on this product. But I’m glad I did purchase it! Item is perfect and looks amazing! Remote and USB cable is an added bonus! Highly recommend, or is it sus..? ;)"},{"name":"Sweetheart85","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" AWESOME LIGHT!!!","review":"My 8 year old loves Among Us and since his 3 year old brother sleeps in the same room as him he didn’t want me getting a “baby night light”. This light is perfect for a night light and the boys also love to listen to music and have it change colors with the lights off so they can have a dance party. I’m honestly impressed with the quality and how well this works I would highly recommend."},{"name":"Chance","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" This is very very bright","review":"Super SUPER bright, like extremely so. Red and orange are the darkest colors, with the blue/white ones being the brightest. There's also brightness levels on the remote, and stuff like rainbow and strobe settings that are pretty neat. My daughter uses it as a night light so she's only allowed to do the darker colors, but the rest of them would be super cute in a computer room."},{"name":"Heather Doyle","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great nightlight!","review":" My son loves this so much!"},{"name":"Ashleigh M","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect gift for my 6 year old","review":"It was the perfect gift for Christmas. My son uses it every night. Remote works great different colors and options for the light. Easy for him to use. Easy to accessible. No complaints here!"},{"name":"susan porter","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Grandsons Christmas present","review":"Unique--sure to be a greatgift"},{"name":"Megan Marie Craig","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great gift","review":"Works as expected and my 8 year old son loves the remote feature"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Get it","review":"My daughter loves this and it's great as a night light and she has it on change colors slow"}]}]