[{"id":"IL4w_i","title":" Essentials Men's Packable Lightweight Water-Resistant Puffer Jacket","imageUrl":"https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81Qyp3yf1US._AC_UX342_.jpg","price":"$21.90","description":"Product Details\nFabric Type\nShell: 100% Nylon; Lining: 100% Nylon; Fill: 100% Polyester\nCare Instructions\nMachine Wash\nOrigin\nImported\nAbout this Item\nCold-weather style is easy with this versatile water-resistant lightweight puffer jacket featuring a full-zip front and stand-up collar\nWith a stand-up collar, zip pockets and elasticized cuffs; packs neatly into included carrying bag with drawstring closure\nOutfit the entire family with comfortable, quality clothing from  Family\nWinter made better: we listen to customer feedback and fine-tune every detail to ensure quality, fit, and comfort\nDescription\n\nAn Amazon brand - Cold-weather style is easy with this versatile water-resistant lightweight puffer jacket featuring a full-zip front and stand-up collar\n\nAmazon Essentials is focused on creating affordable, high-quality, and long-lasting everyday clothing you can rely on. Our line of men’s must-haves includes polo shirts, chino pants, classic-fit shorts, casual button-downs, and crew-neck tees. Our consistent sizing takes the guesswork out of shopping, and each piece is fine-tuned to offer quality and comfort.\n\nSee more\nAbout this Item","reviews":[{"name":"Christopher Zele","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great inexpensive puffer jacket","review":"I was able to snag one of these puffer jackets for my Step Dad for $21 for Christmas. It runs a little bit big and he normally is a Medium, but I bought him a Small and that seems it will be perfect for him. The quality of the material is very nice they used a good filler and the jacket feels nice when I tried it on to see how it would fit. Most puffer jackets are $40 or $30, so when I saw this for the low $20s I had to pick one up.\n\nYou can fold this puffer jacket up into a ball, which is a nice plus if you're hiking somewhere cold and it warms up in the afternoon and you want to put the jacket away.\n\nThis jacket definitely feels like a $40+ product. I own an Old Navy Puffer Jacket, which I've used for years and a Patagonia one. This  one is very close in quality to the Old Navy one. It feels good to the touch and looks sharp.\n\nIf I was in the market for another gift for someone, or I needed another puffer jacket for myself I would definitely buy an Amazon Basics because they're both cheap and high-quality."},{"name":"Avant","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Good cheaper alternative but not for heavy use","review":"I bought for the purpose of travel and outdoor use in those times where temps can change drastically from 70F in the morning down to 40F at night.\n\nI got this on sale for $20 which was a far cry from $60-120 asking price of other packable down jackets. For the price, it's much warmer than I thought and has well thought out features. So far I've worn this in 42F weather, coldest and just going on a walk I was breaking a bit of a sweat with it half zipped. It has 2 exterior pockets and 2 internal pockets. Personally I wouldn't put too much in these, as I can really feel the thing stretch and drag down. Just gloves, hat, phone etc. should be fine, nothing like a can of soda or something. Water resistance is what you expect for thin nylon stuff, a few drops is fine, actual rain, get an umbrella or an actual waterproof layer. It's also pretty windproof, took it out in the aftermath of a pseudo hurricane and didn't feel the wind.\n\nIt packs down pretty well into a 6 inch long 3 inch or so bundle but nothing like the high tech hiking stuff, I just wish there was a shorter loop so I can carabiner it to my pack easier but seems like it was intended to be carried like an umbrella. Also wish it packed into itself rather than have a bag which may get lost one day. The material imo isn't very durable, I have no rips yet, but I'm not confident and think if I rub on something the wrong way it's going to tear. The stitching seems fine so far, and doesn't seem to be leaking filler yet.\n\nSizing wise, I have a 45 chest and usually wear XL, but this is kinda big even for an XL, maybe because they were antiicpating you layer something like a thick sweater underneath. It is also a bit long for my torso, about 2-3 inches more than I need to sit at my waist. I have 23 sleeves and that fits perfect.\n\nI don't expect this to last a long time, but it's useful for the time I'll have it.\n\n12/28 edit:\nSo I just used this exactly for what I bought it for because of the huge winter storm that swept across the north and east coast US. Temps went from nearly 60 degrees in daytime all the way down to 23 by late afternooon with extremely high winds that were throwing doors around and knocked some street signs off their mounts, and it was perfect. I just had a t-shirt underneath and on top of this was a gymax waterproof windproof jacket. Again my only complain might be if the material doesn't last and it's a bit long."},{"name":"Nunya001","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Big Performance for a very low cost","review":"I bought this jacket to wear at work - I make a wood product and I'm outside in all weather. I need jackets to be no fuss and functional but also affordable so if I tear it, spill oil on it, burn it with welding sparks I can shrug it off and buy a new one. As a point of reference Patagonia is my personal go to outdoor wear supplier, but that's way too expensive for work.\n\nI've been wearing this jacket now for a couple of months. Just went out in 13 F with pretty decent wind gusting - warm and comfortable. It's cut allows good movement and it's not so bulky so you can put a shell over it in wet weather, although I've worn it in the rain without a shell and it does pretty well. I'm 6'2 185 with long arms and a medium fits just right. I wish it was 4 inches shorter - that's my only suggestion."},{"name":"Dan","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Depends on the fit you like. See more for good info.","review":"Really great for the price $22 I got a large and ordering a 2nd that is medium, if I used it a lot (or it cost more) I would get something more durable like a name brand. But price wins and it is warm, it works for what I use it for. The fit is more of a traditional fit that is to say a large is baggy for my slim fit preference. I am a man who is 190lbs 5'11. Before the pndmic I was 175 (got gains) and would have gotten a small knowing the sizes haha #goals.\n\nIf you want a long term thermal go buy a brand name it will look 6 times better, but this thing has its place for sure!! I like things more tight fitted and in my post pndmic body i'd get a medium or probably a small to wear under a jacket. So if I was 175-180 i'd probably get a small I think to wear under stuff, but a medium if its the main thing and you don't like fitted clothes.\n\nI planned to get 2 of these with one to wear to work and another to get dirty from yard work and outside things. I first ordered a large and it is baggy for my preference but probably what most men would want. I like fitted clothes and have ordered another one in size medium to wear to work. I am keeping the large for yard work and other things. Great to have 2 or 3 instead of one high priced item.\n\nHope it helps!"},{"name":"Clau","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Excelente compra!!!","review":"Está increíble la calidad. Es muy similar a las chamarras Uniqlo, con una diferencia de precio enorme. Se guarda perfectamente bien en su bolsita y no pesa prácticamente nada. Es calientita. Básica para los viajes. El color es igual a las fotos de la publicación de , y viene ligeramente jaspeado el tono. Viene amplia. Estaba dudando entre la L y la XL y compré la L y acerté. Si estás entre dos tallas escoge la pequeña. Súper recomendada! Si esta reseña te fue útil da click en me gusta para evaluar si escribir otras reseñas"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Surprisingly good","review":"So I have to say I had rock bottom expectations buying this. But corona has been good to me and I’ve lost 30 kg in the last year. As such basically nothing fits me. Therefore in desperation I turned to  to help me out. The coat is lightweight. Folds super small in the provided bag. Has a nice matte finish. Sizing is good. I’m 175cm and 71kg - the small is just a shade too big. Otherwise really happy."},{"name":"JHK","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" size","review":"Im a 46\" chest and a 36\" waist. Im 6'0\".\nMy normal size to go to is XL.  apparently knows this and recommended a 2XL.\nHowever, having read the reviews I went for my go to size XL.\nIt arrived. Way too big. So I returned it using their carrier which was EVRI which annoyed me cos I thought I could return via the  shop which is much easier. EVRI system and machines are shocking.\nI then ordered the L. Very rarely do I do that as they are normally too tight.\nIt arrived. Fits fine on the chest and shoulders , arms and length, but the waist is a bit baggy and loose. It's like for a 39\" waist I would say. ( I do train/swim a lot and have a v shape)\nIm being super fussy, but for £37 I feel I should be. I am sticking with it as I figure a M would be too tight.\nAnother thing. It is a female zip. Zips up on the wrong side. No big deal these days as we are alll meant to be one and the same right? Just letting you all know that's all.\nHope this helps. Surely Amazon Essentials should be able to get sizing and measurement information right and show it with the products.\nCome on Amazon. I love you but you really should give more information and more accurate sizing with your products. Hope this helps you as requested."},{"name":"Tony K","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Fabulous value","review":"Truly surprised by how warm this jacket is. It’s feather light and my first thought was that it is pretty thin so my expectations were pretty low. How wrong was I? I work outdoors in N Scotland and already in Oct temperatures are only 4 or 5C. I’ve been wearing it under my overalls instead of a fleece and wow it’s warm. It isn’t an Arctic level puffa jacket but I think that’s fairly obvious but it’s way warmer than a fleece, not at all bulky and fabulous value for money. I definitely recommend it"},{"name":"Jay Dee","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Delighted...","review":"...with this jacket.\n\nIt is everything it claims to be in the description and despite being lightweight it is pleasingly warm [snug as a bug actually].\n\nThe stitching is excellent and I found no loose threads. It has two external zipped pockets and two large inside lower front quite deep pouch pockets. The zip, in keeping with the 'lightweight' theme is quite narrow but works well and zips right up to the top of the collar.\n\nSize-wise I would say it is 'true to size' bearing in mind what you may be wearing under the jacket in cooler times."}]},{"id":"L6CWqS","title":"TACVASEN Men's Jackets-Windproof Bomber Jacket Full Zip Winter Warm Padded Coats Outwear","imageUrl":"https://m.media-amazon.com/images/I/610DOILk1jL._AC_UX385_.jpg","price":"$46.98","description":"Product description","reviews":[{"name":"Ace Traveller","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very impressive for $50","review":"Let me start by saying that I have not had this jacket long enough to know how it will hold up over time but so far this jacket is amazing.\n\nFit\nAt 6'2\" / 200 (long legs) I was tempted to get the XL but got the Large as I wanted something really light as I have a full winter coat but could not be happier with sizing of the Large.\n\nMaterials\nThis jacket has a really soft and water resistant outer skin. I placed my arm under my water spigot and the water just bounced off and two quick shakes of my arm and it was dry. The inner liner is very good at storing body heat so you could probably get away with this being a three season jacket if you live in an area with relatively mild winters.\n\nFeatures\nThere are four pockets on the jacket I have, two traditional waist-level jacket pockets on the left and right with an inner pocket and an outer left arm pocket. The two hand pockets are decent but a little shallower than I expected. The inner pocket is nicely sized and readily falls to hand. I will likely never use left arm pocket as it feels odd to access and awkward to zip back up. Speaking of zippers, all of them appear to be of at least decent quality as the zippers feel decently robust and the tracks are metal. It is a bit annoying that the main zipper on this jacket is on the left which is different than any other jacket I have owned and takes a little brain retraining to get use to.\n\nOverall\nI have spent a lot of money on jackets in the past but also got my money's worth. I went a bit cheaper this time but I am pretty impressed even in the short time I've worn this one. I will add an edit if this impression changes due to unexpected quirks or wear."},{"name":"G Unit","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Wrinkled. Must steam.","review":"Jacket is nice. But shipped wrapped in plastic bag. Put in washer, hung to dry and then steamed on low setting to get all the wrinkles out. I would never wear the jacket as shipped. The wrinkles are bad."},{"name":"Kindle Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Good jacket","review":"I wore the official military flight jacket for years, i wore it out after 20 yrs, so I was looking for a replacement, and this came highly reviewed, so I figured what the heck. It arrived as stated, and in pretty flat shipping bag. I was alittle disappointed because it lack the sheen like the photo, but I wore it outside the next day, 50F, and sunny, I got really warm fast and had open up the zipper, it moves well and fit nice, will be my yard work and local hiking and walking jacket on those cool days."},{"name":"Woods13","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Early spring/late fall","review":"Decent coat for the money. Not as warm for winter weather as I had hoped. Polyester fill is fairly thin."},{"name":"Dave Garcia","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Cool jacket","review":"I bought this for my son-in-law for Christmas. He really liked it. He said even though it is not overly bulky, it was still warm. A good buy I think."},{"name":"Repairman","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Nice jacket, but the zipper is on the wrong side.","review":"Nice lightweight windbreaker jacket but the zipper is on the wrong side."},{"name":"GS","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Nice jacket","review":"Just what I was looking for. I bought my father one too"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great Jacket","review":"This was a gift for my uncle. He loved it! Color was beautiful, great collar and lining. Fit perfect. 9"},{"name":"AD VAN DYK","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" Flimsy, not thick at all","review":"I thought it would be much thicker. But it's really flimsy. Not suitable for winter at all. The size is good. I'm 6.2 and ordered an XL.\nI also have a real Alpha Industries genuine bomber jacket and it's 10x thicker than this one. Also the green is not like on the picture advertised.\nOH well, I'll wear it in the spring and fall."},{"name":"Canada Neu","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" YOU WILL NOT GET WHAT YOU SAW ON THEIR ADS.","review":"As first sight, it looked a well made wind breaker but details and quality don't match what they shown.\nJoint of elastic waistband and main body is single, not doubled stitches like their photo shown. Inside pocket is the same (single stitch). Zipper is cheap looking and not even close to what they showed on the photos. Pencil pocket is made with single layer of fabric with no thicken edge. If you use this, soon the fabric will be torn.\nSomeone mentioned that inside smells like old insulation. I agree. It has old hay like smell. I'm not sure if the smell goes away eventually. You need to order one size bigger than what you normally buy.\nWhat they showed as good features/quality are not there. You should check your jacket very closely if you bought one. The price is reasonable but YOU WILL NOT GET WHAT YOU SAW ON THEIR AD."},{"name":"Ryan Kells","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" My Review","review":"My jacket order was fast. Ordered on Sunday, received on Wednesday. Colour (navy) and quality as advertised. It;s not a puffy coat and it's not real thin. Somewhere in between. Size chart and sizing is accurate. I'm 5' 10, 210 lbs (size 46 suit jacket), I ordered an XL and it's great. My son is 5' 11\", 175 and the XL is not too big but L would be perfect. Zipper was a LITTLE wonky like others have mentioned in their reviews. All in all, very satisfied."},{"name":"Laurence Dube","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Nice quality and good looking but size chart is seems to be missing","review":"I like the material and model of this jacket. Tend to get puffed up a bit since there are air pocket in the insulation. Nothing major but this jacket won't drop super straight on you. Giving only 4 stars because middle zipper is a bit hard to start and there were a couple of loose threads of fabric I had to remove here and there. All seems ok but was not expecting to do this with a 50$ jacket. The size chart was missing to ended up ordering a Medium and a Large. I am 5'10'' and weight 180 lbs. Large was perfect for me. I am super satisfied of the look of the jacket."},{"name":"Kent","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Solid Lightweight & Warm","review":"For me this jacket is perfect! Zipper works great and YES it is LH but that is traditional in this style jacket. Just get used to that guys! Although it weighs next to nothing it slips on easily and is perfect warmth for me even here in Northern Ontario. Yeah dead of winter I will be layering anyway and I do have a parka this is the COLD NORTH! Most of the year this is going to a perfect casual jacket!\nI don't know why so many are complaining about the quality this is really nicely sewn and all the zippers work smoothly etc.. Do yourself a favor and give it a try!"}]},{"id":"u6NtRk","title":" Essentials Men's Lightweight Water-Resistant Packable Hooded Puffer Jacket","imageUrl":"https://m.media-amazon.com/images/I/81TnIAEZoBS._AC_UX342_.jpg","price":"$24.40","description":"Amazon Essentials is focused on creating affordable, high-quality, and long-lasting everyday clothing you can rely on. Our line of men’s must-haves includes polo shirts, chino pants, classic-fit shorts, casual button-downs, and crew-neck tees. Our consistent sizing takes the guesswork out of shopping, and each piece is put to the test to maintain the highest standards in quality and comfort.","reviews":[{"name":"joel oleta","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" felt like it wasnt going to do the job, i was wrong its great","review":"Well i bought this so i can have an affordable puffer jacket i can abuse and not feel bad about. used it for everything and anything that involved being cold outside.\nNot wanting to risk expensive jacket incase i ruin it or hate it i purchased this one but so far it has withstood the abuse. i am pleased with the purchase and i recommend it if your in the market for this item and price is an issue . i have used it for concerts ,camping ,late night shopping trips ,taking out the trash at 4 am also just for the random day hikes .\nthings i like it packs really small and is very light it also comes with its own drawstring bag that seams to match the color you purchased , i think anyhow because i have purchased 4 different colors (Christmas presents for family members ) and all come this way.\nAlso this thing does very well in windy conditions it seams to have a very thin feel for a puffer jacket but the small amount of insulations paired with the inner and outer shell of jacket material reminds me of safety blankets ability to reflect body heat back to you this feature for staying warm is doing great for lack of \"poof\".\ni took this to a outdoor concert in LA (besame mucho) and it was very cold and windy because of concert rules only small see through bags were allowed so i brought this jacket in its drawstring bag and took a very small amount of space and was perfect for the situation kept me warm through the whole night night. had very large outside pockets with zipper closures and very deep inside pocket behind the outside zip up ones, they seam to share the space keep this in mind when placing bulky items one side will use space from the other even thought they are separate a pocket . the hoody does not have draw strings but i dont feel needs them i think we have gotten use to everything needing drawstrings, it is a bit spacious inside the hood i guess if you have a beanie or a baseball style cap it should fit fine and extends just before the bill of cap. i just hated that they tried to ship it in no box just a clear see through bag the first time had to return arrived damaged.\nIn new condition its durability is uncertain until this point it has held up (2months), not sure yet the feel is not the toughest it has a thin feel but notably i have not torn it and it has at least been through the wash once keep in mind i airdried all this said it looks brand new and is in great shape , i would whole heartedly recommend this jacket just look for the deals also get the vest for an added layer of warmth"},{"name":"Bill O.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Runs a little big but does a good job of being a lightweight jacket","review":"The main purpose of a lightweight jacket is to keep you warm when it's cool outside but not super cold. For me that means I purchased this jacket for temps between 35 and 60. I wouldn't want to rely on it any colder than that. For that purpose, it does extremely well. I don't feel too hot wearing it in the upper 50s, and as long as I don't spend hours outside when it's in the 30s, it keeps me warm.\n\nMy only knock is that the sizing feels like it is from 20 years ago when everything was a bit more loose fitting. That's good if you want to layer up, but the styling is not the current trend of slim/ form fitting. Since I'm an older guy now, that's not as important to me, but it may be for others."},{"name":"Linda-Lu","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Loving it so far","review":"I bought a man’s jacket for the extra length and larger pockets. I know the sleeves are too long. But idm. I’ll just roll them up. A size down would’ve been better, but there’s nothing wrong with a little extra space for layering. (I’m not doing any fashion shows). My comfort is my priority.\n\nThe jacket feels good on. It’s light weight.\nIt stores nicely into the sack provided and comes out wrinkle-free. It allows for a sufficient/confortable heat and is rain resistant (in a light rain). I tested it out today.\n\nOverall, I am VERY VERY happy with this jacket. I’m glad I bought it.\n\nI only wish I had another one to alternate between colors."},{"name":"Breck","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Fantastic Value Puffer Jacket","review":"Is this the best puffer jacket you can get? Probably not. Is it a fantastic value, high-quality puffer jacket for a fraction of the price of others? You betcha. Very pleased with this jacket. I did order a size up and I'm glad I did. I typically wear an XL, but I ordered an XXL so I can wear it over thicker hoodies and sweaters and I'm glad I did. I don't think the XL would be as comfortable over bulky layers. The XXL is almost too big though, I wish there was like a 1.5 or something. But I'm still very happy with it. It's a higher quality jacket than I was anticipating. It's very lightweight and packs up super small when you need it to. If you're looking for a quality jacket for chilly weather, you won't be disappointed."},{"name":"Jerry L.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Worth It","review":"If you need or want a good puff jacket that you can easily pack into your hiking pack and a just in case you need it jacket this is it. I have a Columbia one as well that is much warmer to be honest but I got this more for cool fall days, it is truly worth the price. When it gets wet I do not feel like it is making me wet so it has good weather resistance. If you are a guy who is not small order a size up than you normally would get, it will fit you much better."},{"name":"A-Aron","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great Versatile Jacket on Grand Canyon Backpacking Trip","review":"Took a risk on this budget jacket as a lightweight warm layer option during a three day Grand Canyon November backpacking trip. Setting out, I wore frog toggs on top of this jacket as a water resistant layer as we descended the south rim in a “winter mix” as one ranger referred to it, a sideways barrage of freezing rain and hail. We were moving at a good pace with 40lb packs, but this jacket kept me at a perfect temperature for all days of the hike. At night, I wore it to bed in a 20-degree sleeping bag and it kept me toasty as overnight temps were near freezing. I thought it might be a single use type of product, but I continue to wear it as a primary option out and about when I want to stay warm. I’ll likely take it on another trip and will happily do so. I wouldn’t trust it in a downpour, but it can take a short, light sprinkle without issue. Zipper is higher quality than expected, hood is prefect, comes with a small stash bag."},{"name":"Sush.Diss","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very comfortable","review":"This is a very lightweight yet effective jacket. Keeps you warm. It has two large pockets closed with zips (no chest pocket or inner pockets). The hood does not have a zip code to tighten around the face. The main zip slider is strangely on the left. It slides easily.\nBut this is a very comfortable jacket. Well worth the price. I ordered one size larger as my arms are longer than what it should be. So it fits slightly loose on the chest.\nOverall I like the jacket. Would recommend to others."},{"name":"Matt Morris","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Nice but baggy","review":"Nice jacket. Smooth, soft, warm, comfy. I'm a 41\" chest and it fits nicely around my shoulders chest and arms, but it's pretty baggy around the stomach. As there's no elastic at the bottom it's pretty loose. Will likely see if a tailor can put some elastic in it or something. Probably better off waiting to see if Trespass have anything in the Christmas sales to be honest."},{"name":"Kiran","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Good value for money","review":"100% Good value for money\nQuality is better than what I paid.\nOnly one suggestion or downside, this is not adjustable, they could easily make this adjustable but still deserves 5 star\nReduced 5 to 4 stares for the following reasons:\n1) Zipper is apposite side (this is not related to cost )\n2) Tested on moderate chilli wind and it doesn't stand. (I understand it is a lightweight but I expect it holds for moderate cold weather )"},{"name":"Jerry C.B.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Lightweight and good fit","review":"Accurate sizing.Comfortable fit;ideal for spring or autumn when weather is more unpredictable.Not easy to fit into bag provided but otherwise as good as expected.Slightly overpriced but, overall, no complaints."},{"name":"ardbigyin","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" dont like zip on womens side","review":"bought from  warehouse i bought xl iam roughly 46/48 maybe should have bought large as loose on me would not pay full price that amazon are asking for"}]},{"id":"Eqson7","title":"Levi's Men's Washed Cotton Hooded Military Jacket","imageUrl":"https://m.media-amazon.com/images/I/81ue5-58RmL._AC_UX385_.jpg","price":"$56.14","description":"This jacket in rich neutral colors will you keep as warm as you need to be with its removable hood and lining.","reviews":[{"name":"Justin","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Review from a tall dude","review":"I feel like I got very lucky with my purchase here. I pulled the trigger on the tall and am so glad that I did because it's just the right length in the arms and the torso. For reference, I'm 6'3 and around 210lbs and I got the large tall. I would opt for XL a lot of the time but with reviews saying this ran big I decided to stick with the large.\n\nThis is made of really sturdy materials. Not as sturdy as something like a Carhartt for example, which in my opinion is almost too tough (and quite a bit more expensive), but it feels like this is built to last a good while. The detachable hoodie part is a really cool touch. The wrist cuffs have two buttons for a looser or tighter fit. The inside of the torso is sherpa while the inside of the arms is a nice quilted material. The front pockets for your hands are on the sides, although the pictures make it seem like they would go in under a flap. I got the brown version (lighter one) and it's exactly as pictured. Overall I'm happy with this coat overall and look forward to perhaps buying other colors."},{"name":"Barredbard","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" A Great Fit for an Understated Look","review":"I had always wanted a winter coat that didn't quite look like one, or have the bulk and heft of one. The somewhat pseudo-military or even quasi-cowboy look has always appealed to me. I am thrilled with this coat. I usually wear a large, but with winter coats I tend to get a size up, to accommodate any garments underneath. It was the right call. The look is crisp and understated, which is what I was going for. With the hood, it's a blend of the trendy, with the classic.\n\nAs I wore it for the first time, I thought the only thing missing is the ability to remove the hood at my option. I checked, and low and behold, the hood can be unzipped and removed. I am not sure why this important feature was not mentioned. I almost did not buy it because I was debating that white hood. The fact that it can be removed is excellent.\n\nGreat coat."},{"name":"Malckiah","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Buy it!","review":"I bought an XXL based on what everyone was saying. I ended up sending back for XL which I never do... but when I got the wrong size I could see that this jacket was WELL worth the money. Definitely a good quality jacket that will keep you warm. I would definitely reccomend and it was worth the trouble to send it back for the right size. I am 5\"10... 190lbs... XL is perfect for me."},{"name":"Aqueeta Parker","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" The perfect winter jacket","review":"I have been looking for a jacket for my boyfriend for some time and finally stumbled on this on. It is a perfect fit, he is 5’11 200 lbs, just below is waist. We got it in a size large, it is the perfect jacker for the rainy winter season because it works well at a rain jacket as well as a layered winter coat."},{"name":"Louis arc","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Fits comfortably but durability is questionable","review":"After less than a year with this jacket, a portion of the back has a rip about 7 inches long and has exposed the cotton underneath. I would like to arrange for a replacement if possible because it is a nice jacket but can't continue wearing it as is."},{"name":"E. Brooks","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Narrow shoulders, wide waist","review":"My husband is broad shouldered and slim waisted, he is also tall. Got him an XL and it was too large through the body and much too small through the shoulders."},{"name":"robert dolan","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" I like how it looks and feels","review":"Step above a Hoodie jacket can wear with other jackets under the coat or with a coat over it very warm I have 2 of them now."},{"name":"Janine W","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great jacket 👍👍","review":"Gift for my husband and he absolutely loves it!! Commented numerous times how much he loves the fit, the look and the style. Definitely two thumbs up 👍 👍 purchase!!"},{"name":"rjg.1969","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" You won’t be disappointed!","review":"Good fit. Quality jacket. Quality brand."},{"name":"P Williamson","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect","review":"Excellent fit"},{"name":"Glen","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Not good quality","review":"I love the look of this jacket, but I must say the quality has left me disappointed. The fit is not overly generous for the size I bought, but it's OK. The main issues I have had are that the zipper pull broke on day one - not a big problem, I was able to rig a replacement, and yesterday (just after the return period closed), a seam on the right sleeve at the back of the shoulder opened up about 4 inches. I had to take the jacket to a tailor to repair it. I have only worn the jacket a few times so far, so there's no way it should be coming apart already. Really not impressed.\n\nUpdate 22-2-22 - today the seam on other sleeve came apart as I was simply reaching up to take off my hat. This jacket is SUCH poor quality - I STRONGLY ADVISE AGAISNT BUYING ONE. I will be contacting the seller to see if they will refund, even though the date has passed."},{"name":"Mau","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Calidad excepcional","review":"Me encantan los materiales, el forro, el teñido y la talla. Creo que es la primera prensa que siento me convenció en todo aspecto"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Too short","review":"Way too short on me, bought a large and the only sizing charts are for chest size but nothing about length. I am 6'4\" and unfortunately only realized it didn't fit after I removed the tags. Every shirt I own sticks out the bottom of the jacket. I like the quality of it though but it would be nice if I knew what size would actually fit me."}]},{"id":"A1S6LD","title":"Columbia Men's Ascender Softshell Jacket","imageUrl":"https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/71gluQqwAYL._AC_UX342_.jpg","price":"$58.70","description":"This wind-and-water-resistant softshell will keep you warm—whether you want to stand out or blend right in. It's built for foul-weather outings, with a comfort stretch fit, an adjustable hem, and adjustable cuffs. Made of a durable yet light 100% polyester, with a soft, abrasion resistant chin guard and multiple zippered pockets. Columbia offers this jacket in multiple colors and sizes. Regular Fit. Extended sizing available. To ensure the size you choose is right, utilize our sizing chart and the following measurement instructions: For the sleeves, start at the center back of the neck and measure across the shoulder and down to the sleeve. If you come up with a partial number, round up to the next even number. For the chest, measure at the fullest part of the chest, under the armpits, and over the shoulder blades, keeping the tape measure firm and level.","reviews":[{"name":"Justice A.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Most durable jacket I’ve ever owned.","review":"I have a black Ascender jacket I purchased back in 2016. I’ve worn it 3-5 times a week, 5 months a year for the last 6 years..\nI’ve done yard work, mechanic work, and carpentry work in it consistently during that time. I always knew I could i could throw it in the washer and it come out good as new with the same vibrant color. Until the fateful day I wore it while painting outside..\n\nAcrylic paint doesn’t come off easily, so I had to purchase another for wearing out to dinner and such.. Now my original jacket is worn solely for work and still; Another few months later, no holes or rips in the fabric, and the cuffs and collar are un-frayed and fit perfect.\nAmazing stuff!"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" The quality is still there for casual Columbia fans.","review":"I was spooked by some finger reviews saying the quality had drastically dropped but mine came in as advertised. I bought one of these jackets maybe 6 years ago now and I imagine this one will last as long. The only thing is I wished they had lined the collar with the fleece material like on my old one instead of leaving it bare.\n\nMedium fits me perfect for the weather I wear it in (40's to 50's with a t-shirt or light long sleeve shirt. Anything colder requires a heavier coat)."},{"name":"Mark W","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Nice jacket","review":"Jacket fits true to size (recommend using the sizing chart). Jacket works well and keeps you warm between 40-50 degrees. If you are looking to layer up with this jacket, I would recommend ordering the next size up. Overall very pleased with this jacket."},{"name":"Appaiah Mallu","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Good","review":"Good but my father told me it is bit tight."},{"name":"Thad Riley","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great quality","review":"I bought this jacket as a replacement for my previous Columbia jacket that I seem to have lost. That was a great jacket as well but the outer material was different, more of a nylon woven type of material. This jacket is more of a shell. The design is very sharp, smooth and simple. The material is extremely resistant to dirt. I was recently working an event where the jacket was under a table on a concrete floor for the entire day. I was worried about it getting very dirty, but when I pulled it out there was no dirt on it in spite of there being a lot of dust bunnies. Love the jacket and will replace it with the same kind when this one has lived its full life and moved on to jacket heaven."},{"name":"DaisyGirl51","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" He is between sizes so this was the perfect size to order. Will get a couple of years wear.","review":"Jacket is perfect. Our grandson thought his dad was \"sharp\" in his and loved it so we got him one for Christmas/ He wore it for his \"performance\" at his Christmas school program. He loved it!!"},{"name":"Edward G","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very love this jacket!","review":"Exactly what I need."},{"name":"Mor Messry","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" The perfect jacket for outdoor job. Thanks.","review":"excellent and good value for the price."},{"name":"David Far and Wide","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Not bad, solidly built. A bit too baggy for me.","review":"It's a really solidly built softshell - very substantial and definitely not for warm days. Keeps the wind out well and is styled in a way that means it's probably more towards casual wear than technical.\n\nI didn't really love it in the end though because the sizing was too much on the large size. I'm on the small size really - 37\" chest, 5'7 height - supposedly a SMALL in Columbia, but although this fit okay, it wasn't the technical or slim fit I was hoping for - more baggy and boxy, hanging off me rather than close to the body. Great if you want a wear a full weight fleece underneath I suppose."},{"name":"Colin C","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Excellent quality","review":"After some adjustment this now fits rather well and I am quite pleased although the price, including postage, is higher than direct from Columbia UK."},{"name":"Vincent Miller","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Excellent quality jacket","review":"Good quality jacket"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" Poor Quality Zipper","review":"After just a few months of wearing the jacket the zipper broke. Luckily  looked after our problem and had a new jacket sent to us. Columbia`s customer service department was TERRIBLE!!! They wanted me to send the jacket back at my cost so that they could evaluate whether it would be considered under warranty OR go to a tailor to have the zipper fixed. We live very remotely and the nearest tailor is over 2 hours away. When I asked whether there was another option they said NO. Again, Amazon came through for us and reafirmed why I love ordering from them. I won`t be ordering a Columbia product again and give their customer service department a 1 star rating."},{"name":"Allan Pendlebury","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Very comfortable but zipper broke after six months and little use.","review":"It is a very comfortable jacket. It seems to hold wind at bay and although I haven't been out in any heavy rain, just light rain that beaded on the jacket without soaking in. I did read another review where the zipper wasn't heavy enough. It isn't as heavy duty as my last, but so far works well. I will practice more care when doing it up; just in case.\n5/15/22: Edit: Just out walking dog in what I would say was moderate to heavy rain and stayed dry under jacket.\nSomething else I forgot to mention: I really like the breast zipper pocket to store my smartphone while hiking.\n10/24/22: Edit: Zipper broke this AM. I haven't worn it over summer so not that much use; have to reduce the stars to 1. Everything else is fine but it has become a throw away and search for another jacket with sturdy zipper."}]}]