[{"id":"RkihjP","title":"Gatorade Thirst Quencher Powder, Fruit Punch, 1.23oz Packets, Makes 20 ounces ,80 Count (Pack of 1)","imageUrl":"https://m.media-amazon.com/images/I/81Q4pxAu1FL._SX425_.jpg","price":"$69.99","description":"About this item\nIncludes 80 (1.23oz) packets of Gatorade Thirst Quencher Powder, Fruit Punch flavor. Each packet makes 20oz of Gatorade Thirst Quncher.\nWhen you sweat, you lose more than water Gatorade Thirst Quencher contains critical electrolytes to help replace what’s lost in sweat\nTop off your fuel stores with carbohydrate energy, your body's preferred source of fuel\nTested in the lab and used by the pros","reviews":[{"name":"Josh","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Just what I buy at wal mart","review":"So I read alot of comments that was against this and some said it was exactly what they ordered. I was concern about that. However only reason I bought this off  bc my local Wal marts is having a time keeping it in stocked so for the same price I figured I just order it off Amazon. Well seeing g all the reviews I was like idk if I should order it. Well I did any way and needless to say this powder is the same I buy at Wal mart. I work outside in the heat so this works for me.. I'd be buying this again off Amazon."},{"name":"Jaclyn M Armstrong","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" So Convenient!!","review":"These are Amazing! It is so easy to throw in my purse, car, gym bag and if i am not feeling well, I have them with me and do not need to stop anywhere! Plus the to-go packets are thick enough that they don’t break or get punctured in my purse which I am really thankful for! Also, I leave some out by my coffee area so if I have visitors that don’t feel well, they can just grab one- they are a huge hit! There is no sacrifice on flavor, either- I will buy more!"},{"name":"Steven Chin","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Best bargain for Gatorade","review":"This is a fantastic product and a money saver. It comes out to 37 cent per pack to mix in 20oz water. Buying the drink normally is from $1.50 to $2.00. You can also mix to the level of sweetness you want. Great with water bottles or thermo type bottles in mixing the drink. Easy to carry around drink packs to use when traveling, running, riding bicycles, or any outside activities. I use it when I ride long motorcycle rides where you are in the hot sun and hydrations is very important. It helps with electrolytes and prevents cramping and dehydration. Water absorption is better with this mix than straight water, it has a better fluid absorption rate for the body."},{"name":"MI User","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" I never knew this stuff existed","review":"I like Gatorade, but I find it too strong so I always water it down. this is so much cheaper than buying premixed, plus I can make it whatever strength i want. I like to mix it at around 1/3 strength for use in my hydration backpack. I keep some at work, some at home, and some in my backpack. two packets in my hydration bladder is perfect."},{"name":"Fred Marshall","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Only thing I can stomach when sick","review":"I have known for years now that Gatorade is the only thing my stomach will tolerate when I am sick, either by virus or food poisoning which I think I have this time. It is getting increasingly difficult to get to the store to buy a 28 oz bottle for $1.39 when these pouches make a 20 ox bottle for a whole lot less. This is the way I am going to store it from now on... don't have to worry about it freezing in storage now... Great taste, makes me feel much better getting the fluids back in me."},{"name":"Sicily","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Love How Handy These Are","review":"If your kids are anything like mine, sometimes they just want plain water and sometimes they want Gatorade. These are perfect because I just throw a few in their supers bag, fill up their water bottles and head out. If they decide they want Gatorade, just crack open a packet and toss it in. The flavors are great and they cost a fraction of just buying a pack of Gatorade in bulk from Costco. Would absolutely recommend for any busy sports parent!"},{"name":"ReverendOlaf","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great for stocking up","review":"So I've become a bit of a food hoarder, but I'm trying to be practical. I'd rather have three of these tubs than 18 gallons of liquid. I add a bit of sucrolose to make it a bit sweater, and it tastes much better than I recall as a kid. I don't find it chalky or bad at all. I also stocked up on the liquid concentrate (fearing this would be chalky), and I haven't felt the need to try that (yet). This is much much lighter and compact, so I'll likely stick with this over the liquid."},{"name":"Jim Henri","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Gatorade","review":"Works for me 1/2 the price for buying in stores\n2 of the 1.23 oz.packets make 32oz bottles which I saved from a former purchase from store"},{"name":"nikhil shinde","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Not value for money","review":"Too costly.. u can make only around 16-17 500ml bottles.. which u can buy for a total of rs 800 in any supermarket and that to ready to use.. whereas the powder is almost double that price.. wont b buying the powder again"},{"name":"Yogesh","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" Not Gatorade","review":"I don't think so this is Gatorade powder. They have mixed some orange powder like glucose or something. This does not give gatorade taste at all."},{"name":"Nawaz","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" FAKE","review":"Don't buy its a fake product. It's not a original gatrode product"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" THIS IS FAKE!!!!!","review":"This is fake. Just compare the two images. I don't need to say anything. The writing is either blurry or like in this case absent."},{"name":"Eric","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" This only makes 2 gallons!","review":"This is way to small for the price I actually thought it was a mistake."}]},{"id":"skNCcQ","title":"Under Armour Men's Tech Golf Polo","imageUrl":"https://m.media-amazon.com/images/I/513HWlYAMPL._AC_UX385_.jpg","price":"$27.36","description":"100% Polyester\nMade in the USA or Imported\nPull On closure\nMachine Wash\nTextured fabric that's soft, light & breathable\nMaterial wicks sweat & dries really fast\n3-button placket\nShow more","reviews":[{"name":"Aslan","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Greatest polo I own!","review":"I originally got one for work because it said it was breathable and I work outside in 90+ degree weather with high humidity for most of the year. It is the most comfortable and breathable polo I have ever owned. I now own 5 and wear them everyday. I would high recommend them! I was them on warm and run them through the dryer with no shrinking or break down yet. I am 6 ft 1 and weigh 215lbs. I got Lg shirts and they fit perfect."},{"name":"Roordaboy","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very good quality and soft/comfortable","review":"I'm 5'9\" and 220 lbs (all in my stomach). I'm at that awkward weight where sometimes Large is too tight and sometimes X-Large is too big. Via Prime Wardrobe, I bought this in XL and LG - the LG was a little snug while the XL fit perfectly (though slightly more length than I would like). I would rate this as \"true to size\". Very comfortable and virtually wrinkle free. If you're not on a tight budget, I would definitely recommend this for the price if you appreciate soft, comfortable, polyester polo sport shirts."},{"name":"Omar Siddique","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" nice golf polo, works in heat","review":"The golf polo isn't my ideal style, but it strikes a balance between the casualness of a tee and the effort of a button-down, especially for daytime wear.\n\nThe material in this version is a little thicker physically than I expected (a good thing, no undershirt required) , but surprisingly breathable and cool wearing through the magic of technical fabrics.\nI wore it through an entire day, heavily outdoors, during the peak of the sticky South Florida summer, and was more comfortable than I expected to be. It also doesn't seem to stain or sweat through very easily. Pleasing.\n\nPricing seems to vary, but these shirts are a bargain at the occasionally lower price on some color. They also work well for the new Work-From-Home normal, where you want an easy-wearing shirt with a collar for those Zoom calls.\n\nI have several of this shirt, and one of them has lasted through multiple wear&wash cycles, without any signs of pilling or deterioration. Highly Recommended."},{"name":"Joseph & Lydia","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very very comfortable shirts that fit well and look great. Material will run if snagged.","review":"These are very comfortable shirts. The material is silky smooth on the skin. The fit provides plenty of room for moving around yet they still have a fitted look- Great for middle aged guys that stays in good shape. Love the color selection. These shirts really look great. My only complaint - They will run if you snag them on anything sharp. I avoid wearing them when I'm working around the house, fishing or playing with my cats. If you get a small run from let's say your fingernail it can be easily worked out by stretching the fabric across the run while rubbing the run with your finger. Then stretch in the other direction while rubbing the fabric. But a big long run - can't do much about that."},{"name":"Mr. Jim","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" I look good!","review":"Love the shirt very comfortable definitely a great shirt to wear when it’s hot and you want to look good."},{"name":"gail","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" Came apart at seams","review":"My husband loves this shirt but after only one washing it came apart on the left side at the seam . I have purchased these before with no problems and disappointed with this one. I'm in the process of sewing the seam but for the price of these shirts I shouldn't have to be fixing it."},{"name":"Mark Mangham","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Fits and looks great but it’s delicate.","review":"Shirts fits great. This is the 3rd one I’ve ordered. Only drawback is you can’t let anything snag it. The first 2 that I ordered last year ended up getting “thread pulls” on the front when I let a clipboard or something touch them and it snagged. Never had any other polo do that before but it may be because of the material it’s made of. Looks great but it snags easily on things."},{"name":"DAVID L.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Nice shirts. Hopefully not too heavy for summer","review":"It was time to replace my old worn Izod polo shirts (typical cotton) which are my go-to work shirts, and I wanted something a little more sporty looking. The Izod polos are a bit heavy, and I need something that has a lighter feel, breathable, for the hot humid weather here in the southeast.\n\nIt’ll be a few months until that hot humid weather hits, but I can say that these shirts are far more comfortable than those thick heavy Izod polos. These Under Armor polos are made with a fabric that is slightly heavier than a typical athletic/golf polo, so I hope it isn’t too heavy for June-July-August. Time will tell. But so far I am very happy with these shirts. They seem to be very well made."},{"name":"GB","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Watch what you are being charged keep price tags !","review":"All colours comes with a price tag indicating $39.99 in the packet from Under Armour.  is charging anywhere from $45.99 to $58.99. I am awaiting Credit Notes or I will advise the Quebec Office of Consumer Affaires. The Law in Quebec reads: Where 2 prices appear-the lowest shall prevail."},{"name":"Marc","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Comfortable, usable all day, has good odor control, looks very nice","review":"It fits nicely, it is NOT a tight fit. This is not a compression shirt. very good quality. Odor control is exceptional. I am comfortable at many different daily temperatures, and it obviously breaths well. It also looks very nice. The photos on the site do not do it justice. For example the black version, with the grey accent, the photos make the gray look very light, while in real life the grey is darker. I normally like solid single color shirts, but this is one of the few exceptions to this rule in my wardrobe. I am actually very happy with it. The Black isn't the shinny/glossy of most artificial fabrics, but it is also not the flat matte of cotton. This shirt will probably still look nice, in a fashion sense, 10 or even 20 years from now. While not formal, it is nice enough, to be casual office and even casual business attire. I can see going to a good restaurant, with slacks and this shirt and not looking out of place"},{"name":"Marc","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Really good Polo Shirt, excellent odor control, very nice looking shirt","review":"I wrote a review on the navy blue ones that I got. I like it so much, that I got two in the black, despite my being concerned about the gray accents being used. But upon seeing in real life, I was very happy with it. the grey on the black, just like the lighter blue on the navy blue, is actually darker than the photos show. It in fact looks very good. quality construction. Odor control is excellent. Fits according to the size you would normally get. Comfortable for all day use"},{"name":"T. Jackson","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" breathable polo","review":"Like most UA clothing this is really well made and finished. it's a surprisingly heavy weight material but is a very breathable polyester fabric rather than cotton. Whilst it is probably a golfing shirt, I bought it for casual cycling in hot weather and it works well for this. The sizing is a bit on the large side though, I'm typically a M or L in a polo shirt, but the medium size was way too large and I had to return it and order a small, which is a great fit. I'd recommend order a size down from your usual."},{"name":"Clive Morris","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Do not think this is a genuine Under Armour shirt.","review":"The shirt fitted well is comfortable to wear,but I am not sure if this is a genuine Under Armour product. The material lacks quality and looks and feels like a copy."}]},{"id":"P44iTB","title":"5 Pack Men's Dry Fit T Shirts, Athletic Running Gym Workout Short Sleeve Tee Shirts for Men","imageUrl":"https://m.media-amazon.com/images/I/81vzetxuSvL._AC_UY445_.jpg","price":"$26.99","description":"90% Polyester, 10% Spandex\nImported\nPull On closure\nMoisture wicking fabric is quick-dry & ultra-soft, keeps you cool and dry anytime.4-way stretchy material for excellent flexibility enhances the range of motion.\nAthletic crew neck & short sleeves, Perfect for running, workout and training sports and even as an moisture wicking undershirt.\nIdeal for cooler days, but still very comfortable to wear in summer. Safeguards your skin from harmful Ultraviolet Rays.\nUnique tag-free printed necks and light weight design.\n5 Pack Men's Dry-Fit T Shirts. Multiple color combinations, multiple choices.","reviews":[{"name":"Mark Twain","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" These It's are great for the price","review":"These T's are soft, fit as they should and cool to wear, would buy again"},{"name":"Kate","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great deal","review":"These shirts are very nice. I was skeptical at the low price. My dad is recovery from a surgery and bedridden and one of his side effects from his condition is he gets very hot. I got these to help him stay cool and not get as sweaty as he does on his regular tee’s. They are working great and they are super soft. I imagine they’d be great to work out on."},{"name":"K. Matt","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great Value! Work for Sublimation Printing!","review":"Great value for the money! Bought T-shirts for Screen printing or sublimation for our brand and I needed something moisture wicking for my husband who works outside doing 3-4 hour photography shoots. They worked amazingly well for sublimation that usually is only for lighter color shirts. Two these to 3 different screen print/t-shirt shops for various things and all of them were impressed with the quality for the money. The pic is a direct to garment sublimation. Size of the one in pic is XL"},{"name":"John Gallagher","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great price","review":"Fit is perfect"},{"name":"Auttumn Gebbink","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Comfy","review":"My husband loves these shirts. Fit as expected and very comfortable"},{"name":"M. Talley","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect for vacation!","review":"I love the fit of these shirts. They are true to size. Totally wrinkle free and cool and comfortable to wear. These are such a bargain. I would have paid much more."},{"name":"Amy Lieber","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Breathable","review":"5 shirts for this price is a steal! they are soft, comfortable and more important since I bought them for my son who is a chef in a kitchen that's very hot they are breathable!!! they wash easily and hang dry quickly!! the fit is perfect and the material doesn't scratch!! definitely a summer must have!!"},{"name":"Pen Name","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great shirts","review":"I bought these for my husband. He loves the softness and coolness of these shirts. Fits true to size. Would buy again."},{"name":"Liliana A.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Mala calidad en el cuello","review":"La tela y medida excelentes, el problema es el cuello, demasiado grande llegaba y muy maltratados y no es así el modelo porque solo una venia perfecta las otras horribles ya se regresaron"}]}]