[
	{
		"id": "EruE8Z",
		"title": "adidas Men's Aeroready Sereno Cut 3-Stripes Slim 1/4-zip Training Top",
		"imageUrl": "https://m.media-amazon.com/images/I/51IPfhnRJrL._AC_UX385_.jpg",
		"price": "$17.30",
		"description": "83% Recycled Polyester,17% Elastane\nImported\nZipper closure\nMachine Wash\nadidas mens Jacket\nThe adidas brand has a long history and deep-rooted connection with sport. Everything we do is rooted in sport.\nDriven by a relentless pursuit of innovation as well as decades of accumulating sports science expertise, we cater for all, from elite professional athletes and teams to any individual who wants to make sport part of their lives.",
		"reviews": [
			{
				"name": "Maval42",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Light, fashionable and good quality.",
				"review": "I use this top for my morning runs. It is a fitted top, comfortable, breatheable material and wicks perspiration quite well. Design is conservative and, overall, another great Adidas product."
			},
			{
				"name": "HC",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Good quality and comfortable",
				"review": "I bought it for my husband, and he likes it."
			},
			{
				"name": "Poline Mirithu",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Love it",
				"review": "Looks really good, light weight to"
			},
			{
				"name": "Michael Money",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Fast",
				"review": "Fast delivery good shirt, bought again"
			},
			{
				"name": "Gabriel G.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great",
				"review": "Great"
			},
			{
				"name": "Anvia R",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " You won't regret",
				"review": "It's a cute top I love it"
			},
			{
				"name": "Jorge",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Good",
				"review": "excellent quality"
			}
		]
	},
	{
		"id": "u3vd0C",
		"title": "Tommy Hilfiger Men's Waterproof Breathable Hooded Jacket",
		"imageUrl": "https://m.media-amazon.com/images/I/717HT0sHonL._AC_UX385_.jpg",
		"price": "$36.74",
		"description": "100% Nylon\nImported\nZipper closure\nMachine Wash\nADVANCED TECHNOLOGY:  The 100% nylon shell creates gives the jacket water resistant ability; It is paired with an inner mesh lining allowing for shorter drying time; The fabric remains lightweight while still allowing for protection\nSTYLISH FEATURES:  The jacket features the signature Tommy Hilfiger embroidered flag logo on the left chest\nFUNCTIONAILITY:  Convenient front zipper closure paired with two side pockets giving viable storage; The hood features adjustable drawstring for comfort and all weather conditions",
		"reviews": [
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Water Resistent, not WATERPROOF",
				"review": "I ordered the \"Tommy Hilfige Men's WATERPROOF Breathable Hooded Jacket\"  Tommy Hilfiger Men's Waterproof Breathable Hooded Jacket, Charcoal, XL  because the product description CLEARLY states that the jacket is \"WATERPROOF\".\nWhen the jacket arrived, I opened the package and found a tag CLEARLY stating that the jacket is \"WATER RESISTANT\".\nI ordered an XL which fit fine, but I have no idea if the jacket is warm because I didn't bother to try it out before I sent it back!!!\nI for one don't like to be lied to!!\nAlso, If color matters to you Tommy Hilfiger's idea of \"Charcoal\" is far different than mine!! Charcoal is dark gray/black, the jacket I was sent was blue.\nThis is a clear case of Product Misrepresentation!"
			},
			{
				"name": "G C",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " NOT WATERPROOF AS STATED!",
				"review": "Item description clearly states WATERPROOF, tag on delivered item clearly states WATER RESISTANT ........... those are two very different things!"
			},
			{
				"name": "Jennifer Koczan",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Nice",
				"review": "I bought this for my kiddo so he would have a light weight jacket to wear to and from school. It is made from quality fabric and it looks great on him. This jacket fits as expected so buy your usual size."
			},
			{
				"name": "Pamela Lineal",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Hilfiger rain coat",
				"review": "Very nice jacket to wear to walk the dog in the rain. Keeps me very dry. Don’t get too hot it in either."
			},
			{
				"name": "Lorine Ross",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " It fits my father great and he’s 5’7",
				"review": "I love and enjoy shopping on , it’s convenient and most of the time the items fits great."
			},
			{
				"name": "Random Consumer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Comfortable jacket for fall/spring",
				"review": "Great lightweight, water-resistant windbreaker for spring/fall weather. I often get overheated in a normal jacket when working outside so this was perfect. Size fit me as expected."
			},
			{
				"name": "JoeCool130",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great Jacket, Does the Job",
				"review": "I like the look and feel of this jacket. I got try it out in the rain for about 4 hours and it held up well. Light weight with good pockets and a great hood. Would buy again."
			},
			{
				"name": "Bvaughn",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " High quality as expected",
				"review": "Really light and breathable. I don’t feel overly hot with it on. Repels water pretty well."
			},
			{
				"name": "DrDrakeRamoray",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Size large felt like a extra large",
				"review": "Awful Quality. Size large felt like a extra large , the zip was broken and the emblem was like a sticker which will rub off very soon, the whole jacket feels very poor quality and seems like a cheap made anorak. I couldn't be bithered sending it back as didnt fancy posting back to the US for £23"
			},
			{
				"name": "Will D.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Looks as good in-person as it does on the model",
				"review": "This rain jacket / windbreaker is great. It's lightweight, yet blocks just about all the wind and water. Fits perfectly, and matches the measurements listed. The hood could stand to be a little bit larger to help against really bad storms, and I wish it was detachable too. The zipper goes up high enough for dealing with bad storms. I like how minimal the brand logo is. The jacket is really stylish, only hampered by the amount of noise it makes. It's to be expected with a waterproof jacket, but it's still annoying."
			},
			{
				"name": "Paris A.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " De baja calidad y alto costo",
				"review": "Sí bien el color qué contrasta con el naranja de adentro y el verde oliva de fuera son muy bonitos en cuanto a la vista yo a pesar de leer los comentarios que están en esa prenda decidí probar porque me gustó mucho el color pues no están alejados de la realidad los comentarios incluso me atrevo a agregar uno más el sinceramente pongo mucho en duda que sea una chamarra rompevientos Tommy debido a que tanto el logotipo de adentro como la banderita que traía fuera no vienen estampados parece más como si hubieran planchado unas letras y esa es su prueba de autenticidad en las etiquetas que vienen por dentro en ninguna menciona que sea tomy ni que sea importada o algo referido a Tony lo que aún hace más dudar la autenticidad de los productos sinceramente ya la compré no fue de mi agrado total simplemente por el color pero hay marcas y colores más económicos y que en realidad si son originales de la marca que representan aquí la verdad yo he tenido ya otro situación con unos boxer Tommy los cuales si no eran también y originales y eso comprobados en tienda Tommy por lo que yo reitero lean los demás comentarios y ojalá mi comentario le sirva de ayuda para decidir si sí o no compran esa prenda"
			},
			{
				"name": "Achoc",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Abrigo",
				"review": "Ojo, es un abrigo como bien lo dice el título del producto pero es más caliente que un \"Rompe Vientos\" ya que por dentro tiene una tela que guarda el calor, creo que me servirá mucho en la época de lluvias en CDMX, es muy cómodo y la tela exterior se nota que es repelente al agua."
			},
			{
				"name": "Keith Onderisin",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great Jacket - Exactly The Fit I Wanted",
				"review": "This is a great jacket. Simple rain/ windbreaker. Expected material feel and comfort. I'm about 6', 35ish sleeve length, torso length is great, jacket is the TINIEST bit loose on the sleeves as I am a bit skinny now, but when I was a bit bulkier at 180lbs it fit great, and still a biiiiit loose, (but not a problem at all). I can imagine if I was maybe 190 to 195 it would still fit comfortably, although tight.\n\nGreat jacket, has served me extremely well through 1 Spring and 2 Falls. It's everything you need and want from a simple windbreaker."
			}
		]
	}
]
