[
	{
		"id": "-Nt7Qm",
		"title": "Men's Pants Big and Tall Pocket Stretch Sweatpants Jogging Athletic Mens Sweatpants Fitness Joggers for Men",
		"imageUrl": "https://m.media-amazon.com/images/I/517YIwfDg0L._AC_UX385_.jpg",
		"price": "$4.14",
		"description": "100% Polyester\nImported\nDrawstring closure\nMachine Wash\nMen's Thong Underwear Sexy Low Rise T-Back Under Panties Men's Big and Tall No Ride Up Briefs with Comfort Flex Men's Thong Underwear Sexy Low Rise T-Back Under Panties Men's Thongs Underwear, Low Rise Stretch Sexy Mesh G-String Quick Dry Jockstrap Athletic Supporters Men's FreshIQ Tagless Cotton Brief Men Bulge Enhancing Underwear Cup Sponge Pad Swimwear Padded Men's Comfort Flex Fit Ultra Soft Stretch Boxer Brief Men Tummy Control Shorts High Waist Slimming Shapewear Underwear Briefs\nMen's Sweatpants Joggers with Zipper Pockets Drawstrings Tapered Athletic Pants for Running Workout Hiking Gym Men's Active Athletic Casual Jogger Sweatpants with Pockets Men's Casual Jogger Sweatpants Basic Fleece Marled Jogger Pant Elastic Waist Men's Cotton Yoga Sweatpants Lounge Pants Open Bottom Athletic Workout Running Loose Fit Sweat Pants with Pockets Mens Lightweight Gym Jogger Pants Men's Workout Sweatpants with Zip Pocket Men's Fleece Joggers Pants Athletic Loose-fit Sweatpants\nMens Shorts Casual Comfortable Workout Shorts Drawstring Zipper Pockets Elastic Waist Men's Regular-fit Lightweight Stretch 9\" Short Men's 6\" Inseam Drawstring Walk Short Men's 5.5\" Inseam Elastic-Waist Short Shorts 4-Way Stretch Men's Union Amphibian Hybrid 20 Inch Outseam Water Friendly Short Mens Shorts Casual Sports with Elastic Waist Zipper Pockets Men's Performance Stretch Woven 7\" Training Short Men's Slim-Fit 5\" Inseam Pull-on Comfort Stretch Canvas Short\nShow more",
		"reviews": []
	},
	{
		"id": "pp8_5g",
		"title": " Essentials Men's Classic-Fit Wrinkle-Resistant Flat-Front Chino Pant",
		"imageUrl": "https://m.media-amazon.com/images/I/71nZKwEfCJS._AC_UX342_.jpg",
		"price": "$12.45",
		"description": "60% Cotton, 40% Polyester\nImported\nZipper closure\nMachine Wash\nA flat-front dressy chino that offers classic style all week long; made to be wrinkle-resistant and easy-care with a traditional relaxed look and fit\nGenerous classic fit that sits at waist, roomy through seat and thigh, with a straight leg; zip fly with button closure, side pockets, and button pockets at the back\nIf you like Docker’s Classic D3 pants, we invite you to try the fit and style of our  Essentials Classic-Fit Wrinkle-Resistant Chino.\nShow more",
		"reviews": [
			{
				"name": "Cyrus Webb",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Comfortable slacks that fit you well and hold up during the day",
				"review": "These slacks literally came ready to wear.\n\nI didn't have to do anything to them but slip them on. They are comfortable and being wrinkle resistant they hold up over a busy day. I am up and down through the day when I am traveling for work, and these pants still look good at the end of the day. Love the way they feel and definitely like the way they look. There are several colors to choose from, and I have already order different ones to wear with various outfits.\n\nPerfect for life on the go. These slacks are what I need to stay looking and feeling good."
			},
			{
				"name": "Matt Jackson",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Great pair of casual dress pants",
				"review": "These are great, if not perfect, dress slacks. I purchased the blue pair and they fit comfortable, give just enough room to be comfy and not too tight, but damn do they ever collect hairs and random bits and pieces of fluff. I have worn them a handful of times and had to run a lint collector over them twice a day to ensure I do not look like a homeless guy who walked through a petting zoo. I would not call these Wrinkle-Free but certainly Wrinkle-Resistant, by the afternoon of sitting at a desk you will have wrinkles.\n\nI have now added the grey and khaki pants to my closet as well."
			},
			{
				"name": "Anonymous Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "2/5",
				"reviewTitle": " Remember you get what you pay for",
				"review": "I bought these on a whim when another pair of pants started wearing out. Mostly because they were cheap. And I learned (yet again) that you get what you pay for. These pants are perfectly fine but don't look particularly sharp and the material feels cheap. The pants feel awkwardly large especially if you are skinny guy. I would wear them on the weekends and maybe a Friday to work but they're really not that great.\n\nI own several  Basics products and have always appreciated the quality of Amazon Basics products but I think this one is a bit of a let down."
			},
			{
				"name": "J. Johnston",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great value in business casual pants",
				"review": "For $20, the  Essentials Men's Classic-Fit pants are a real bargain! I have been disappointed to note that Dockers is getting away from cotton chinos, instead using a stretchy fabric that I don't care for. The Amazon Essentials chinos are similar in style, weight, and color choices as the older Dockers chinos, not to mention at a much lower price!\nPros: Come out of the dryer with few wrinkles, fit seems true to size, and they are comfortable. Oh, did I mention the price?\nCons: Crease not as sharp as comparable Dockers (but hey - did I mention the price!)\nI will be buying more of these!"
			},
			{
				"name": "Cyrus Webb",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": "  Essentials have become my go-to when it comes to Wardrobe. Comfortable and affordable",
				"review": "I love the look and the feel of these pants. They allow you to switch it up when it comes to your wardrobe, wearing them for casual to business casual.\n\nThe fit in the waist and the length is just what I expected. They are comfortable and affordable, which means that you can get several colors to go with your wardrobe and not worry about breaking the bank."
			},
			{
				"name": "Kindle Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great Purchase",
				"review": "My husband LOVES these pants, and has asked that I buy no other than these and another pair from . This is the second pair I've bought for him. They look stylish, are great for professional, business-casual work attire, are comfortable and fit as expected. They wash well and seem durable. My only, tiny gripe - caveat: I'm a laundry Nazi - is that they're slightly wrinkled when I remove them from the dryer after 20 minutes on low heat. There aren't enough wrinkles for me to pull out the iron, and I think they probably release with wear. Great, great purchase!"
			},
			{
				"name": "fljim",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " I would caution everyone not to buy this product until better testing can be done on this product",
				"review": "Label says it is 60/40 cotton/poly. In no way is there any polyester in this pants. Within 5-10 minutes of wearing the merchandise, everything starts to balloon and lose it's shape. The two pants I received are defective and possibly are intentionally meant to deceive the public.\nI would caution everyone not to buy this product until better testing can be done on this product."
			},
			{
				"name": "Cynthia M",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Good for working where appearance doesn't matter",
				"review": "Soft, durable pants that have faded beyond all reason. We ordered black and now they're gray. I only wash in child with Tide. My son wore them to work as a server and after a month he was told he couldn't wear them anymore. If color doesn't matter, the material had held up. Good for working where appearance doesn't matter."
			},
			{
				"name": "Don Ofarrel",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " They fit as promised particularly at the calves.",
				"review": "I got fed up buying trousers online and having to return them to the 'big' stores - Sainsbury's, Tesco's, Matalan, even Marks and Spencers. They all had the same fault - they are what I call, drainpipe trousers. They are so narrow at the bottom you have to sit down to pull them off because they won't fall under their own weight. When you sit down, the trousers ride up and when you stand up, they don't fall back to break over the shoe again.\n\nThese  trousers are perfect for me. They are solidly made, good colours, fit well at the waist and the length, and behave as trousers should. I bought one pair to check and once I wore them, ordered another two pairs. Excellent price too. Highly recommended if you are fed up wearing 'teddy-boy' type trousers. If ithelps - 24cm at the bottom vs 20 or 21cm for other makes."
			},
			{
				"name": "Duncan Doenitz",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Good fit, reat value for money.",
				"review": "I have to start with the price...wildly cheap.\nI usually pay £40-50 for my chinos from a well known online apparel company and while these trouser are not quite as good quality they are good quality especially for £19.\nThings I like,\nThe waist fit. They fit on the waist, not above and not below it.\nThe material. The material, while not top quality is good quality.\nThe overall fit. The fit is almost exactly the same as my expensive chinos.\nApart from the slightly less robust quality of the material, the only real differences are that the company from which I normally order chinos tailor them to my exact leg length and offer waist sizes from 32inches, rising in 1 inch increments up to 44inches. Then, for up to £30 more per pair you'd expect a little something extra.\nThings I don't like.\nBelt loops. There are fewer belt loops on these chinos but only one fewer so I suppose I am picking nits, although, I do think it makes a difference.\nTrouser cuffs. I don't like the jeans type of cuff finish. My usual chinos have traditional plain trouser cuff hems and I prefer them. Call me picky.\nIf closely looked at, in the places people don't see, these trousers are not as well finished as my other chinos and the material doesn't seem quite as heavy duty.\nI bought these trousers to wear about the house and in the neighbourhood to save my other more expensive olive green chinos but really, I have worn and will wear them into town.\nAll in all, at £19 these trousers really are a steal, excellent value for money.\nI rarely give five stars to anything that isn't of remarkably high quality because I think to do otherwise devalues the star rating system, however I have given these trousers five stars in the value for money category."
			},
			{
				"name": "Hamdula",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " top",
				"review": "vallah super hose für baba style und die stackenden vibes\ngrüße an scooterpat der sie mir empholen hat :)"
			},
			{
				"name": "Mr. Richard Edwards",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " They fit and look good",
				"review": "I used to be taller and bigger [you do shrink with age] and could never get stuff off the peg but I now can thanks  a pair of gent's trousers in a plain classic cut at a sensible price which look far more expensive than they where I will be ordering some more of these"
			},
			{
				"name": "SKIP",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " 80's Style Chinos sold 2020",
				"review": "Ordered two pairs unfortunately they were nothing like the photographs. They were not wrinkle free as advertised and the colours were not the same as the pictures. They were wide fitting around the legs and buttocks something I used to wear in the 80s. I rarely need to return anything but this occasion I had to. I am 38 inch waist and they fitted ok around the waist and length. The trousers were like the 80s flares :)"
			}
		]
	},
	{
		"id": "yI_gPn",
		"title": " Essentials Men's Slim-Fit Casual Stretch Khaki Pant",
		"imageUrl": "https://m.media-amazon.com/images/I/71Fo0AlxOyL._AC_UX342_.jpg",
		"price": "$7.86",
		"description": "97% Cotton, 3% Elastane\nImported\nZipper closure\nMachine Wash\nFitted through hip and thigh, with tapered leg. Sits below the waist\nSoft, breathable cotton twill with a gentle stretch\nZip fly with button closure\nAn  brand",
		"reviews": [
			{
				"name": "Rstaana",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Not as expected.",
				"review": "This is the first time I bought a pair of pants online without trying it. I am a bit disappointed. I've put it on right away when I got it. It's more like a straight casual than a slim-fit. And the bottom is not tapered. Very wide on the legs and thighs."
			},
			{
				"name": "Joseph D.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Meets expectations",
				"review": "I get what some people are saying about them not really fitting \"slim\". I buy slim because regular cut pants are too baggy. These *are* somewhere in between, but nonetheless, I like the fit and I would buy again. 29x32 for me and they sized great. The people wanting slim fit are probably hunting for skinny-jean equivalent. Thankfully for us,  is helping combat the epidemic of men in skin-tight pants. Thank you Jeff Bezos!"
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Best. Pants. Ever.",
				"review": "These are the best pants ever. I'm 6'7\" and it's hard for me to find pants that fit me this nice. I'm going to get them in every color."
			},
			{
				"name": "Mitch",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Not ideal for smaller dudes",
				"review": "I'm short. Between 5'4\" and 5'5\", to be exact. In general, I need my pants - especially those which will be worn in a professional or formal setting - to be of the \"slim\" persuasion so I don't look like I'm wearing my older brother's hand-me-downs.\n\nAs you can see in my attached pictures, there's no discernable difference between this line's \"slim\" and \"straight\" fits; the waist is identical, the thigh/leg area is identical, and the bottom is identical. The \"slim\" fit is in no detectable way more \"slim\" than the \"straight\"."
			},
			{
				"name": "TheR",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " To much fabric in all the wrong places, who cut these?!",
				"review": "I wear i 30 or 31 waste with a belt in traditional and slim cut jeans alike; and have for years. I ordered the 31's and could fit a fist between my waste and the waste band; with a belt there was so much extra fabric in the back of the crotch area i could wear them to smuggle bags of sacrete out of home depot; and these are \"Slim cut\". My girlfriend couldn't help but laugh at the flap of material just between my legs that looks like a extra storage pouch. I've never bought such poorly cut jeans."
			},
			{
				"name": "Joseph W Hill",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " 28” inseam",
				"review": "Men are liars. When I ask men who are shorter than me where they get their clothes and ask about tailoring, they say “Oh, I buy from such and such a store and don’t need tailoring.” And they either are lying to conceal what we already know to be true that you can’t get a short inseam off the rack in most places, or are unaware that their spouses bought and tailored their clothing. Enter . Italians, Latin Americans, and many Asian retailers generally will carry shorter and smaller sizes for adults, but Americans are convinced that all men are 6 feet tall and either really skinny or really fat. I’m a short man with a dadbod and have finally found a 28” inseam in a “casual” pant I can wear to work."
			},
			{
				"name": "Shoe",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " You can save money from needing a tailor with these!",
				"review": "Being a short guy, it's not often you can find inseams that really fit you. Often I have to take it to the tailors. They also have every single size which is also rare. Normally you have to go up two sizes. The material is ok. I just got it and haven't washed it yet nor wore it around much. I was just stoked by how well they fit! I say the material is only ok because it's pretty much standard like you would find anywhere else. It's not crappy but it's not super fine either."
			},
			{
				"name": "Joey",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " True to size",
				"review": "Quality of material seems sturdy yet has a bit of give to squat down without feeling like its pulling on the seams. The fit is as expected: slightly fitted in the thighs and calves without feeling tight. The waist and length measurement seems true to size. 34 waist pants tend to run just slightly snug on me and these were no different. I could have gone up to 36 waist but Im still in denial about my weight gain ha. 32 length pants go past my ankles but arent long enough to flop off my heel and these were no different. Very happy with my purchase!"
			},
			{
				"name": "Estel",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Excellent chinos",
				"review": "These are so good, I have now bought 5 pairs.\nThe pockets are nice and deep, the fit is perfect and they are very comfortable.\nI initially bought them as an alternative to golf trousers, they are cheaper, made of cotton, so the fabric allows your skin to breathe and dries quickly, and smart enough to conform to the dress code. I was so impressed with the first pair that I wear these all the time now for all sorts of activities, and for general day to day wear.\nWell done  Essentials, a first class product."
			},
			{
				"name": "Alexander",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " I really wanted them to be good.",
				"review": "I'll quickly state the facts from my purchase. Great price of £14. Seem to be well made and nice material. I ordered black and the colour was fine. Fit at the waist was 32\" as expected and the length was perfect for me. SO can you imagine after all this how disappointed I am when the leg is no where near slim, just completely too wide. Like a pair of normal straight cut trousers.\n\nI have read the same issue in reviews of the skinny fit trousers. So please sort this out , because these could be really great for the price. Till then I will be returning mine."
			},
			{
				"name": "Brian G",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Will not be buying this brand name ever or any associated brand",
				"review": "These are my 3rd purchase from the  brand. My first point is regarding the inside leg measurement which states they are 32 inches. That is patently wrong. These are more like a 34 inch inside leg measurement. When I purchase a pair of trousers in a boutique, I tend to go for an inside leg measurement of 33 inches. That measurement takes into account of the footwear that I am wearing at the time. Next I move onto the quality. How can one pair be so different in quality and finish? These chinos are as bad as it can get.\nIn the description it states \"button and zipper \". That is true, but the button sewing should at least hold the button on. This is not the case here!"
			},
			{
				"name": "Steven Hanson",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Good fit and nice quality material",
				"review": "Needed some cheap smart-ish trousers for my driving job and these fit the bill. Quality of material seems very good and the fit is nice, not too baggy. Had to get the 31” leg as my usual 30” was out of stock. They are not too long however, so pleased with the fit and price was ok. I paid just over £16 for these but price is now £22. Will wait until it comes down again before purchasing another pair."
			},
			{
				"name": "Neil Tighe",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " They look really good",
				"review": "Soft material, nice quality, fit great, came very quickly, as good as the pic, I had a dark beige colour, good purchase. My wife hates them because I like to wear them all the time, comfortable."
			}
		]
	},
	{
		"id": "QvFnjT",
		"title": "Dockers Men's Classic Fit Signature Khaki Lux Cotton Stretch Pants - Pleated (Regular and Big & Tall)",
		"imageUrl": "https://m.media-amazon.com/images/I/51ICxlh5oYL._AC_UX385_.jpg",
		"price": "$19.23",
		"description": "98% Cotton, 2% Spandex\nImported\nButton closure\nMachine Wash\nWrinkle-Resistant Pleat-Front Pant with Permanent Crease featuring slant hand pockets and cuffed hem\nButton welt pocket at the back of these men's pleated khaki pants\nComfort fit waistband with up to 2\" additional expansion",
		"reviews": [
			{
				"name": "Big Daddy",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Why did Dockers shorten the pocket?",
				"review": "Let me start out by saying Dockers have been my “go to” slacks for work and play for 30+ years.\nThe good; they’re wash and wear, permanent crease and usually overall good quality.\nThe bad; These Dockers Lux Cotton Pants are lint magnets (have a lint roller handy when they come out of the dryer) and why did they shorten the pockets? I have several other pairs with nice deep pockets.\nMy guess is they are trying to save a couple of pennies by shortening the pockets. This could cost Levi/Dockers a lot of customers, me included.\nMy conclusion; 3 stars, no deduct for the lint issues (I have a lint roller), 2 star deduct for the short pockets.\nCome on Dockers, get with the program!!!"
			},
			{
				"name": "RonW",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Done with dockers",
				"review": "After 10 years of wearing dockers daily, I am finally done with them. This new stretch fabric does not even last 3 months. I ordered two separate times hoping I just got a bad batch the first time. But once again, after 3 months of wearing and washing weakly, they now have a fuzzy appearance. I used to think the color fading after a year or two sucked, but 3 months is not acceptable."
			},
			{
				"name": "Book Worm",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Material is scratchy and unfit for humans.",
				"review": "I have brought Dockers for years and switched to other brand due to their terrible cloth used. I tried them again because the other brand didn't have my size at this time.\nAnd, yes, the cloth used is that scratchy heavily chemically treated material.\nI would guess that Dockers got a great deal on the cheapest cloth available in a third world country because the third world rejected it and are pushing it on us. Their only hope is to use their once stellar name to sell sewage treated material.\nBTW: third world countries have better cloth then USA.\nIt would be awesome if USA  could find and buy directly from third world."
			},
			{
				"name": "Rodrigo",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Nice triple pleated khakis",
				"review": "I couldn't find these triple pleated khakis locally. The waist band expands nicely but doesn't elastic to do it. Triple pleats gives a little more room in the seat and thigh if you sit all day so you don't get all bunched up. Washed up we'll no need to iron if you hang them right from drying. Crease is permanent. Nice khakis."
			},
			{
				"name": "Mike Tarrani",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Nicely made",
				"review": "I purchased these because I wanted some decent slacks without spending a lot of money ... and because the brand is reputable. They fit a little tighter than I expected because the product description claimed that they would stretch up to two inches. There is little to no flex in a more traditional sense; I am accustomed to elastic band flex in jeans and trousers, and these do not work the same way. The material and the construction are such that the waist and seat will stretch, but not in the same manner as elastic. No problem for me since I did a little research after they arrived, and since they do not expand like elastic it is an indicator when I put on a pound or two and need to watch my eating and exercise regimes.\n\nOverall, these are quality pants. So much so that I have ordered two more pairs."
			},
			{
				"name": "baxkr",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Smart and comfortable",
				"review": "I love these pants. They are very smart and extremely comfortable. They do crease quite a bit but that's to be expected from the material. I wear them all the time and they are pretty robust too."
			},
			{
				"name": "genie",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " The black attract so much lint.",
				"review": "Bought 2 colors..,black and steel head. The black attracts so much lint than the steel head. Both have good quality fabric as always expected with dockers pants but the amount of lint on the black is so shocking that i washed the black pants twice and came out the same amount of lint. I used a lint roller to take it off and seems okay. It is just so annoying if every ironing.. I have to use a lint roller for the whole pants! A waste of time. I hope after several more washing it will not be as bad. Size and length seems to fit well for my 6 foot husband. Goodluck everyone."
			},
			{
				"name": "Kindle Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Just right pants",
				"review": "I like that they are as described, they fit as expected, and arrived on schedule.\nI am happy with the fact they are 98% cotton.\nThey are just what I ordered!"
			},
			{
				"name": "James Kirkby",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Excellent fit, very nice trouses, great quality.",
				"review": "Excellent fit, very nice trouses, great quality."
			},
			{
				"name": "AHayes",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Happy with this purchase",
				"review": "The pants came quickly. They are as advertised; they're handsome and seem well made. Of course I won't be able to tell whether they will be durable before I've had them a while. I was worried about ordering trousers on-line since trouser size numbers can vary, but  seemed to know that if a size 32 Levis fit me, so would a size 32 Dockers, and that turned out to be the case."
			},
			{
				"name": "K.A.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Good pants",
				"review": "This is my third pair. I bought two like it at a local store here a long time ago now, so I pretty much knew what I was getting and how it would fit. Everything is as expected. The previous two pairs lasted quite a while, so this new pair is slightly \"updated\": a few extra bells and whistles, but nothing that changes the fit. I am pleased. Will probably buy again. I don't think the  price here is significantly better than the local store one."
			},
			{
				"name": "G.D. Kilvington",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " very good fit",
				"review": "These pants were exactly what I expected. Fit is good and they seem to be very well made. It's nive to be able to buy pants already hemmed to length, rather than pay $50 for a pair then having to pay another $20 to get them taken up."
			},
			{
				"name": "Colten Gorda",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Poor Quality",
				"review": "I've had this pair of pants for a month, and already the seem is ripping out. I just pulled these out of the gentle wash cycle, and the seem is already giving out. Very displeased with the quality of the material. I've always been a Dockers fan, but this is really disappointing. Of course, it happed 3 days after my return window closed."
			}
		]
	},
	{
		"id": "Zjj7SZ",
		"title": "IZOD Men's American Chino Flat Front Slim Fit Pant",
		"imageUrl": "https://m.media-amazon.com/images/I/71XSEKp78AL._AC_UX342_.jpg",
		"price": "$19.34",
		"description": "100% Cotton\nImported\nButton closure\nMachine Wash\nSlim fit chino sits lower on the waist with a slim fit through the thigh and tapered leg for a contemporary and tailored look\nWrinkle-free and machine washable to wear straight from the dryer\nNon-iron fabrication makes this your most reached for dress pant\nShow more",
		"reviews": [
			{
				"name": "Sirius",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Quality material for a great price. My favourite pants.",
				"review": "I usually buy the IZOD Men's Madison Slim Fit Pant (which are great) but found I needed slightly longer length of 31 waist x 34 length. As when I cross my legs sitting down I show too much of my ankles which sometimes causes business meetings to get a little off-topic. This Flat Front Slim version allows a 31x34, fits just as well on my waist but allows more length and just a slight more room in the leg. They are now my favourite pants for office work and go great with a business shirt or even a polo for the casual days.\n\nMy waist is exactly 83cm (32.5 inches) and 88cm (34.5 inches) length from bottom of ankle to waist belt area.\n\nAs I have used IZOD pants for a few years now, these are the positives and negatives:\n\nPositives:\n* Material is of a good thickness. Not too thin, not too heavy.\n* I have found I don't need to iron these.\n* Deep pockets\n* Comfortable, soft material\n* Only slim pants that I have found that look great on me. I don't look skinny in these.\n\nNegatives:\n* The material seriously attracts fluff. This seems to go away after a few washes. But before this time you will need the sticky roller every time you use them.\n* The material will start to fray at the bottom of leg where it rubs on my shoe after about 3-5 months (weekly washing). If not here, something else will start fraying like the belt holders. If this is a concern I recommend only washing these when it is necessary (and not simply every time you use them) to make the pants last longer.\n\nYear Later Update: still going strong on these pants and they are yet to fray.\n\nSince my original review,  US don't ship to us poor Aussies any longer and our local site doesn't stock these. I really hope Amazon AU get it in soon before I need another pair.\n\nOut of sheer madness I walked into a local retailer, which was an experience in itself. Bought a pair of similar looking pants, best price I could find but still more expensive than my Amazon US order (go figure). They ended up being terrible quality and just didn't look good on me. No return allowed for change of mind. So now I use them for car oil change rags.\n\nSo cheers to you lucky people who can access the awesome inventory of Amazon US and have a thought for us poor bastards down here who are, at the moment, being placed on strict rations.\n\nUPDATE Oct 2019:\nUnfortunately the cut has suddenly changed to a skinny style. The top waist is still the same cut but the lower half has changed where it now hugs your calf muscles and tapers in tight around your ankles. Shame, was a great fitting pair of trousers."
			},
			{
				"name": "najigil",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great fit, very comfortable.",
				"review": "IZOD Men's American Chino Flat Front Slim Fit Pant, Khaki, 29W x 30L\n\nThis is a very comfortable pair of khakis that I wear for both work and going out. I'm about 175 cm and 66 kg, and this sizing fits great. I've had this pair for several months and it washes well in the washing machine without noticeable lost in it's shape. I've never had the need to iron the pants as long as I hang it immediately after washing. However, without ironing, the crease line does become less prominent with time, as would be expected. Some stitiching have come loose at the pockets in this pair, but this is not a problem for me. Overall, this pair of pants has held up well. The photos included were taken recently. I've bought a second pair and no stitching has come loose. I'm looking at buying a 3rd pair."
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Good Mass Produced Pants",
				"review": "I ordered five of these at once to cycle out older pants. They are 100% cotton, which is a hard feature to find now that elastane has taken over the world. The material is a good weight, not too heavy or too light. They are nice-looking office chinos that actually feel on the slightly loose side of slim (which is good).\n\nThere are a few considerations. There are loose threads everywhere, which is common in mass produced pants. One thing that wasn't obvious from the product description is that the crease is not permanent, so if you want a crease you'll have to iron it in. Here's the really weird part: two of the five pairs had an extreme taper and the other three had a straight leg. All the tags are exactly the same, the lengths and waists are pretty consistent, and they are all made in the same country. That deducted a star from this rating. Otherwise they would be solid four-star pants."
			},
			{
				"name": "Sam Larson",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Five Stars",
				"review": "Fits perfectly, slim cut and look."
			},
			{
				"name": "Crystal C.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Purchasing more of these! Great quality nice fit.",
				"review": "These pants looked so great! I ordered these for my step 16 yo step son to usher in a wedding. He is the tall dirty blond behind the baby (only picture the photographer got him in 🙄) They washed well and really do resist wrinkles. He felt very sharp and stylish in them and wants to save them for an upcoming school formal. Good quality. I'm ordering a longer length to have on standby for his next growth spurt. He normally wears a 27x30 from aeropostale and I ordered the 28 x 30. They were a true 28×30. They still stayed up and looked nice without a belt."
			},
			{
				"name": "Ben Ruppel",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great fit",
				"review": "This is an excellent pair of pants as of day one. The fit is good. They are somewhat baggy but actually pretty much perfect to my taste when sitting down, standing up etc. I'm glad I got the 30 length because they are adequately long and if they were longer they'd be too long. I am 5'11'' 243 pounds and the 40x30 fit perfectly for reference, although the waste is a bit unforgiving, so I will be paying particular attention to the drying process also to keep the pants in a fitting size. Although at first I was skeptical of the fit based on first impressions, thinking they were baggy around the legs, I was mistaken; they fit well. Overall I'd recommend them."
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "2/5",
				"reviewTitle": " Great While They Last...But They Won't Last Long.",
				"review": "Originally I bought these for my husband at Kohls. He LOVES them and they look great on him. He is about 6ft tall and a thin build and these look great on him - very professional and perfect for work! He loved them, I loved them. We were all happy. Then about 3-4 months into wearing them pretty consistently (about once a week) they started getting huge rips and holes in them around pockets, zipper and crotch. Still he loved them so much he insisted on wearing them. Finally when the back pocket was just about ripped off, I tossed them and ordered these. They were exactly the same ones we had purchased at Kohls. Sadly, they only lasted about 3-4 months and the same thing started happening. So I would say be VERY careful with this purchase!!! These aren't made to last more than a season or two."
			},
			{
				"name": "rafa",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " gran calidad y color",
				"review": "un muy buen ajuste, comprare mas de estos, siempre he usado el regular fit, pero me gusto como me amoldo este modelo, aunque no estoy acostumbrado a pantalon ajustado, pero la verdad me sienta mejor, comprare mas colores de este modelo, si es que los hay y tengan un precio adecuado"
			},
			{
				"name": "Eric",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Wow super belle coupe et un vrai \"Slim-Fit\" mais....",
				"review": "Super belle qualité et vraiment très confortable.\nLa coupe est parfaite et c'est un vrai \"Slim-fit\".\nC'est vrai pour le marine et le beige parcontre je viens de commander un noir et malgré que les étiquettes sur le pentalon soit les mêmes que tous les autre la coute est totalement différente. Pour le noir j'ai recu une coupe droite. Je sais pas si tous les noirs sont pareil ou seulement un erreur d'étiquettage à l'usine de fabrication mais l'ai retourné et j'hésite à en commander un autre."
			},
			{
				"name": "najigil",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " The fit has changed: Skinny fit rather than slim",
				"review": "The fit and cut of this Izod pants have changed since the last time bought them. The recent couple of pairs I bought are skinny fit, not slim (thus not as advertised). Very disappointed. They still fit well in the seat area, so I'll be altering them to be knee-length shorts."
			},
			{
				"name": "Rocio Mares",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Exelente",
				"review": "Es como en el de la foto, cuando te agachas Sprite un poco del trasero y las piernas, pero nada de que preocuparse, la verdad lo recomiendo."
			},
			{
				"name": "Karen",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Sized differently",
				"review": "These pants were different material & sizing than the ones I purchased last summer for my husband. Can I still return them even though I purchased them prior to Christmas?"
			}
		]
	},
	{
		"id": "89akC5",
		"title": "Haggar Men's Cool 18 Stria Hidden Expandable Waistband Plain Front Pant",
		"imageUrl": "https://m.media-amazon.com/images/I/71z+9OWRhvL._AC_UX342_.jpg",
		"price": "$29.35",
		"description": "100% Polyester\nMade in the USA or Imported\nButton closure\nMachine Wash\nCOOL 18: This collection combines classic Haggar styling with a revolutionary technology to enhance fabrics on a molecular level. The result? Fabric that resists wrinkles, wicks away moisture, and resists static without sacrificing comfort.\nSTYLE: These are the perfect flat front dress pants for going to work or a formal family event. They are a classic fit, meaning they are relaxed throughout the hip and thigh. They sit at or below the waist and have a straight leg opening.\nCOMFORT: Without a doubt, these dress pants will not hinder your comfort throughout the day. They feature a hidden expandable waistband that stretches up to 3 inches, so your pants will stay secure.\nShow more",
		"reviews": [
			{
				"name": "Damien",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " The best slacks I have ever bought!",
				"review": "I have fallen in love with the Haggar Cool Pro 18 series. They look nice, feel nice and are wrinkle resistant. They also have a nice expanding waist line that makes them extremely comfortable to put on and wear while still fitting securely. My favorite feature of these pants is the band that helps keep shirts tucked in. Being a larger guy I often have trouble with my shirt coming untucked, especially when reaching up, but with these pants I have no problem keeping my shirt tucked in as the pants hold them shirt in with the slight adhesive nature of the band.\n\nThese may cost more than my normal slacks, but they are well worth it. I now own 6 pairs of these slacks (black, brown, grey, navy, turquoise, and khaki), and I love them all. My original black ones have held up nicely over time, as I am sure the rest will because they are high quality slacks."
			},
			{
				"name": "C. Peters",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Roomy, adjustable waist, wash well.. what’s not to love?!",
				"review": "Bought these pants for my son who works at a country club as a waiter. He has to have nice black pants that have to be comfortable to work long shifts as well as setting up for events.\nThese pants are lightweight, wash great, stay nice looking enough right out of the dryer to not have to iron them. My son Loves the expandable waistband! It’s hidden so know one but him is aware of it. They are lightweight and breathable and since he sweats at work, they are great! I will certainly purchase these again when he needs more pants."
			},
			{
				"name": "Andrew",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " I LOVE THESE PANTS (updated)",
				"review": "I LOVE THESE PANTS. Extremely comfortable but they look so professional and I don't have to iron them. Really, great all across the board. I feel like they have a slight 1-up to other \"golf pants\" in terms of looking slightly more professional. The only issue for me is the length was a bit too long, I would recommend going a size smaller on the length maybe. I guarantee you will love these pants though, unless you're morbidly obese in which case I'm not sure about the fit. I'm 6ft/180lbs and they fit well, with a little bit of room. Also, the whole waist and crotch area seems to stretch if you want it to, it holds its position well but stretches some which is pretty awesome. So much better than the regular cotton crotch destroyer dress pants.\n\n- update, after owning these for a few months, these are hands down my favorite and best pants purchase ever. These are the most comfortable pants I own yet they look extremely classy. Have not had to iron them once. I am slim but I do have leg muscle and these fit perfectly, unlike other pants which are tight and hug the crotch or too baggy. I love how the waist crotch area stretches so they dont ride you when your sitting at a computer for 12 hours. I can squat and move around comfortably. Like I said, they length is a bit long but thats it. I wear a size 33 or 34 in jeans but went with a 35 waist in these so I have a little more room. Glad I did. They are holding up well. One or two very minor signs of wear but I wear them 3 times a week."
			},
			{
				"name": "Mo",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Buy it. Wont regret it.",
				"review": "Aight ima start off by saying that I've ordered a pair of pants size 34x 31 as this is the size of my other pants. But I had no clue about a dress pant. So I returned it and got a refund the same day and on that day I ordered another pair .they can in the very next day. this time size 34x 29 and it just fits perfect. Cant be more perfect than that. So from my opinion the lower size is what you need to go for.These dress pants are also comfortable. Other ones that I used to wear were very tight. And No, I am not fat. But I do have muscular legs and these pants are great. Shout out to this company for fast refund and sale services. You guys are amazing.\nBUY THESE PANTS!!!!!!"
			},
			{
				"name": "Family",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Excellent, not too tight, extendable elastic belt",
				"review": "March 2020 - These are excellent pants! I bought these for my two teenage sons who need them for school uniforms. Neither wears tight fitted clothing. These have hidden expandable waistbands that extend when worn, and my sons feel comfortable in them. No pinching or pulling. We have owned them for about a month. I have washed these many times, even in warm water, and dried them even on high (which i'm sure isn't recommended), and they have come out great from the dryer! The initial crease may not be as crisp, but i'm sure that has to do with my casual laundry style! I am very happy with this product. Will gladly reorder when the need arises, provided they continue to hold up the way they have so far.\n\nUpdate June 2021: My sons have had these parents for over a year. They have held up beautifully. I bought more when one son outgrew the length, but the other has had the same pairs throughout. Overall, they are an excellent buy and wear well. Additional information - the fit is not clingy, but flexible and more of a classic fit.\n\nUpdate April 2022: These pants are STILL going strong. Have not needed to replace them."
			},
			{
				"name": "Charles O. Todd III",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Classy, comfortable, easy",
				"review": "I'm 74, retired, and the dress slacks I used to wear to the office were killing me because of my new \"Bay Window\" waistline. I wanted to replace ALL of them and get the colors I like most - Black, Navy, Khaki, Grey, Brown. These are REALLY comfortable, and well-made. The \"hidden expandable waistband\" ensures they sit and fit as good dress trousers should. One small inconvenience I encountered was the very large closure-button above the zipper. It's 1.5cm across, sewn down tightly, and the fabric around the button hole is pretty stiff. If you have an *urgent need* to \"drop trou,\" the extra few seconds it takes to work the button could be problematic -- HOWEVER, the expandable waistband should pretty much slide past any guy's hips, so there's that. They launder nicely (but do follow the care directions) and look sharp afterwards. I am quite pleased with my purchase. If the need for another pair or two should arise, I'd choose this brand and style. I'd put up a photo, but it might damage your computer or iPad."
			},
			{
				"name": "Hazel Dobbs",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Super fit trousers.",
				"review": "The trousers are well made and very good value.\nBought the same brand when in the US.\n\nExcellent delivery time"
			},
			{
				"name": "John H.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " and was very pleased with the quality and fit",
				"review": "I recently bought a pair of shorts in the same material, and was very pleased with the quality and fit. The same goes for these pants, just right for strolling the deck on my next cruise."
			},
			{
				"name": "denno",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Style and comfort",
				"review": "Excellent cut waist inside leg fitted perfectly, material and stitching bloody good quality and they are cool in a hot climate, whether casual wear or formal suits any occasion."
			},
			{
				"name": "JW58",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Ideal for Indoor Bowls",
				"review": "Bought to replace other, excellent Haggar pants that I wear for indoor bowls. Just the right fit for that and, like most American men's pants, so easy to launder."
			},
			{
				"name": "michaeljcoyle",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Exellent buy",
				"review": "To match jacket"
			}
		]
	},
	{
		"id": "SzAPK6",
		"title": "Dockers Men's Straight Fit Signature Lux Cotton Stretch Khaki Pant",
		"imageUrl": "https://m.media-amazon.com/images/I/71htYLGmQ-L._AC_UX342_.jpg",
		"price": "$19.23",
		"description": "98% Cotton, 2% Elastane\nImported\nButton closure\nMachine Wash\nLux Cotton Stretch\nWrinkle-free technology, super durable buttons, permanent crease, shirt gripper\nFlexible Waistband, for extra comfort when you're on the move.",
		"reviews": [
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "2/5",
				"reviewTitle": " Why did Dockers ruin the Signature khaki material?",
				"review": "Until 2019, Signature khakis were 100% cotton - they felt great, looked great, resisted wrinkles, and breathed despite having decent weight (a benefit of cotton). Changing the material to 98% cotton/2% plastic was a terrible decision, maybe they're saving some small amount on the cost but the quality has decreased substantially. The feel is not a nice as 100% cotton, they wrinkle more, they are thinner, and because they contain plastic don't breathe as well.\n\nHere is a message for Dockers -- whoever made the decision to reduce the quality of the material should be looking for another job."
			},
			{
				"name": "Obi Wan",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Definitely not Dockers D2 pants",
				"review": "These are not the Signature Fit D2 Dockers pants as advertised.\n\nI have been buying and wearing Dockers Signature Fit D2 style pants for ten years. These are not them. Dockers has apparently discontinued the D2 line and replaced them with whatever this listing is shipping and they are VERY different\n\nThese are made from a different material. The label says its 98% cotton, but it doesn't feel like cotton. These feel like polyester.\n\nThey are cut extremely small. I've worn size 38 waist for years. They fit a little loose because I'm actually a 37 inch waist. I bought on  because they were a better deal. But these new style Dockers khakis are cut WAY small\n\nIf you are looking for D2's you will not get them from this listing. They have been replaced by Dockers by something very different. Thia listing title is old and wrong."
			},
			{
				"name": "Sunshine",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Female's view on great pants",
				"review": "First off, a confession: I am a female, with large thighs and calfs and Dockers are marked for men so you my take my review with a grain of salt.\n\nGot these straight cut pants a little long but that's is an easy fix as it was the colour I was after.\nThese are the best pants I've ever owned. I got pockets that actually fit my mini wallet and phone and still look good on me.\nThe best part is that when wearing these pants I do not feel as though I am being violated. They do not cling to the thighs, or the legs, which is what I like. They make my butt look good so I still look like a woman.\nAgain there are the Dockers straight cut, I've tried the skinny cut and sent them back. I can't see how anyone can wear something that tight!\n\nDockers, if you see this, not all women want pants that fit like a second skin. And you would be shocked at the number of women that want back pockets that fit a phone!"
			},
			{
				"name": "Bill",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Almost perfect",
				"review": "I'm picky about how my clothes fit. These fit almost perfectly. I like a pant leg that is somewhere between a Straight and a Slim. I bought both these and the Slim version. I like both, but I think I prefer the Slim.\n\nThe thigh and waist on the Straight are very comfortable. I prefer the taper below the knees on the Slim, however. The material feels good, comfortable and of quality. I had no qualms wearing these all day for travel or business.\n\nThe khaki is just a bit hard to match; that's my only real complaint. Some khakis are easier to match than others.\n\nIf you're on the fence about the fit, my recommendation is: if you like a loose fit, get Straight, but if you want a more modern, slim fit, definitely get Slim. I'm happy with both (I have both and wear both); it just depends on what I'm dressing for.\n\nFor reference: I am 5'11\", weigh a little over 200lbs, and typically like a 34 or 36 waist depending on the brand and fit and stretch. I usually buy 32\" length, but honestly prefer the non-existent 31\", meaning these are the right length, but a titch on the long side for my preference."
			},
			{
				"name": "C. A. Lugo, Jr.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Won’t ever order Dockers from  again.",
				"review": "I’m not sure if these were knock offs or factory rejects. But they were way to tight in the crotch. I ordered these based on the style numbers that I get when I get them at JC Penny’s. All the information on the tags matched what I ordered, but they were way to tight. Even the designs and patterns of the materials inside the waistband looks different than any of my other Dockers. This is what makes me think they were knock offs."
			},
			{
				"name": "G. Wilson",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Always reliable casual dress",
				"review": "What can I say?...they're Dockers...the penultimate business casual work pant. They fit well, are comfortable, durable, easy to clean, look professional. You can wear them to work or to a party. My favorite thing about Dockers is if you have a hybrid job like mine; I have to wear office clothing, but often enter work areas like machine shops or have to crawl on the floor. I wouldn't dare wear nice slacks, but Dockers can put up with that abuse."
			},
			{
				"name": "Ed",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " excellent trousers",
				"review": "These pants are an excellent value of good quality. The straight fit is just right for tall somewhat thin men. I am particularly pleased with the wrinkle resistance of the fabric. Unfortunately, it seems that  is out of my size and doesn't know when they will be available again."
			},
			{
				"name": "Roger J.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Nice Pants with Little Waist Flex",
				"review": "These pants look great but the waist has no flex that would have made these pants perfect. They are a bit snug at the waist but since I am planning on losing a few pounds, they should be fine soon. These wash and dry very well."
			},
			{
				"name": "Michael John Shemilt",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Good Quality trousers",
				"review": "Dislike nothing. Good quality, good fit."
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " You can return them if you are not satisfied",
				"review": "The quality was very good, the size described was misleading, straight fit was very wide fitting, and these trousers are not cheap."
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " The description said that these are 100% cotton but they ...",
				"review": "The description said that these are 100% cotton but they are not.There are 56% cotton only the rest is polyester which is disappointing."
			},
			{
				"name": "Daniel Yanes Arroyo",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Ligeros, cómodos, elegantes sin ser formales. Buena manufactura y con la medida esperada",
				"review": "Excelente, como todos los Dockers. Tela suave y resistente. El color marrón es muy bonito, levemente diferente al de la foto (es un tono un poco menos chocolate y un poco más gris/marrón). Compré dos pares de pantalones del mismo modelo y talla (30x32), pero en colores diferentes: marrón y negro. La etiqueta de los que son color Marrón dice que fueron hechos en Nicaragua y me quedan perfecto. Los otros son color Negro y dice que fueron hechos en Bangladesh. Los que son color negro me quedaron un poco chicos y tuve que solicitar devolución. Estoy acostumbrado a estas pequeñas variaciones en las prendas de vestir y el hecho de contar con devolución gratuita es vital para comprar en línea."
			},
			{
				"name": "TS",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Pantalón de verano",
				"review": "Es importante mencionar que mi compra fue en color Cloud, el cuál en la imagen de venta se veía más claro (realmente me arriesgue al comprarlo) pero al llegar el producto (para mi buena suerte) el color esta muy bien. Ahora bien, la calidad del pantalón es acorde a los productos Dockers (sin defectos y con buen corte).\n\nQuede muy conforme con mi compra y con mi nuevo pantalón para uso en verano (por el color)."
			}
		]
	}
]
