[{"id":"OGG9ut","title":" Essentials Men's Classic-Fit Expandable-Waist Flat-Front Dress Pant","imageUrl":"https://m.media-amazon.com/images/I/71H0GSW3-OL._AC_UX342_.jpg","price":"$20.21","description":"100% Polyester\nImported\nButton closure\nMachine Wash\nRoomy through hip & thigh with straight leg. Sits at the waist\nSilky smooth and movable twill polyester fabric\nTwo button-through welt pockets at rear\nAn  brand","reviews":[{"name":"Julie F.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Surprise!","review":"So I opened up the package and pulled out the pants. They felt a little heavy and I looked in the pockets. Found a car key. Does that mean I won something?"},{"name":"F. McClamrock","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" pleasant surprise","review":"Pants work well as replacement for suit pants that were worn and match coat. Really surprised at the quality and material for this price, makes the suit a favorite again. Like some other reviewers said, if you are in between sizes order the smaller because they stretch up to 2 inches. I am a 37 so I ordered the 36 and they fit perfectly with the stretch in the waist band, actually better than the original suit pant because of the stretch band built into the waist."},{"name":"Autumn Harbor","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Worth every star...","review":"I won't say that I'll *never* buy another brand of dress pants again, but if I only bought  Essentials brand dress pants again, I'd be content with that decision. I currently own two pairs; the fabric falls nicely across the seat and leg and they appear to have pretty serviceable wrinkle resistance. I have a hard time finding pants that fit me off the shelf and I am very pleased with the fit, quality and overall comfort. I challenge you to find a comparable product for the price. 5 stars and I mean it."},{"name":"Seth","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great Deal!","review":"I'll keep this simple - the pants look professional, fit as I had hoped for my size (34X29), and are comfortable. The only thing I can't report on at this time is the strength of material or how long the pants will last as I've only had them for a couple of weeks. But IF they have some staying power, I will be purchasing the remaining colors. So far, so VERY good."},{"name":"DonL","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Light weight","review":"A great buy. Can't go wrong for $25. A little baggy in the butt. I'd suggest buying a size smaller un utilizing the expandable waist. This might alleviate the baggy butt or you could have them tailored."},{"name":"CP","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect Fit","review":"Ordered these for my son in 33x32, perfect fit for his lean frame. Once my son tried this pair on and the fit was right, I immediately ordered him a second pair in the color dark grey. At first I was hesitant to order a pair of slacks with the  label but my husband told me to give it a try...smart man. Why pay more when you can get a nice pair of slacks at an affordable price that fit well and look good."},{"name":"B. Stenberg","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Fit my slim son well","review":"This pant was a great price and I was pleased with the value for the money spent . I ordered long and ended up having to hem them and I was ok with that. The waist band has a stretch bit in it that is brilliant. Helped with the fit!\nThey are not a heavy weave. Make sure you use a pressing cloth or you will get shinny spots on the fabric"},{"name":"Lizzy","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" These fit my husband!","review":"These are as good as more expensive brands and my husband likes them."},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" I'm annoyed these look like they've been worn, badly ironed and returned.","review":"Nice colour, but arrived crumpled with the pictured double crease ironed down one leg. Not what I expect on a brand new pair of trousers. I'm wondering if these were returns already worn."},{"name":"Rob Danks","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Ideal for those of an in-between size..","review":"Was holding my breath when about to slip these trousers on as needed something quick for a funeral...but to my surprise they were perfect.\nI'd ordered a 38\" waist although during lockdown I'd put a bit of 'timber' on..but these were if anything a little generous (being stretch I think I was more towards a 39\" waist to be honest).\nLength was true to form also..order with confidence if like me you've grown to be an in-between size recently."},{"name":"Bluecashmere.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Good value if you don't mind the shine.","review":"These trousers are well-made and fit as advertised. I am disappointed though that they have a somewhat high gloss appearance. I had hoped for a matt finish. It is difficult to tell from the desriptions and the photos how the surface of the material will look."},{"name":"PJ","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Well Made","review":"I was surprised how good these trousers are. Noticing this product could be purchased either in polyester or recycled polyester. The polyester version was unavailable and so I opted for its alternative.\nWashes and presses well. The \"Skinny\" description did not seem to be what I thought. Well manufactured and having an expandable waist added to its quality. I've purchased another pair. You would never had guessed I was walking around with a pair of trousers that was once PET bottles and helping save 79% carbon footprint. Get a pair!"},{"name":"JC","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great product; I will happily buy again.","review":"I’m an ‘inbetweener’; somewhere between a 34 and 36 inch waist. 34 is usually a bit tight and 36 too big. I also fall between two stools with leg length. Most manufacturers have 29, 31 and 33 inch inside leg. I fall between 31 (too short) and 33 (too long).\n\nWell, no need to worry when buying these trousers. With the slightly expanding waistband, the 34 waist fit perfectly. They are really comfortable. They do a better range of leg lengths too, so I was able to order 32 inch inside leg. The length is also perfect.\n\nI am really happy with my purchase and have already ordered a second pair as a spare."}]},{"id":"7CF20X","title":" Essentials Men's Athletic-Fit Casual Stretch Chino Pant","imageUrl":"https://m.media-amazon.com/images/I/71+s+4-TfrL._AC_UX342_.jpg","price":"$8.30","description":"97% Cotton, 3% Spandex\nImported\nZipper closure\nMachine Wash\nA flat-front dressy chino that offers classic style all week long. Made to be wrinkle-resistant and easy-care with a traditional relaxed, broken-in look and fit\nGenerous classic fit that sits at waist. Roomy through seat and thigh with a straight leg. Zip fly with button closure, side pockets, and button pockets at the back\nWork made better: we listen to customer feedback and fine-tune every detail to ensure quality, fit, and comfort","reviews":[{"name":"James E Jackson","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great fit if you're muscular/a little chubby","review":"Im 5'9 195lbs, and i ordered the 36/30. it's difficult for me to find pants that fit right, I usually have to size up to 38 pants just so the thighs/seat fit me. I instantly loved these pants when I tried them on, they are soft and have a good fit without being too baggy in the front. I'm not sure about the durability since i just received them, but I took a gamble and ordered these. If you are athletic, or a little chubby with big thighs/butt these are the pants for you. 10/10 love them"},{"name":"W Stanley","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" If you really have quads,these are your pants!","review":"I’m amazed at how well these pants fit. I’m 5’9” 230lbs BF% in the low double digits. 35x30 fit perfect. If you really squat and have the quads and glutes to show for it. These are your pants. The fit better than the Levi/Dockers flat front athletic cut pants. I don’t have to get 36 or 38 waist and have a sloppy waist line with a fitted shirt or spend $20 to have the waist taken in to look neat."},{"name":"Brennan A.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Good for the money, comfortable, but PLEASE add dark khaki","review":"UPDATE -  finally added dark khaki (they call it beige caramel, which is exactly the same color as dark khaki from their other cuts) to this cut. I ordered those, and they're lovely. Now five stars.\n\nOverall, very nice. The material isn't super-thick and is flexible and soft. They run a little large, so I'd order half a size (a full size?) down, i.e., if you're 34 waist, order a 33.\n\nI'm a hiker and biker, so my legs are a bit too thick for slim fit, so it's hard to find pants that have a good fit in the waist while not being tight in the legs and crotch (or that fit nicely in the legs and crotch but are in the waist). I tend to get clothes in slim fit in a size up and then shrink them, and these pants hit just about the best balance I've been able to find so far between waist room and leg room.\n\nI bought six pair of 35-waist athletic fit pants to replace some 36-waist pants that were way too big, and found the 35-waist pants were only marginally smaller - if not smaller than - the old 36s. I exchanged them for some 34s, and find that they fit much better. They are still a little loose, but I'm happy with how comfortable they are. I'm hoping they will shrink some after a few more trips through the dryer.\n\nMy only complaint is the color. I HATE the standard khaki color (in general, not just on these pants).\n\nPLEASE, PLEASE, PLEASE add a dark khaki color option like you have with the relaxed, regular, and slim fit cuts of these pants."},{"name":"Lucas D Boythe","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Athletic Guy Rejoice!","review":"I have never written an  review, but this changed everything. As a big guy (6'7\" 260lb.) who played sports through college, I have always had a difficult time finding comfortable, sylish, durable clothes. After researching pants for my job as a teacher, for the entire summer, I decided to take a risk on these. I say risk, because can a $20 pair really deliver? So far they have.\n\nPros - Lightweight, Nice cut (generous where it needs to be, and straight/tapered where they need to be), Nice flex to them; waistband fits on the larger side, without being sloppy\n\nCons - \"Wrinkle Resistant\" is not wrinkle free, which is fine, but just needed to adjust my expectations; Seeing a little wear after one time through wash on one pair; the degree to which a pant is tapered/straight seems to slightly vary by pair, despite being the same size, etc.. Mind you, none of this would determe from buying again.\n\nThe bottom line: Amazon, please keep making these. I bought 4 pair initially, and upon receipt/wear, immediately bought 2 more."},{"name":"jeff o","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" great pants","review":"fit great right size just what I order"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Good Price, Decent Quality, Great Size Options","review":"Just thought I'd give these a try due to the price. The pants seem very good for the price, roomy as advertised and the range of inseam lengths is excellent. The only issue I have with them is that the waist seems to be significantly over-sized. I buy the same size waist for Dockers and LL Bean pants, but the waist on these was definitely 2\" larger than advertised. Still, all in all I can't complain given the price and the otherwise great fit."},{"name":"Ben","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" You get what you pay for, runs a little long","review":"The pants are an inch or two longer than expected so you may want to order a shorter pair than you usually would. I'm a 32x30 and typically order from J Crew for khakis, and wear Levi's jeans. Waist fit as expected. My other complaint is that one pair has the dye washing off after a single wash (see photos). Literally washed these together and wear was the same. Machine wash cold, Tide Free and Clear detergent. They are really comfortable and other than the length fit very well and look good except for that discoloration on the one pair."},{"name":"Pedro Rodriguez","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Really questionable","review":"I know you often get what you pay for but the 'dark gray' pants have a pinkish almost purplish hue to them. They didn't have nearly as much stretch or 'give' as I would like and they are a bit tight. If you're on the heavier side and have a little bit of weight on your hips or above your botox, these will not be so comfortable because they don't go up high enough. None of it is bad enough for a return, the navy pants look good (dont fit great, but I haven't washed them yet.) You ever spill a few drops of bleach on clothes and it turns a bright pink or something? It seems like these pants were rinsed in water that had a few drops of bleach in it, its almost imperceptible but if you're looking for it, it can be seen/if you stare at it long enough. So beware of the dark gray. The navy does look dark and rich in color. IDK if I can recommend to you reading to buy one size up but I might for a pair of black. (After I wash the gray and navy (separately ofc) to see if they hold up) If you're as perfectly slim fit and skinny like the model in the photo, these probably fit well and you should buy your exact size. Im s42 in a lot of pants but these might be nicer in 44x32 in my case. They do fit all the way around my waist properly but hug my buttox too much. I need a tiny bit more room. They are okay around the thighs and the legs. I hope 44 doesn't make the leg portion a bit too big. One more try with black @44 to see if they just dont fit my body right."},{"name":"Chas Polak","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great Trousers At A Good Price","review":"I needed a pair of trousers temporarily because of a waistline problem!! Provided my diet works I should be back in my normal size in the future but in the meantime I needed something in the next size up. Hence the decision to purchase a budget item. To be honest, at the price, I did not expect anything great. However, upon receipt I was very pleasantly surprised. These trousers are manufactured to a high quality, the material is comfortable and seems durable but reasonably light. The fit (35x29) is exactly what I expected and style is as good as any fancy labelled product. I am so happy with my purchase I intend putting in an order for another pair in a different colour."},{"name":"The Bored Consumer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Big, baggy, old mans Chinos","review":"these things are like the big, old man baggy chinos you see all the old men wearing in the movies with the waistband hoiked up to their nipples. They are not suitable for a younger man unless maybe you are going for that look.\n\nI imagine of these actually reflected the size they have on the label they would probably fit a bit better. the 34 I bought fits more like a 36. Maybe go a size down and they will be less bad.\n\nBuild quality and materials seem good for the price though, on par with other brands at this price point."},{"name":"Hinton Martell","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Huge Chinos","review":"These Chinos are more like a straight fit, not athletic fit, you could even go as far as loose fit. The legs are wide all the way down the leg, the bottom leg width measures a whopping 22cm. I'm not sure how athletic you have to be to wear these Chinos, but you really do need to have huge legs."},{"name":"KS","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great chinos at an outstanding price","review":"I have (deliberately) lost a lot of weight over the last year….and have moved from 36 or 38 waist to 33 or (sometimes) 32. I bought these chinos at a point where I thought (as always previously) I would put my weight back on. As a potential short-term fix I thought they ‘would do’.\nAs another reviewer said they ‘came up big’ I tried a 32 instead of my regular 33. They fit but slightly tight round the waist…..not uncomfortable but not perfect. So I ordered the 33 instead and it WAS perfect.\nThe fit is NOT as someone else said ‘old man baggy’ but is comparable to GAP’s ‘straight leg fit’. I prefer their ‘slim fit’ but the Essentials fit was fine.\nThe value for money is great. The quality is comparable to the store mentioned above but at 75% of even their lowest Outlet price shouldn't be missed.\nI now have four pairs in different colours and they are my permanent ‘go to’ purchase. No wonder they are regularly out of stock. I’m a real fan!"},{"name":"Albatiki","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Very nice trousers","review":"Nice trousers. I had been looking for something like this but all my attempts proved to be futile. First and foremost - you can hardly find trousers made in England. The pair I bought has been made in Bangladesh and they are nice. Strange isn't it? Why can't the English do what they used to do better than any other tailors in the world ... years ago? Another thing that surprised me was the choice of sizes. Incredible. Thank you .\nAnd thank you, Bangladeshi tailors."}]},{"id":"B6p5MS","title":"LEE Men's Big & Tall Performance Series Extreme Comfort Pant","imageUrl":"https://m.media-amazon.com/images/I/51Z+t9AKP8L._AC_UX385_.jpg","price":"$34.80","description":"97% Cotton, 3% Spandex\nImported\nZipper closure\nMachine Wash\nStraight fit, straight leg opening\nFlat front, Belt loops, zip-fly with button closure\nFeaturing extreme flex waistband and extreme stretch fabric, wrinkle resistant\nShow more","reviews":[{"name":"Khal570","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Pants that look good on fatties","review":"Are you big boned, as a child was Husky your designer of choice, have you ever used the term 'its glandular'... are you fat? Then these pants are for you!\n\nOnly pair of pants I can recall in a long time that several people commented on... nice pants, I haven't seen that as- in a long time. I immediately went out and bought 3 more pairs. Have I sold you yet?!\n\nOk, now here is the odd part. Pants look good, the material looks fine. The material is also stretchy. Yes, these pants are a hybrid of maternity and Habband Old Man Pants! BUT, don't run away yet. Through hours of toiling in a lab, scientists have somehow perfected elactisity in fabric to NOT look like old man pants.\n\nTry these, ask a trusted friend how they look.  has a great return policy; but if you are like me you will be ordering more for your wardrobe."},{"name":"E. P. Smith","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Best fat guy pants I've found so far, and I've been fat for a long time","review":"Finally big boy pants that don't fit incredibly awkward. They are very very comfortable without being oddly shaped. The legs are not ballooned out, the crotch isn't restrictive and you can actually work in these. I wish they offered more than khaki and black. I'll update as they break in; but initially very impressed."},{"name":"mimijudy","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" They're great!","review":"My husband heard from our son-in-law about how comfortable these pants are. He decided he wanted to try them too - but in the Big and Tall section. Lo and behold, he loved them from the minute he put them on. It's a good thing we got a pair in both colors because he wants to wear only these pants. I did keep searching and found another pair by a different seller- just a lighter khaki. To say he LOVES these pants would be an understatement. Now, we're planning to buy some of these in shorts. They're great!"},{"name":"Anthony Sgalato","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Best work pants ever","review":"These have a cool and smooth feel against the skin and are ready-to-wear right out of the dryer. I have (almost) never needed to iron these pants to retain the sharp, wrinkle-free appearance. When I need to keep my shirt-tail tucked it, the waist band has a little bit of stretch, so the gig-line stays straight and the belt-line lays flat.\n\nAnd, if I go out for a big lunch, I do not feel the tight constriction around the gut throughout the afternoon.\n\nThese are Five Star slacks, no doubt about it.\n\nNow, just a bit of a personal note, because I'm a big boy, the upper inner thighs of these pants shows rub and wear within a few months. This is concerning, but not a big problem."},{"name":"Donna","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" My husband loves them!","review":"My husband doesn't like me buying him pants. When I handed him these to try on he said, \"Thanks hun but I told you already, don't buy me pants!\" He then tried it on and the next thing i hear is, \"Oh! These are great!\" (yeah, you're welcome! lol) He's VERY particular since he's a big guy but he loves these. He's a 44 and these fit just as expected with a nice stretch to them. He's commissioned me to buy more in different colors!!"},{"name":"Cory Spotts","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" These are VERY comfortable and look great!","review":"These are like wearing your favorite jeans you've had for 15 years that your wife wishes you'd throw away, except without the holes. I have a badly herniated colostomy site that is the size of a cantaloupe right on my waistline, so I've been living in sweatpants for a couple of years. The stretch in these works perfectly with this situation, and I didn't have to buy pants with a 6\" larger waist to accommodate it. They look great, and are super comfortable!"},{"name":"BadAstronaut","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Higher quality than I expected.","review":"I bought one pair, and based on my experience with them, immediately bought another in a different color. The fit and stretch are excellent, and the material feels really, really great. I use these as work pants, and I cannot express how easy and comfortable they are while working in a hangar, or climbing in and out of places. I definitely did not expect this good an experience with pants bought online."},{"name":"Nate M","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Holy crap!!!","review":"Hands down the best pair of pants I've ever owned. They knocked it out of the park with these.\n\nThe first words out of my mouth after getting these on were \"Holy crap these are nice!\" The stretching fabric, stretching waistband, all of it feels top notch. Will update once I've had a chance to wear these at work, but I have a feeling my Lee Custom Fit jeans just took a backseat to these."},{"name":"Big Mike","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Comfortable for work","review":"Sizing is slightly larger than expected but still OK to wear. Bought these for work, smart enough for in the office and functional enough for the warehouse. Very comfortable, this is second pair of these I've bought and my only complaint is that the colour fades noticeably over time."},{"name":"J M Hudson","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Five Stars","review":"Excellent cut and fit. The material is high quality and very comfortable. I am very impressed with these trousers."},{"name":"Andy Hawthorne","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Quality of materials and finishing standout as superior","review":"I can’t praise these trousers enough, Fantastic all day round comfort. Great for work and leisure."},{"name":"Kevin Blundy","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Five Stars","review":"Great buy"},{"name":"BobNod","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Don't measure","review":"I like these pants very much, but do not measure your waist as I did when ordering the first pair. I truly do not understand what pant sizes have to do with actual body sizes, I measure a minimum of 46\" anywhere in my waist area. If you have been wearing stretchable pants order your usual size. The 44\" W sits just snug on me, but the waist will stretch out to accommodate a person at least one waist size larger. If you fear you might grow some (lol) these are for you, but it also makes them very comfortable to wear."}]}]