[
	{
		"id": "_uXI2S",
		"title": " Essentials Men's Packable Lightweight Water-Resistant Puffer Jacket",
		"imageUrl": "https://m.media-amazon.com/images/I/81Qyp3yf1US._AC_UX342_.jpg",
		"price": "$21.90",
		"description": "Product Details\nFabric Type\nShell: 100% Nylon; Lining: 100% Nylon; Fill: 100% Polyester\nCare Instructions\nMachine Wash\nOrigin\nImported\nAbout this Item\nCold-weather style is easy with this versatile water-resistant lightweight puffer jacket featuring a full-zip front and stand-up collar\nWith a stand-up collar, zip pockets and elasticized cuffs; packs neatly into included carrying bag with drawstring closure\nOutfit the entire family with comfortable, quality clothing from  Family\nWinter made better: we listen to customer feedback and fine-tune every detail to ensure quality, fit, and comfort\nDescription\n\nAn Amazon brand - Cold-weather style is easy with this versatile water-resistant lightweight puffer jacket featuring a full-zip front and stand-up collar\n\nAmazon Essentials is focused on creating affordable, high-quality, and long-lasting everyday clothing you can rely on. Our line of men’s must-haves includes polo shirts, chino pants, classic-fit shorts, casual button-downs, and crew-neck tees. Our consistent sizing takes the guesswork out of shopping, and each piece is fine-tuned to offer quality and comfort.\n\nSee more\nAbout this Item",
		"totalReviewCount": "22,901 global ratings",
		"averageStarRating": "4.5/5",
		"reviews": [
			{
				"name": "Christopher Zele",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great inexpensive puffer jacket",
				"review": "I was able to snag one of these puffer jackets for my Step Dad for $21 for Christmas. It runs a little bit big and he normally is a Medium, but I bought him a Small and that seems it will be perfect for him. The quality of the material is very nice they used a good filler and the jacket feels nice when I tried it on to see how it would fit. Most puffer jackets are $40 or $30, so when I saw this for the low $20s I had to pick one up.\n\nYou can fold this puffer jacket up into a ball, which is a nice plus if you're hiking somewhere cold and it warms up in the afternoon and you want to put the jacket away.\n\nThis jacket definitely feels like a $40+ product. I own an Old Navy Puffer Jacket, which I've used for years and a Patagonia one. This  one is very close in quality to the Old Navy one. It feels good to the touch and looks sharp.\n\nIf I was in the market for another gift for someone, or I needed another puffer jacket for myself I would definitely buy an Amazon Basics because they're both cheap and high-quality."
			},
			{
				"name": "Avant",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Good cheaper alternative but not for heavy use",
				"review": "I bought for the purpose of travel and outdoor use in those times where temps can change drastically from 70F in the morning down to 40F at night.\n\nI got this on sale for $20 which was a far cry from $60-120 asking price of other packable down jackets. For the price, it's much warmer than I thought and has well thought out features. So far I've worn this in 42F weather, coldest and just going on a walk I was breaking a bit of a sweat with it half zipped. It has 2 exterior pockets and 2 internal pockets. Personally I wouldn't put too much in these, as I can really feel the thing stretch and drag down. Just gloves, hat, phone etc. should be fine, nothing like a can of soda or something. Water resistance is what you expect for thin nylon stuff, a few drops is fine, actual rain, get an umbrella or an actual waterproof layer. It's also pretty windproof, took it out in the aftermath of a pseudo hurricane and didn't feel the wind.\n\nIt packs down pretty well into a 6 inch long 3 inch or so bundle but nothing like the high tech hiking stuff, I just wish there was a shorter loop so I can carabiner it to my pack easier but seems like it was intended to be carried like an umbrella. Also wish it packed into itself rather than have a bag which may get lost one day. The material imo isn't very durable, I have no rips yet, but I'm not confident and think if I rub on something the wrong way it's going to tear. The stitching seems fine so far, and doesn't seem to be leaking filler yet.\n\nSizing wise, I have a 45 chest and usually wear XL, but this is kinda big even for an XL, maybe because they were antiicpating you layer something like a thick sweater underneath. It is also a bit long for my torso, about 2-3 inches more than I need to sit at my waist. I have 23 sleeves and that fits perfect.\n\nI don't expect this to last a long time, but it's useful for the time I'll have it.\n\n12/28 edit:\nSo I just used this exactly for what I bought it for because of the huge winter storm that swept across the north and east coast US. Temps went from nearly 60 degrees in daytime all the way down to 23 by late afternooon with extremely high winds that were throwing doors around and knocked some street signs off their mounts, and it was perfect. I just had a t-shirt underneath and on top of this was a gymax waterproof windproof jacket. Again my only complain might be if the material doesn't last and it's a bit long."
			},
			{
				"name": "Nunya001",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Big Performance for a very low cost",
				"review": "I bought this jacket to wear at work - I make a wood product and I'm outside in all weather. I need jackets to be no fuss and functional but also affordable so if I tear it, spill oil on it, burn it with welding sparks I can shrug it off and buy a new one. As a point of reference Patagonia is my personal go to outdoor wear supplier, but that's way too expensive for work.\n\nI've been wearing this jacket now for a couple of months. Just went out in 13 F with pretty decent wind gusting - warm and comfortable. It's cut allows good movement and it's not so bulky so you can put a shell over it in wet weather, although I've worn it in the rain without a shell and it does pretty well. I'm 6'2 185 with long arms and a medium fits just right. I wish it was 4 inches shorter - that's my only suggestion."
			},
			{
				"name": "Dan",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Depends on the fit you like. See more for good info.",
				"review": "Really great for the price $22 I got a large and ordering a 2nd that is medium, if I used it a lot (or it cost more) I would get something more durable like a name brand. But price wins and it is warm, it works for what I use it for. The fit is more of a traditional fit that is to say a large is baggy for my slim fit preference. I am a man who is 190lbs 5'11. Before the pndmic I was 175 (got gains) and would have gotten a small knowing the sizes haha #goals.\n\nIf you want a long term thermal go buy a brand name it will look 6 times better, but this thing has its place for sure!! I like things more tight fitted and in my post pndmic body i'd get a medium or probably a small to wear under a jacket. So if I was 175-180 i'd probably get a small I think to wear under stuff, but a medium if its the main thing and you don't like fitted clothes.\n\nI planned to get 2 of these with one to wear to work and another to get dirty from yard work and outside things. I first ordered a large and it is baggy for my preference but probably what most men would want. I like fitted clothes and have ordered another one in size medium to wear to work. I am keeping the large for yard work and other things. Great to have 2 or 3 instead of one high priced item.\n\nHope it helps!"
			},
			{
				"name": "Clau",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Excelente compra!!!",
				"review": "Está increíble la calidad. Es muy similar a las chamarras Uniqlo, con una diferencia de precio enorme. Se guarda perfectamente bien en su bolsita y no pesa prácticamente nada. Es calientita. Básica para los viajes. El color es igual a las fotos de la publicación de , y viene ligeramente jaspeado el tono. Viene amplia. Estaba dudando entre la L y la XL y compré la L y acerté. Si estás entre dos tallas escoge la pequeña. Súper recomendada! Si esta reseña te fue útil da click en me gusta para evaluar si escribir otras reseñas"
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Surprisingly good",
				"review": "So I have to say I had rock bottom expectations buying this. But corona has been good to me and I’ve lost 30 kg in the last year. As such basically nothing fits me. Therefore in desperation I turned to  to help me out. The coat is lightweight. Folds super small in the provided bag. Has a nice matte finish. Sizing is good. I’m 175cm and 71kg - the small is just a shade too big. Otherwise really happy."
			},
			{
				"name": "JHK",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " size",
				"review": "Im a 46\" chest and a 36\" waist. Im 6'0\".\nMy normal size to go to is XL.  apparently knows this and recommended a 2XL.\nHowever, having read the reviews I went for my go to size XL.\nIt arrived. Way too big. So I returned it using their carrier which was EVRI which annoyed me cos I thought I could return via the  shop which is much easier. EVRI system and machines are shocking.\nI then ordered the L. Very rarely do I do that as they are normally too tight.\nIt arrived. Fits fine on the chest and shoulders , arms and length, but the waist is a bit baggy and loose. It's like for a 39\" waist I would say. ( I do train/swim a lot and have a v shape)\nIm being super fussy, but for £37 I feel I should be. I am sticking with it as I figure a M would be too tight.\nAnother thing. It is a female zip. Zips up on the wrong side. No big deal these days as we are alll meant to be one and the same right? Just letting you all know that's all.\nHope this helps. Surely Amazon Essentials should be able to get sizing and measurement information right and show it with the products.\nCome on Amazon. I love you but you really should give more information and more accurate sizing with your products. Hope this helps you as requested."
			},
			{
				"name": "Tony K",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Fabulous value",
				"review": "Truly surprised by how warm this jacket is. It’s feather light and my first thought was that it is pretty thin so my expectations were pretty low. How wrong was I? I work outdoors in N Scotland and already in Oct temperatures are only 4 or 5C. I’ve been wearing it under my overalls instead of a fleece and wow it’s warm. It isn’t an Arctic level puffa jacket but I think that’s fairly obvious but it’s way warmer than a fleece, not at all bulky and fabulous value for money. I definitely recommend it"
			},
			{
				"name": "Jay Dee",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Delighted...",
				"review": "...with this jacket.\n\nIt is everything it claims to be in the description and despite being lightweight it is pleasingly warm [snug as a bug actually].\n\nThe stitching is excellent and I found no loose threads. It has two external zipped pockets and two large inside lower front quite deep pouch pockets. The zip, in keeping with the 'lightweight' theme is quite narrow but works well and zips right up to the top of the collar.\n\nSize-wise I would say it is 'true to size' bearing in mind what you may be wearing under the jacket in cooler times."
			}
		]
	},
	{
		"id": "P8q9oC",
		"title": "TACVASEN Men's Jackets-Windproof Bomber Jacket Full Zip Winter Warm Padded Coats Outwear",
		"imageUrl": "https://m.media-amazon.com/images/I/610DOILk1jL._AC_UX385_.jpg",
		"price": "$46.98",
		"description": "Product description",
		"totalReviewCount": "5,063 global ratings",
		"averageStarRating": "4.4/5",
		"reviews": [
			{
				"name": "Ace Traveller",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Very impressive for $50",
				"review": "Let me start by saying that I have not had this jacket long enough to know how it will hold up over time but so far this jacket is amazing.\n\nFit\nAt 6'2\" / 200 (long legs) I was tempted to get the XL but got the Large as I wanted something really light as I have a full winter coat but could not be happier with sizing of the Large.\n\nMaterials\nThis jacket has a really soft and water resistant outer skin. I placed my arm under my water spigot and the water just bounced off and two quick shakes of my arm and it was dry. The inner liner is very good at storing body heat so you could probably get away with this being a three season jacket if you live in an area with relatively mild winters.\n\nFeatures\nThere are four pockets on the jacket I have, two traditional waist-level jacket pockets on the left and right with an inner pocket and an outer left arm pocket. The two hand pockets are decent but a little shallower than I expected. The inner pocket is nicely sized and readily falls to hand. I will likely never use left arm pocket as it feels odd to access and awkward to zip back up. Speaking of zippers, all of them appear to be of at least decent quality as the zippers feel decently robust and the tracks are metal. It is a bit annoying that the main zipper on this jacket is on the left which is different than any other jacket I have owned and takes a little brain retraining to get use to.\n\nOverall\nI have spent a lot of money on jackets in the past but also got my money's worth. I went a bit cheaper this time but I am pretty impressed even in the short time I've worn this one. I will add an edit if this impression changes due to unexpected quirks or wear."
			},
			{
				"name": "G Unit",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Wrinkled. Must steam.",
				"review": "Jacket is nice. But shipped wrapped in plastic bag. Put in washer, hung to dry and then steamed on low setting to get all the wrinkles out. I would never wear the jacket as shipped. The wrinkles are bad."
			},
			{
				"name": "Kindle Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Good jacket",
				"review": "I wore the official military flight jacket for years, i wore it out after 20 yrs, so I was looking for a replacement, and this came highly reviewed, so I figured what the heck. It arrived as stated, and in pretty flat shipping bag. I was alittle disappointed because it lack the sheen like the photo, but I wore it outside the next day, 50F, and sunny, I got really warm fast and had open up the zipper, it moves well and fit nice, will be my yard work and local hiking and walking jacket on those cool days."
			},
			{
				"name": "Woods13",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Early spring/late fall",
				"review": "Decent coat for the money. Not as warm for winter weather as I had hoped. Polyester fill is fairly thin."
			},
			{
				"name": "Dave Garcia",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Cool jacket",
				"review": "I bought this for my son-in-law for Christmas. He really liked it. He said even though it is not overly bulky, it was still warm. A good buy I think."
			},
			{
				"name": "Repairman",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Nice jacket, but the zipper is on the wrong side.",
				"review": "Nice lightweight windbreaker jacket but the zipper is on the wrong side."
			},
			{
				"name": "Richard Morgan",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great Coat, Fast Shipping",
				"review": "I love this coat, it is a good quality at a great price"
			},
			{
				"name": "GS",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Nice jacket",
				"review": "Just what I was looking for. I bought my father one too"
			},
			{
				"name": "AD VAN DYK",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "2/5",
				"reviewTitle": " Flimsy, not thick at all",
				"review": "I thought it would be much thicker. But it's really flimsy. Not suitable for winter at all. The size is good. I'm 6.2 and ordered an XL.\nI also have a real Alpha Industries genuine bomber jacket and it's 10x thicker than this one. Also the green is not like on the picture advertised.\nOH well, I'll wear it in the spring and fall."
			},
			{
				"name": "Canada Neu",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " YOU WILL NOT GET WHAT YOU SAW ON THEIR ADS.",
				"review": "As first sight, it looked a well made wind breaker but details and quality don't match what they shown.\nJoint of elastic waistband and main body is single, not doubled stitches like their photo shown. Inside pocket is the same (single stitch). Zipper is cheap looking and not even close to what they showed on the photos. Pencil pocket is made with single layer of fabric with no thicken edge. If you use this, soon the fabric will be torn.\nSomeone mentioned that inside smells like old insulation. I agree. It has old hay like smell. I'm not sure if the smell goes away eventually. You need to order one size bigger than what you normally buy.\nWhat they showed as good features/quality are not there. You should check your jacket very closely if you bought one. The price is reasonable but YOU WILL NOT GET WHAT YOU SAW ON THEIR AD."
			},
			{
				"name": "Ryan Kells",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " My Review",
				"review": "My jacket order was fast. Ordered on Sunday, received on Wednesday. Colour (navy) and quality as advertised. It;s not a puffy coat and it's not real thin. Somewhere in between. Size chart and sizing is accurate. I'm 5' 10, 210 lbs (size 46 suit jacket), I ordered an XL and it's great. My son is 5' 11\", 175 and the XL is not too big but L would be perfect. Zipper was a LITTLE wonky like others have mentioned in their reviews. All in all, very satisfied."
			},
			{
				"name": "Laurence Dube",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Nice quality and good looking but size chart is seems to be missing",
				"review": "I like the material and model of this jacket. Tend to get puffed up a bit since there are air pocket in the insulation. Nothing major but this jacket won't drop super straight on you. Giving only 4 stars because middle zipper is a bit hard to start and there were a couple of loose threads of fabric I had to remove here and there. All seems ok but was not expecting to do this with a 50$ jacket. The size chart was missing to ended up ordering a Medium and a Large. I am 5'10'' and weight 180 lbs. Large was perfect for me. I am super satisfied of the look of the jacket."
			},
			{
				"name": "Kent",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Solid Lightweight & Warm",
				"review": "For me this jacket is perfect! Zipper works great and YES it is LH but that is traditional in this style jacket. Just get used to that guys! Although it weighs next to nothing it slips on easily and is perfect warmth for me even here in Northern Ontario. Yeah dead of winter I will be layering anyway and I do have a parka this is the COLD NORTH! Most of the year this is going to a perfect casual jacket!\nI don't know why so many are complaining about the quality this is really nicely sewn and all the zippers work smoothly etc.. Do yourself a favor and give it a try!"
			}
		]
	},
	{
		"id": "NrzD0V",
		"title": " Essentials Men's Lightweight Water-Resistant Packable Hooded Puffer Jacket",
		"imageUrl": "https://m.media-amazon.com/images/I/81TnIAEZoBS._AC_UX342_.jpg",
		"price": "$24.40",
		"description": "Product Details\nFabric Type\n100% Polyester\nCare Instructions\nMachine Wash\nOrigin\nImported\nClosure Type\nZipper\nAbout this Item\nEasy through chest and tapered through waist\nWater-resistant, durable fabric with filling for warmth\nHooded design\nFull-length zippered closure at front\nAn  brand\nDescription\n\nAmazon Essentials is focused on creating affordable, high-quality, and long-lasting everyday clothing you can rely on. Our line of men’s must-haves includes polo shirts, chino pants, classic-fit shorts, casual button-downs, and crew-neck tees. Our consistent sizing takes the guesswork out of shopping, and each piece is put to the test to maintain the highest standards in quality and comfort.\n\nSee more\nAbout this Item",
		"totalReviewCount": "7,959 global ratings",
		"averageStarRating": "4.5/5",
		"reviews": [
			{
				"name": "joel oleta",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " felt like it wasnt going to do the job, i was wrong its great",
				"review": "Well i bought this so i can have an affordable puffer jacket i can abuse and not feel bad about. used it for everything and anything that involved being cold outside.\nNot wanting to risk expensive jacket incase i ruin it or hate it i purchased this one but so far it has withstood the abuse. i am pleased with the purchase and i recommend it if your in the market for this item and price is an issue . i have used it for concerts ,camping ,late night shopping trips ,taking out the trash at 4 am also just for the random day hikes .\nthings i like it packs really small and is very light it also comes with its own drawstring bag that seams to match the color you purchased , i think anyhow because i have purchased 4 different colors (Christmas presents for family members ) and all come this way.\nAlso this thing does very well in windy conditions it seams to have a very thin feel for a puffer jacket but the small amount of insulations paired with the inner and outer shell of jacket material reminds me of safety blankets ability to reflect body heat back to you this feature for staying warm is doing great for lack of \"poof\".\ni took this to a outdoor concert in LA (besame mucho) and it was very cold and windy because of concert rules only small see through bags were allowed so i brought this jacket in its drawstring bag and took a very small amount of space and was perfect for the situation kept me warm through the whole night night. had very large outside pockets with zipper closures and very deep inside pocket behind the outside zip up ones, they seam to share the space keep this in mind when placing bulky items one side will use space from the other even thought they are separate a pocket . the hoody does not have draw strings but i dont feel needs them i think we have gotten use to everything needing drawstrings, it is a bit spacious inside the hood i guess if you have a beanie or a baseball style cap it should fit fine and extends just before the bill of cap. i just hated that they tried to ship it in no box just a clear see through bag the first time had to return arrived damaged.\nIn new condition its durability is uncertain until this point it has held up (2months), not sure yet the feel is not the toughest it has a thin feel but notably i have not torn it and it has at least been through the wash once keep in mind i airdried all this said it looks brand new and is in great shape , i would whole heartedly recommend this jacket just look for the deals also get the vest for an added layer of warmth"
			},
			{
				"name": "Bill O.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Runs a little big but does a good job of being a lightweight jacket",
				"review": "The main purpose of a lightweight jacket is to keep you warm when it's cool outside but not super cold. For me that means I purchased this jacket for temps between 35 and 60. I wouldn't want to rely on it any colder than that. For that purpose, it does extremely well. I don't feel too hot wearing it in the upper 50s, and as long as I don't spend hours outside when it's in the 30s, it keeps me warm.\n\nMy only knock is that the sizing feels like it is from 20 years ago when everything was a bit more loose fitting. That's good if you want to layer up, but the styling is not the current trend of slim/ form fitting. Since I'm an older guy now, that's not as important to me, but it may be for others."
			},
			{
				"name": "Linda-Lu",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Loving it so far",
				"review": "I bought a man’s jacket for the extra length and larger pockets. I know the sleeves are too long. But idm. I’ll just roll them up. A size down would’ve been better, but there’s nothing wrong with a little extra space for layering. (I’m not doing any fashion shows). My comfort is my priority.\n\nThe jacket feels good on. It’s light weight.\nIt stores nicely into the sack provided and comes out wrinkle-free. It allows for a sufficient/confortable heat and is rain resistant (in a light rain). I tested it out today.\n\nOverall, I am VERY VERY happy with this jacket. I’m glad I bought it.\n\nI only wish I had another one to alternate between colors."
			},
			{
				"name": "Breck",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Fantastic Value Puffer Jacket",
				"review": "Is this the best puffer jacket you can get? Probably not. Is it a fantastic value, high-quality puffer jacket for a fraction of the price of others? You betcha. Very pleased with this jacket. I did order a size up and I'm glad I did. I typically wear an XL, but I ordered an XXL so I can wear it over thicker hoodies and sweaters and I'm glad I did. I don't think the XL would be as comfortable over bulky layers. The XXL is almost too big though, I wish there was like a 1.5 or something. But I'm still very happy with it. It's a higher quality jacket than I was anticipating. It's very lightweight and packs up super small when you need it to. If you're looking for a quality jacket for chilly weather, you won't be disappointed."
			},
			{
				"name": "Jerry L.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Worth It",
				"review": "If you need or want a good puff jacket that you can easily pack into your hiking pack and a just in case you need it jacket this is it. I have a Columbia one as well that is much warmer to be honest but I got this more for cool fall days, it is truly worth the price. When it gets wet I do not feel like it is making me wet so it has good weather resistance. If you are a guy who is not small order a size up than you normally would get, it will fit you much better."
			},
			{
				"name": "A-Aron",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great Versatile Jacket on Grand Canyon Backpacking Trip",
				"review": "Took a risk on this budget jacket as a lightweight warm layer option during a three day Grand Canyon November backpacking trip. Setting out, I wore frog toggs on top of this jacket as a water resistant layer as we descended the south rim in a “winter mix” as one ranger referred to it, a sideways barrage of freezing rain and hail. We were moving at a good pace with 40lb packs, but this jacket kept me at a perfect temperature for all days of the hike. At night, I wore it to bed in a 20-degree sleeping bag and it kept me toasty as overnight temps were near freezing. I thought it might be a single use type of product, but I continue to wear it as a primary option out and about when I want to stay warm. I’ll likely take it on another trip and will happily do so. I wouldn’t trust it in a downpour, but it can take a short, light sprinkle without issue. Zipper is higher quality than expected, hood is prefect, comes with a small stash bag."
			},
			{
				"name": "Sush.Diss",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Very comfortable",
				"review": "This is a very lightweight yet effective jacket. Keeps you warm. It has two large pockets closed with zips (no chest pocket or inner pockets). The hood does not have a zip code to tighten around the face. The main zip slider is strangely on the left. It slides easily.\nBut this is a very comfortable jacket. Well worth the price. I ordered one size larger as my arms are longer than what it should be. So it fits slightly loose on the chest.\nOverall I like the jacket. Would recommend to others."
			},
			{
				"name": "Matt Morris",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Nice but baggy",
				"review": "Nice jacket. Smooth, soft, warm, comfy. I'm a 41\" chest and it fits nicely around my shoulders chest and arms, but it's pretty baggy around the stomach. As there's no elastic at the bottom it's pretty loose. Will likely see if a tailor can put some elastic in it or something. Probably better off waiting to see if Trespass have anything in the Christmas sales to be honest."
			},
			{
				"name": "Kiran",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Good value for money",
				"review": "100% Good value for money\nQuality is better than what I paid.\nOnly one suggestion or downside, this is not adjustable, they could easily make this adjustable but still deserves 5 star\nReduced 5 to 4 stares for the following reasons:\n1) Zipper is apposite side (this is not related to cost )\n2) Tested on moderate chilli wind and it doesn't stand. (I understand it is a lightweight but I expect it holds for moderate cold weather )"
			},
			{
				"name": "Jerry C.B.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Lightweight and good fit",
				"review": "Accurate sizing.Comfortable fit;ideal for spring or autumn when weather is more unpredictable.Not easy to fit into bag provided but otherwise as good as expected.Slightly overpriced but, overall, no complaints."
			},
			{
				"name": "ardbigyin",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " dont like zip on womens side",
				"review": "bought from  warehouse i bought xl iam roughly 46/48 maybe should have bought large as loose on me would not pay full price that amazon are asking for"
			}
		]
	},
	{
		"id": "AK-HLr",
		"title": "Levi's Men's Washed Cotton Hooded Military Jacket",
		"imageUrl": "https://m.media-amazon.com/images/I/81ue5-58RmL._AC_UX385_.jpg",
		"price": "$56.14",
		"description": "Product Details\nFabric Type\nShell: 100% Cotton; Lining: 100% Polyester\nCare Instructions\nMachine Wash\nOrigin\nImported\nAbout this Item\nFUNCTIONALITY: Washed cotton jacket with zip out jersey hood making this jacket a perfect versatile fit,  adjustable snap cuffs, chest and slant hand pockets, and interior pocket for added storage\nSTYLISH FEATURES: Full-length zipper enclosure as well as button enclosures can better protect you from wind and cold temperatures,  durable heavy material, comfortable soft, military style makes it an ideal all-purpose jacket for men\nADDED WARMTH: The Sherpa lining adds warmth and insulation for colder weather; This adds comfort and style\nDURABLE MATERIALS: Made from 100% heavyweight cotton; This military style makes it an ideal all-purpose jacket for men and is built to stick with you through many seasons\nDescription\n\nThis jacket in rich neutral colors will you keep as warm as you need to be with its removable hood and lining.\n\nSee more\nAbout this Item",
		"totalReviewCount": "7,745 global ratings",
		"averageStarRating": "4.6/5",
		"reviews": [
			{
				"name": "Justin",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Review from a tall dude",
				"review": "I feel like I got very lucky with my purchase here. I pulled the trigger on the tall and am so glad that I did because it's just the right length in the arms and the torso. For reference, I'm 6'3 and around 210lbs and I got the large tall. I would opt for XL a lot of the time but with reviews saying this ran big I decided to stick with the large.\n\nThis is made of really sturdy materials. Not as sturdy as something like a Carhartt for example, which in my opinion is almost too tough (and quite a bit more expensive), but it feels like this is built to last a good while. The detachable hoodie part is a really cool touch. The wrist cuffs have two buttons for a looser or tighter fit. The inside of the torso is sherpa while the inside of the arms is a nice quilted material. The front pockets for your hands are on the sides, although the pictures make it seem like they would go in under a flap. I got the brown version (lighter one) and it's exactly as pictured. Overall I'm happy with this coat overall and look forward to perhaps buying other colors."
			},
			{
				"name": "Barredbard",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " A Great Fit for an Understated Look",
				"review": "I had always wanted a winter coat that didn't quite look like one, or have the bulk and heft of one. The somewhat pseudo-military or even quasi-cowboy look has always appealed to me. I am thrilled with this coat. I usually wear a large, but with winter coats I tend to get a size up, to accommodate any garments underneath. It was the right call. The look is crisp and understated, which is what I was going for. With the hood, it's a blend of the trendy, with the classic.\n\nAs I wore it for the first time, I thought the only thing missing is the ability to remove the hood at my option. I checked, and low and behold, the hood can be unzipped and removed. I am not sure why this important feature was not mentioned. I almost did not buy it because I was debating that white hood. The fact that it can be removed is excellent.\n\nGreat coat."
			},
			{
				"name": "Malckiah",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Buy it!",
				"review": "I bought an XXL based on what everyone was saying. I ended up sending back for XL which I never do... but when I got the wrong size I could see that this jacket was WELL worth the money. Definitely a good quality jacket that will keep you warm. I would definitely reccomend and it was worth the trouble to send it back for the right size. I am 5\"10... 190lbs... XL is perfect for me."
			},
			{
				"name": "Louis arc",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Fits comfortably but durability is questionable",
				"review": "After less than a year with this jacket, a portion of the back has a rip about 7 inches long and has exposed the cotton underneath. I would like to arrange for a replacement if possible because it is a nice jacket but can't continue wearing it as is."
			},
			{
				"name": "Aqueeta Parker",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " The perfect winter jacket",
				"review": "I have been looking for a jacket for my boyfriend for some time and finally stumbled on this on. It is a perfect fit, he is 5’11 200 lbs, just below is waist. We got it in a size large, it is the perfect jacker for the rainy winter season because it works well at a rain jacket as well as a layered winter coat."
			},
			{
				"name": "Lanloesh",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " It's worth 70 bucks.",
				"review": "Comfort and warmth are the standouts for this jacket. You're essentially getting a hoodie and a jacket in one. The feel is top notch and I feel like I could wear it all day."
			},
			{
				"name": "E. Brooks",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Narrow shoulders, wide waist",
				"review": "My husband is broad shouldered and slim waisted, he is also tall. Got him an XL and it was too large through the body and much too small through the shoulders."
			},
			{
				"name": "robert dolan",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " I like how it looks and feels",
				"review": "Step above a Hoodie jacket can wear with other jackets under the coat or with a coat over it very warm I have 2 of them now."
			},
			{
				"name": "rjg.1969",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " You won’t be disappointed!",
				"review": "Good fit. Quality jacket. Quality brand."
			},
			{
				"name": "P Williamson",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Perfect",
				"review": "Excellent fit"
			},
			{
				"name": "Glen",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Not good quality",
				"review": "I love the look of this jacket, but I must say the quality has left me disappointed. The fit is not overly generous for the size I bought, but it's OK. The main issues I have had are that the zipper pull broke on day one - not a big problem, I was able to rig a replacement, and yesterday (just after the return period closed), a seam on the right sleeve at the back of the shoulder opened up about 4 inches. I had to take the jacket to a tailor to repair it. I have only worn the jacket a few times so far, so there's no way it should be coming apart already. Really not impressed.\n\nUpdate 22-2-22 - today the seam on other sleeve came apart as I was simply reaching up to take off my hat. This jacket is SUCH poor quality - I STRONGLY ADVISE AGAISNT BUYING ONE. I will be contacting the seller to see if they will refund, even though the date has passed."
			},
			{
				"name": "Mau",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Calidad excepcional",
				"review": "Me encantan los materiales, el forro, el teñido y la talla. Creo que es la primera prensa que siento me convenció en todo aspecto"
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Too short",
				"review": "Way too short on me, bought a large and the only sizing charts are for chest size but nothing about length. I am 6'4\" and unfortunately only realized it didn't fit after I removed the tags. Every shirt I own sticks out the bottom of the jacket. I like the quality of it though but it would be nice if I knew what size would actually fit me."
			}
		]
	},
	{
		"id": "DwOvvA",
		"title": "Columbia Men's Ascender Softshell Jacket",
		"imageUrl": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/71gluQqwAYL._AC_UX342_.jpg",
		"price": "$58.70",
		"description": "Product Details\nFabric Type\n100% Polyester\nCare Instructions\nMachine Wash\nOrigin\nImported\nAbout this Item\nCOMFORT STRETCH: Crafted from 100% polyester that offers comfort stretch, this comfortable softshell makes for versatile wear — from the trail to the office.\nWATER RESISTANT: don't worry if it starts to drizzle or the wind picks up. The water-and-wind-resistant jacket has you covered.\nCLASSIC FIT: This softshell is made with a regular fit cut, for a classic design that you don't have to think twice about.\nHANDY FEATURES: Thoughtful touches include an abrasion resistant chin guard, zippered chest and hand pockets, adjustable cuffs, and an adjustable hem.\nBUILT TO LAST: Columbia’s attention to detail is what sets our apparel apart. Specifying only the highest quality materials, expert stitching, and craftsmanship. This is a long-lasting garment you will enjoy for seasons to come.\nDescription\n\nThis wind-and-water-resistant softshell will keep you warm—whether you want to stand out or blend right in. It's built for foul-weather outings, with a comfort stretch fit, an adjustable hem, and adjustable cuffs. Made of a durable yet light 100% polyester, with a soft, abrasion resistant chin guard and multiple zippered pockets. Columbia offers this jacket in multiple colors and sizes. Regular Fit. Extended sizing available. To ensure the size you choose is right, utilize our sizing chart and the following measurement instructions: For the sleeves, start at the center back of the neck and measure across the shoulder and down to the sleeve. If you come up with a partial number, round up to the next even number. For the chest, measure at the fullest part of the chest, under the armpits, and over the shoulder blades, keeping the tape measure firm and level.\n\nSee more\nAbout this Item",
		"totalReviewCount": "10,702 global ratings",
		"averageStarRating": "4.7/5",
		"reviews": [
			{
				"name": "Justice A.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Most durable jacket I’ve ever owned.",
				"review": "I have a black Ascender jacket I purchased back in 2016. I’ve worn it 3-5 times a week, 5 months a year for the last 6 years..\nI’ve done yard work, mechanic work, and carpentry work in it consistently during that time. I always knew I could i could throw it in the washer and it come out good as new with the same vibrant color. Until the fateful day I wore it while painting outside..\n\nAcrylic paint doesn’t come off easily, so I had to purchase another for wearing out to dinner and such.. Now my original jacket is worn solely for work and still; Another few months later, no holes or rips in the fabric, and the cuffs and collar are un-frayed and fit perfect.\nAmazing stuff!"
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " The quality is still there for casual Columbia fans.",
				"review": "I was spooked by some finger reviews saying the quality had drastically dropped but mine came in as advertised. I bought one of these jackets maybe 6 years ago now and I imagine this one will last as long. The only thing is I wished they had lined the collar with the fleece material like on my old one instead of leaving it bare.\n\nMedium fits me perfect for the weather I wear it in (40's to 50's with a t-shirt or light long sleeve shirt. Anything colder requires a heavier coat)."
			},
			{
				"name": "Mark W",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Nice jacket",
				"review": "Jacket fits true to size (recommend using the sizing chart). Jacket works well and keeps you warm between 40-50 degrees. If you are looking to layer up with this jacket, I would recommend ordering the next size up. Overall very pleased with this jacket."
			},
			{
				"name": "Appaiah Mallu",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Good",
				"review": "Good but my father told me it is bit tight."
			},
			{
				"name": "Thad Riley",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great quality",
				"review": "I bought this jacket as a replacement for my previous Columbia jacket that I seem to have lost. That was a great jacket as well but the outer material was different, more of a nylon woven type of material. This jacket is more of a shell. The design is very sharp, smooth and simple. The material is extremely resistant to dirt. I was recently working an event where the jacket was under a table on a concrete floor for the entire day. I was worried about it getting very dirty, but when I pulled it out there was no dirt on it in spite of there being a lot of dust bunnies. Love the jacket and will replace it with the same kind when this one has lived its full life and moved on to jacket heaven."
			},
			{
				"name": "DaisyGirl51",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " He is between sizes so this was the perfect size to order. Will get a couple of years wear.",
				"review": "Jacket is perfect. Our grandson thought his dad was \"sharp\" in his and loved it so we got him one for Christmas/ He wore it for his \"performance\" at his Christmas school program. He loved it!!"
			},
			{
				"name": "Edward G",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Very love this jacket!",
				"review": "Exactly what I need."
			},
			{
				"name": "Mor Messry",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " The perfect jacket for outdoor job. Thanks.",
				"review": "excellent and good value for the price."
			},
			{
				"name": "David Far and Wide",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Not bad, solidly built. A bit too baggy for me.",
				"review": "It's a really solidly built softshell - very substantial and definitely not for warm days. Keeps the wind out well and is styled in a way that means it's probably more towards casual wear than technical.\n\nI didn't really love it in the end though because the sizing was too much on the large size. I'm on the small size really - 37\" chest, 5'7 height - supposedly a SMALL in Columbia, but although this fit okay, it wasn't the technical or slim fit I was hoping for - more baggy and boxy, hanging off me rather than close to the body. Great if you want a wear a full weight fleece underneath I suppose."
			},
			{
				"name": "Colin C",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Excellent quality",
				"review": "After some adjustment this now fits rather well and I am quite pleased although the price, including postage, is higher than direct from Columbia UK."
			},
			{
				"name": "Vincent Miller",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Excellent quality jacket",
				"review": "Good quality jacket"
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "2/5",
				"reviewTitle": " Poor Quality Zipper",
				"review": "After just a few months of wearing the jacket the zipper broke. Luckily  looked after our problem and had a new jacket sent to us. Columbia`s customer service department was TERRIBLE!!! They wanted me to send the jacket back at my cost so that they could evaluate whether it would be considered under warranty OR go to a tailor to have the zipper fixed. We live very remotely and the nearest tailor is over 2 hours away. When I asked whether there was another option they said NO. Again, Amazon came through for us and reafirmed why I love ordering from them. I won`t be ordering a Columbia product again and give their customer service department a 1 star rating."
			},
			{
				"name": "Allan Pendlebury",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Very comfortable but zipper broke after six months and little use.",
				"review": "It is a very comfortable jacket. It seems to hold wind at bay and although I haven't been out in any heavy rain, just light rain that beaded on the jacket without soaking in. I did read another review where the zipper wasn't heavy enough. It isn't as heavy duty as my last, but so far works well. I will practice more care when doing it up; just in case.\n5/15/22: Edit: Just out walking dog in what I would say was moderate to heavy rain and stayed dry under jacket.\nSomething else I forgot to mention: I really like the breast zipper pocket to store my smartphone while hiking.\n10/24/22: Edit: Zipper broke this AM. I haven't worn it over summer so not that much use; have to reduce the stars to 1. Everything else is fine but it has become a throw away and search for another jacket with sturdy zipper."
			}
		]
	},
	{
		"id": "smsPNw",
		"title": " Essentials Men's Full-Zip Polar Fleece Jacket (Available in Big & Tall)",
		"imageUrl": "https://m.media-amazon.com/images/I/816R2GcSWUS._AC_UX342_.jpg",
		"price": "$12.08",
		"description": "Product Details\nFabric Type\n100% Polyester\nCare Instructions\nMachine Wash\nOrigin\nImported\nClosure Type\nZipper\nAbout this Item\nEasy through chest and tapered through waist\nSoft, warm and fuzzy mid-weight polar fleece fabric\nFull-length zippered closure at front\nAn  brand\nDescription\n\nAmazon Essentials is focused on creating affordable, high-quality, and long-lasting everyday clothing you can rely on. Our line of men’s must-haves includes polo shirts, chino pants, classic-fit shorts, casual button-downs, and crew-neck tees. Our consistent sizing takes the guesswork out of shopping, and each piece is put to the test to maintain the highest standards in quality and comfort.\n\nSee more\nAbout this Item",
		"totalReviewCount": "34,355 global ratings",
		"averageStarRating": "4.5/5",
		"reviews": [
			{
				"name": "Texas Mimi",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Amazing bargain!",
				"review": "My hubby loses jackets frequently because he's on a job site, takes them off and they disappear.\nHe needed (another) casual jacket. Nothing to big and heavy like a coat. Just something for cold mornings but easy to stash when the day warms up. I picked this jacket because of the cost, to be honest. $15?? I figured it would be thin and cheap but if he lost this one too, no great loss. What a surprise when it arrived. A nice mid-weight fleece, heavy duty zipper, looks good, and looks like something I paid a lot more for. He's even hanging on to this one and hasn't lost it yet! Highly recommend!11"
			},
			{
				"name": "DJL",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Cozy and warm! But sizing is kind of crazy.",
				"review": "It's soft, relatively light, and warm. I planned to use it as an under-layer on bike rides, but now find that it is also quite comfortable to wear while puttering around indoors.\n\nThe sizing makes no sense.  displayed \"large will fit you best\", but large was hopelessly long and baggy. The one I'm wearing in the picture is a medium size, which is comfortable but still a little too long for use with an outer shell-type bicycling jacket. I also purchased a small in a different color (forest green), but it is slightly tight in the stomach -- and still too long!\n\nThe camo colored one (medium size) is made in Vietnam. The forest green (small size) one is from Indonesia, and seems slightly less soft."
			},
			{
				"name": "Brandon",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Very good product",
				"review": "I’ve always been told that I’m cheap. I don’t think that’s a fair description, I just like to find the best bang for my buck… and I like to reuse paper towels lol. If you can find this fleece on sale like I did, buy it. It’s a really good find. I live in Maryland and it’s cold out right now. This fleece fits great and is keeping me warm. I’m also impressed with its comfort and zippered pockets. The pockets are really useful because they are deep pockets. So if you put your phone in one and forget to zip it up, you don’t have the feeling that anything will slip out of your pocket as you bend over to pick something up off the floor (like I do 300 times a day with my four y/o daughter)"
			},
			{
				"name": "WannabeTechie",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Could be a North Face or Patagonia",
				"review": "I'm 5' 9\" and 175 lbs. Got an XL b/c I like things a little loose. It does look a tad big on me but I would still get this over a L if you like loose clothing.\n\nOverall... great deal! This green/black look makes it look a little more unique than the other mono colors. If you were to slap a Patagonia or North Face logo on here, no one could ever know the difference. Warm and stylish."
			},
			{
				"name": "kcinAlaska",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Wow, Just Wow!",
				"review": "I ordered one of these jackets for my husband in late summer. He loved it and wore in right into cold weather. He loved it so much that he had me order two more! He can no longer wear them in our Alaska winter weather, but since we keep our house at 68 degrees in the winter, he now wears one around the house. They are just perfect in every way - fit, comfort, warmth and, most of all: affordability. Oh, he wished me to add that they have great pockets - the outside pockets zip shut, plus there are two inner pockets. How could I forget that - he has raved about the pockets. Thank you so much."
			},
			{
				"name": "samlanus",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " PERFECRT， but ...",
				"review": "12/07/2022 reviewed again: I bought two Large at the very first time.\nI am 5’7” tall.177lbs weight. It fits me perfectly. Three days after I receive them. I bought another one for myself again and two for my brothers. This  Essentials Polar fleece jacket is soft and warm. It’s thickness is medium, thick enough to keep me warm.. That’s why I would like to give 5 Stars Plus. I sewed the issue by myself.\nAmazon Essentially product lines are as reliable as just like Costco’s Kirkland brand. Love it.\n\nLarge size is perfect for me. I would like to give this fleece jacket 5 stars plus. Everything about the jacket is perfect. Very resonable price,very comfortable,very good quality... But the huge pockets inside have not sewn on purpose. I don't know why. The other brand of jackets with big pockets never have the issue like this.\nDon't put your cell phone inside the big pocket.\n\nSuggestion to Amazon: Please sew the pockets completely."
			},
			{
				"name": "Matthew Hall",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Excellent jacket, pleasantly exceeded expectations",
				"review": "I bought it excepting a regular jacket similar to Walmart quality but I was surprised because this  Essentials jacket seemed closer to the quality from stores in a mall. I only planned on buying one because I won't need jackets that often where I live but I believe I'll buy a 2nd one, if anything to have a spare. If anyone is on the fence about it being a basic Amazon brand, in my experience it's as good as name brand."
			},
			{
				"name": "JustAnotherName12",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " So close....",
				"review": "Long story short, this is the second fleece that I've bought over a couple of years. The first one that I purchased was in a regular size (not tall) and the fit was nice enough for me to wear holes in but the sleeves were a little on the short side. If I extended my arms out in front of me, the cuff of the sleeve would miss my wrist by about 4 inches. So with this purchase, I decided to account for that issue and I ordered a Tall size...now the cuff of the sleeves are like 5 inches too long. The rest of the fit is great, but the sleeve length needs to be dialed in a little better.\n\n(FYI, I'm only 6'1\" but I usually by Tall when ordering shirts)"
			},
			{
				"name": "✅ SteP ✅",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " ESSENTIAL NEL NOME MA NON DI FATTO - CALD, MORBIDO E PERFETTO PER IL FREDDO",
				"review": "🟥 🟧 🟨 🟩 🟦 🟪 🟫🟥 🟧 🟨\n🚫 TEST E CONSIDERAZIONI: 🚫\n🟥 🟧 🟨 🟩 🟦 🟪 🟫🟥 🟧 🟨\nFelpa acquistata a marzo 2019 e recensisco ora, maggio 2020, a distanza di oltre 1 anno, dopo averla indossata parecchio, specialmente per stare nei dintorni di casa, non essendo elegante, ma davvero molto molto calda e pratica.\n\nLe lampo con cordino permettono di allacciarla e slacciarla al volo, sono davvero toste, sia quella per la chiusura della felpa che quelle delle tasche, sono lampo con chiusura femminile, ovvero al contrario di quella maschile, per intenderci il cursore lo farete scorrere con la mano destra anzichè con quella sinistra come sono abituati gli uomini, ma poco male è questione di abitudine.\n\nLa felpa è in pile, molto comodo, caldo e soffice, tiene davvero caldo in inverno pieno anche con venticello moderato, ovviamente se il vento è consistente l'aria passa, non essendo fatta di materiali wind stop.\n\nRisulta discretamente traspirante, tanto da non mettersi sonovuoto quando la indossate.\n\nIo sono alto 175cm e peso circa 72Kg, ho preso la taglia S e mi calza alla perfezione, stretta ma non troppo, perfetta di maniche. Le tasche con cerniera sono comode e profonde. Non si tratta di un capo alla moda ma adatto a coloro che lavorano e che necessitano di un indumento caldo per l'inverno da mettere magari sotto la giacca per poi poterlo utilizzare da solo in caso la giornata si scaldi leggermente.\n\nSono totalmente soddisfatto, nonostante le finiture non precise anzi, tutt'altro, il proprio dovere lo fa egregiamente, tiene caldo e dopo 1 anno di lavaggi praticamente settimanali è ancora soffice e perfetto, difficile pretendere di più.\n\n🟥 🟧 🟨 🟩 🟦 🟪\n🔹 CONCLUSIONI:🔹\n🟥 🟧 🟨 🟩 🟦 🟪\nAl prezzo di 18 euro a marzo 2019 (attualmente 19,99 euro) è difficile pretendere di più da questo genere di indumenti, non di certo adatti a situazioni eleganti ma pià che altro a situazioni pratiche in cui l'efficacia passa in secondo piano rispetto alla bellezza dell'indumento. Diversi colori disponibili ma il camouflage verde è quello che mi ha colpito di più.\n\nInserisco qualche foto e vi ringrazio per la lettura\nStefano"
			},
			{
				"name": "Arthur R.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "2/5",
				"reviewTitle": " Zip",
				"review": "Sadly this product was disappointing considering all the positive reviews.\nFirstly the zip fastener stuck and I put it down to being new or perhaps because it was on the LHS, but after numerous tries I decided it was faulty.\nAlso the L size fitted my arms in length and was comfortable but the body was way too small. And that's the problem with buying stuff on line. One man's large is another man's small.\nIt was however lightweight and what I wanted but..................."
			},
			{
				"name": "🇮🇹 Schälflj 🇮🇹",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Apprezzabile comfort, calore e vestibilità, nonostante la economicità del capo",
				"review": "Mi piacciono le camicie e le giacche sportive a quadrettoni e quando ho notato questa giacca in pile della serie AMAZON ESSENTIALS, con delle caratteristiche in descrittiva che erano interessanti, ho deciso di acquistarla per utilizzarla in campagna nelle nostre zone collinari, anche durante le escursioni con i miei cani.\n\nLa giacca arriva in una busta trasparente perfettamente piegata e non appena rimosso il capo ho potuto subito constatare una apprezzabile QUALITA' complessiva della giacca tutto sommato discreta, pur sempre proporzionata alla caratteristica economica del prodotto.\n\nConsiderando che siamo infatti difronte ad una GIACCA in PILE di fascia economica e piuttosto sportiva, non mi è dispiaciuta la scelta del tessuto integralmente sintetico (100% poliestere) che sebbene si percepisce subito risulta comunque sufficientemente morbida e piacevole sulla pelle.\n\nApprezzabile ho trovato anche il suo CONFEZIONAMENTO sufficientemente curato ed attento ai particolari, come entrambe le TASCHE esterne con CHIUSURA a CERNIERA, la ampia TASCA INTERNA aperta e l’ELASTICO ai POLSINI, senza trascurare la CERNIERA LAMPO FRONTALE, che però presenta l’unico “difetto” di essere al contrario, ovvero al femminile, scelta che ammetto non ho compreso e che in alcune circostanze mi procura qualche rallentamento nella chiusura.\n\nA proposito della CERNIERA LAMPO, non si tratta di una marca nota YKK come indicato in alcune recensioni, ma in questa colorazione rosso-bisonte è una più economica che però svolge egregiamente il suo compito, con innesti sufficientemente precisi e scorrimenti fluidi in apertura come in chiusura, peccato solo per il montaggio al contrario a cui molti dovranno abituarsi.\n\nMi è piaciuta invece la tonalità del TESSUTO a QUADRETTONI rosso/blu dallo stile vagamente nord americano, con un PESO medio ed una sufficiente morbidezza, che mi ha piacevolmente sorpreso per il CALORE che garantisce, perfetto per la stagione fredda in arrivo.\n\nConsiderando inoltre la economicità di questo pile, trovo comunque gradevole il confezionamento della giacca, senza evidenti difetti e con quel colletto alto chiudibile con la cerniera lampo fin sotto il mento, per una linea complessiva piacevole che gli conferisce una certa personalità e carattere.\n\nIl TAGLIO è ovviamente sportivo ed indovinando la propria TAGLIA corretta, la VESTIBILITA' risulta comunque discreta.\nNeppure le MANICHE le ho trovate abbondanti in lunghezza come a volte accade ed avendo seguito le indicazioni in descrittiva ho scelto correttamente la M.\nSi tratta di una MISURA che per me che normalmente indosso giacche taglia 48 è risultata corretta, senza abbondanza ma una apprezzabile comodità, che mi permette di vestire il PILE con sotto anche una camicia, una polo o comunque un ulteriore capo.\n\nDopo aver considerato attentamente le misure indicate in descrittiva, come da altri evidenziato suggerisco di valutare di acquistare una TAGLIA IN MENO a quella che normalmente si è abituati a vestire, si tratta infatti di un capo che veste largo e non ho neppure riscontrato la vita stretta come segnalata nelle descrizioni.\n\nNel cercare di offrire dei riferimenti i più precisi possibili in relazione alle MISURE della TAGLIA M da me ordinata, se vado a misurare la giacca a riposo su un appendiabiti, i valori che posso confermare sono:\nTORACE (solo frontale) 54.5 cm, SPALLE 43 cm, VITA (solo frontale) 52 cm, MANICA 65 cm da fine spalla a polsino.\n\nLa giacca si indossare bene, non lega, non vincola nei movimenti, consentendo di vestire sotto ancora un ulteriore capo non troppo aderente come una camicia.\nIl capo infatti non stringe ne a vita come neppure sulle spalla e garantisce quel calore che potrà migliorare il comfort quotidiano durante i primi abbassamenti di temperature di fine autunno - inizio inverno, pur non essendo eccessivamente spesso.\n\nLe CUCITURE e quindi il confezionamento del tessuto, risultano discrete e sempre in linea con la tipologia sportiva/economica del capo, un pile che comunque non stona abbinato ad un paio di pantaloni sportivi, anche dei semplici jeans, per una abbigliamento molto informale e pratico che trovo apprezzabile nella nostra zona collinare di campagna, ma anche da utilizzare semplicemente in giardino o durante le escursioni con i nostri cani.\n\nNel complesso mi sento quindi di promuovere questa giacca della serie AMAZON ESSENTIALS, per le caratteristiche complessive del capo, acquistato a fine ottobre 2022 al PREZZO di 12.45 euro nella taglia M color ROSSO BISONTE, un costo che ritengo equilibrato.\nL'ultima verifica che andrà fatta è la reazione del tessuto dopo i primi lavaggi, ma è probabile che valuterò di acquistare altre colorazioni più classiche.\n\nIn quanto alla spedizione e consegna da parte di , sono state anche in questa circostanza efficienti e puntuali grazie al servizio Prime.\nMi auguro che questa recensione possa essere di aiuto e se avete dubbi o quesiti non esitate a chiedere."
			},
			{
				"name": "Mr D",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Less is more.",
				"review": "This may not be the best fleece jacket you will ever own, but it could well be the best value for money. Fleece is a fairly basic material that is reasonably warm, highly breathable and fairly light weight, compared to say wool. However it offers almost no protection against wind or rain so is best suited to being worn as a mid layer.\nThis jacket offers almost no frills e.g. no shoulder or elbow reinforced patches, no 2 way zip and not even a hem cord with cord locks. However most of these features merely add weight and cost and provide very little benefit in the real world.\nUltimately what really matters are decent materials, good quality construction and accurate sizing and happily this jacket is very good when it comes to these criteria.\nOverall this jacket provides good warmth, from a mid weight material, being around twice the weight of a micro fleece fabric. It fits me very well and the slightly elasticated cuffs and hem are sufficient to keep out any draughts. There are two hand warming outer pockets with zips and additionally 2 large inside “poacher” pockets big enough for a Ordnance Survey map but much more likely to be used for a hat or light weight windproof shirt/waterproof smock. The poacher pockets also provide a useful double layer of insulation, like wise the collar also has double thickness of material\nIf worn under a Goretex type jacket you may miraculously find that the jacket suddenly becomes far less leak prone. This is because around 99% of the moisture inside the jacket is not in fact rain coming in, but sweat that cannot get out, but can be managed very effectively by the fleece."
			},
			{
				"name": "B.M.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Good, with flaws",
				"review": "Other reviewers have complained about the zip on “wrong” side, but a more serious problem is that the 2 very useful inside pockets have slit holes in the bottom (maybe to allow MP3 headphones to be threaded through?) which makes them useless for keys, coins, smaller phones (my iPhone SE goes straight through). So you need an obliging lady with needle and thread to fix this first before you lose your stuff. Otherwise, an OK fleece, with two front zip pockets, rather loose fit on the chest, but good value for money."
			}
		]
	},
	{
		"id": "QpuQyN",
		"title": "Wrangler Authentics Men's Long Sleeve Quilted Lined Flannel Shirt Jacket with Hood",
		"imageUrl": "https://m.media-amazon.com/images/I/813Dgg2DflL._AC_UY445_.jpg",
		"price": "$30.99",
		"description": "Perfect for the cold winter days, the Wrangler authentic big and tall long sleeve quilted lined flannel shirt jacket with hood features quilted body interior, 2 side pockets and a brushed flannel exterior. The jacket offers a cotton blend hood offering more warmth and comfort, making this jacket a go to item for any man this winter.",
		"totalReviewCount": "20,178 global ratings",
		"averageStarRating": "4.6/5",
		"reviews": [
			{
				"name": "Kirsten",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " It's a button up",
				"review": "Got this as a gift for my boyfriend and it fits perfect and is good quality! Although, I didn't realize or pay attention to if this was a zip up jacket or button up but this jacket is a button up one. Super light weight and he wears it all the time and likes it."
			},
			{
				"name": "Sonia",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Light as a windbreaker!",
				"review": "This jacket is really light, very similar to a windbreaker. Love the style, it’s a button up jacket with a hoodie. Will definitely use when it’s a little cool, more of a 70 degree jacket, not a 60 degree weather jacket."
			},
			{
				"name": "Kimberly Chamblin",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great flannel not too hot just right",
				"review": "What a great shirt it's very well made soft and comfortable. Everything then some you would expect out of a great quality shirt. Very happy with this purchase"
			},
			{
				"name": "Litlmarn74",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Keeps you warm my son loves it.",
				"review": "Flannels seem to be back in and this was a hit with my almost 20 yr old. Nice quality and warm when you don’t want a heavy coat."
			},
			{
				"name": "Audrey Olson",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " GREAT FLANNEL",
				"review": "My son loved the fit, feel and style of this flannel with a hood. I really liked the color of it. He has been wearing it daily to and forth to the gym. Good price."
			},
			{
				"name": "Tiffany",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " PERFECT",
				"review": "My husband absolutely loves this wrangler jacket. It is lightweight but it keeps him warm and it’s very comfortable. The hood is a plus and it’s true to size."
			},
			{
				"name": "Sandra",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Christmas present",
				"review": "Bought as a Christmas present for my son. He loved the colors the fit. He said that it wasn’t to light or to heavy."
			},
			{
				"name": "TEBY",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " A little different type of material",
				"review": "The material is different. It feels like more of a poly blend than 100% cotton. I guess it's for less shrinkage after drying."
			},
			{
				"name": "Ganie",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Warm and great fit.",
				"review": "Medium size is perfect for me (5'-8\", 165lbs). The outer material is great and feels really good. The inside lining is warm enough for quick errands in this winter weather. Really nice color. Does not bleed during washing. 4-star rating is due to getting a bit deformed after the first wash. I think the outside material shrinked a little bit but the inside lining remained the same. Ironing could probably fix it but I am still not quite happy about it. But overall quality and fit is great."
			},
			{
				"name": "christopher gallagher",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Three Stars",
				"review": "very little padding in the quilting"
			},
			{
				"name": "hdamoca",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Nice but huge. I mean HUGE.",
				"review": "I bought this for my husband for Christmas. He's not a big guy but I figured it's , often clothes are way smaller than Canadian or US made clothes, so I went up 2 sizes. Wish I hadn't as the 2X is about 3 sizes too big. I sent the shirt back and reordered an Xlarge, it's still humungous, arms hanging past his fingertips. I worried that going down to a large would be too small after washing, so I kept the bigger size and hope it shrinks some. So, buy the size you'd buy in stores, don't size up or you'll be returning one too."
			},
			{
				"name": "Maya B.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great product",
				"review": "My husband requested one of these for his ritualistic campfire every Saturday night to keep warm during the Canadian Autumn days. He received it and was well pleased. It was the right fit, perfect fit even, and was very comfortable. Mind you, my husband weighs about 210 lbs and is about 5'10\". It's only been one day, so I'll make sure to change my review if ever we find snags or issues with this jacket."
			},
			{
				"name": "Steve Bogdon",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " I like it but....",
				"review": "I like it. That said I read the reviews and there were lots of people mentioning this should have a zipper rather than the buttons. I ordered it thinking the buttons would be fine, I was wrong.\n\nI still like this coat and wear it often but with the style, fit, and fabric weight.....a zipper would have been a nice feature.\n\nI would still order it again with the buttons but would order faster with a zipper."
			}
		]
	},
	{
		"id": "ctlWJz",
		"title": "Carhartt Men's Loose Fit Midweight Logo Sleeve Graphic Sweatshirt",
		"imageUrl": "https://m.media-amazon.com/images/I/81JtsX1NmHL._AC_UY550_.jpg",
		"price": "$54.98",
		"description": "Product Details\nFabric Type\n100% Cotton\nCare Instructions\nMachine Wash\nOrigin\nImported\nClosure Type\nPull On\nAbout this Item\nOriginal fit\nAttached three-piece hood with draw-cord closure\nFront hand warmer pockets\nStretchable, spandex-reinforced rib-knit cuffs and waistband\nCarhartt signature logo printed on left sleeve\nLoose Fit t-shirts are cut larger with a roomier fit in the chest and shoulders\nDescription\n\nThis men's hooded sweatshirt offers easy-wearing warmth for cold days on the job. Cotton blend fabric and triple-stitched seams give it Carhartt's legendary comfort and durability.\n\nSee more\nAbout this Item",
		"totalReviewCount": "46,442 global ratings",
		"averageStarRating": "4.8/5",
		"reviews": [
			{
				"name": "Ocean Blue",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " QUALITY HOODIE - Great fit !!",
				"review": "This is a GREAT HOODIE !!! Many of the photos in the reviews scared me with the stitching torn out of the sleeves & being marked as irregulars. It may be some retailers are pushing fake Carhartt merchandise or irregular merchandise. BUT, BUT, BUT I ordered mine from  fulfillment & carefully examined it when I received it. Mine was PERFECT !!! Even though I purchased the midweight hoodie, this is a fairly heavyweight hoodie. It seems to be sized one size different from the actual size - that is, I ordered an XL and it is almost perfectly the same size as my other XXL hoodies when I lay them overtop each other. This is EXACTLY what I expected & I ordered accordingly. So, the fit for me was PERFECT !!! (I am 5'9\" & 190 lbs). Also, I know this hoodie is a 50/50 cotton blend which normally wouldn't shrink, but I washed it with warm water & medium dryer heat & it shrunk just a tiny bit, but I was really hoping it would. The material seemed to just \"tighten-up\" a bit after washing - just enough when it came out of the dryer it was the same size as my all cotton XXL hoodies that I washed it with. Great hoodie - I highly recommend it - I also highly recommend that you order from Amazon Fullfillment."
			},
			{
				"name": "M. Dunn",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Good gift",
				"review": "I bought this for my husband for Christmas. He put it on and it was a good fit. As usual with Carhart, the fabric seems durable and warm. The color was as pictured. Win Win!"
			},
			{
				"name": "Marti Liles",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Perfect",
				"review": "I bought this hoodie as a Christmas gift for my hard to fit son. He loves the way it fits. Very happy with the comfort and sturdiness of this hoodie."
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " The wear is great on this product. Keeps it's shape and takes a beating",
				"review": "Love it. I really like the hood. It's great to just pull up when your out and it becomes windy. The product hold up well and washes with no problems."
			},
			{
				"name": "Jesus Dominguez",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Quality that meats brand expectations",
				"review": "This was a gift for my son and hi is loving it. Soft but durable, think but also flexible enought to use any time anywhere."
			},
			{
				"name": "Rowanmother",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Son is 6’4” and it comes down to his mid lower hip.",
				"review": "He loves it. Being as tall as he is, all hoodies sit on his waist, he prefers it longer. This one is perfect. He’s very happy with the fit and the length."
			},
			{
				"name": "G. Johnson",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great Sweatshirt!",
				"review": "This sweatshirt is thicker than most other sweatshirts I've owned. It is very warm. I'm 6'4\" 230 lbs and a Large Tall size fits great. Love it and will buy again in the future."
			},
			{
				"name": "Jennifer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Fit great",
				"review": "Fit really good, the only thing would be my husband has short arms so the sleeves were a little long but that’s not because of the size of the sweatshirt"
			},
			{
				"name": "layda2",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Beware of seller!!",
				"review": "I like Carhartt hoodies & have a few of them, but just my luck to purchase one which is faulty, as you can see the hood doesn’t fit in the middle & eventually flaps about on my left shoulder & looks stupid, albeit my daughter thinks it looks ‘quirky’, well sorry it’s faulty!! No problem I thought, I would be able to send it back & get a refund as normal being a regular buyer on , but no, because it was shipped from Germany the seller insisted I sent it back to them which would have been a right rigmarole for me as I’m disabled & used to Amazon Prime’s service where Hermes collect items from my home if I need to send anything back to Amazon. Beware of sellers from abroad if you’re sent faulty items as you could end up with hassle & risks sending stuff back. Grrr!!!"
			},
			{
				"name": "Evan Daniels",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " A Waste of £50",
				"review": "I personally think that the Carhartt brand is just a rip off. In no way is this garment of any special quality. The hood is a single layer of material and the drawstrings are just shoe laces (yes, with those plastic seals on the ends) I cannot think of how this is justifiable at all, in fact it's lazy. The logo on the sleave is not stitching it's that rubber glue melted onto the fabric, and to top it off I can litterally feel the edges of the pockets coming loose so I wouldnt carry anything heavy in there or put the weight of your hands inside them.\nAnd I wouldnt get it in XL because its more like XXXXL."
			},
			{
				"name": "SG",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Nice !",
				"review": "Good quality sweatshirt.\nBeware that this line is ‘proper’ sizing. Most clothing brands these days seem to run small and I have to wear XL chest sizes, the Large size on this is actually a tad on the large size!"
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great and comfy hoodie.",
				"review": "Read many online reviews before buying this product. Seems to be recommended by many as a comfortable and durable hoodie. I can't say they are wrong. At this price it is definatley a long term investment, but judging by the quality it will last a long time. Great for cozy winter evenings at home or being outdoors. The fit is definatley a loose fit but not overly huge like others claim. I'm 5'7 with an athletic build and the hoodie is roomy (I bought a medium) . I would go a size down if you are looking for a more snug fit."
			},
			{
				"name": "Kindle Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " perfect as expected",
				"review": "Bought one of these while holidaying in Canada and decided to get a spare when I arrived back in the UK and am happy to report this is an identical product not some dodgy copy. This product is made of a hard wearing material more suitable for working clothes than leisure. I have found it perfect for summer wear on a quad bike. It maybe be slightly higher price than the usual hoody but you are paying for a quality product."
			}
		]
	},
	{
		"id": "B4F_8u",
		"title": "Men's Waterproof Ski Jacket Snowboarding Windbreaker Warm Winter Hooded Mountain Snow Coat",
		"imageUrl": "https://m.media-amazon.com/images/I/61xOODpMt9L._AC_UX342_.jpg",
		"price": "$39.99",
		"description": "Product Details\nFabric Type\n100% Polyester\nCare Instructions\nHand Wash Only\nOrigin\nImported\nAbout this Item\n【Waterproof and Windproof】 Clothing is windproof and waterproof, which can resist bad rainy days or foggy days, so that you can stay dry and comfortable outdoors.\n【Humanized design】The sleeve can be adjusted, the glove hole can be retractable, which helps to keep the heat. At the same time, the hood can be removed, which can be adjusted according to your actual needs.\n【Multi-zipper pocket】 suitable for storing mobile phone, wallet, etc.\n【Anti-scratch&Wear Resistant】The shell is made of polyester material, which reduces the risk of accidental injury and prevents you from being cut by rocks and branches.\n【Best use】Alpine skiing, snowboarding, snow sports and other winter outdoor sports.\nSee more\nAbout this Item",
		"totalReviewCount": "1,065 global ratings",
		"averageStarRating": "4.6/5",
		"reviews": [
			{
				"name": "pat2407",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Excellent Product!",
				"review": "My wife and I are headed from Phoenix to NYC for our first trip to see our son who moved there in April. You may imagine that, living in the desert, we don't have a wealth of cold weather clothes and I was in dire need of a good warm coat.\nThis looked like it would fit the bill and the price was great, so I took the plunge. Wow, am I ever pleasantly surprised!! This is a 'mid-weight' coat (think Mama bear), but once I had it on, there was no doubt it was going to do the job.\nThe lining is very comfortable and undoubtedly warm. The construction is sturdy and the zipper is industrial class. The warmer pockets are roomy, the hood (lined with the same 'fur' as the jacket) is very comfortable and has draw strings to make it snug in the wind. Additionally, the hood zips off if you don't happen to need it at the moment.\nI can't tell yet if it's wind proof and water resistant as the manufacturer claims, but given that the rest of the description is 'on target', my guess is that it will be.\nI usually wear a large, but the comments led me to believe I should step down a size which I did. They were right. I ordered a medium and there's still enough room for bundling up inside the coat.\nBottom line....a really well made, great, comfortable coat for a great price!"
			},
			{
				"name": "DLD322",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Amazing!",
				"review": "I was sceptical of ordering this for husband because I didn't want to end up with a strange light grey color - something that doesn't look like ad. I was also concerned that the jacket would be flimsy like a windbreaker and/or cheap looking fabric. So glad I took a chance! The color is even better than expected, in different lighting color almost looks like a very light tan as you can see from my second photo I compared it to a medium shade of grey t-shirt. Fabric is so nice, it took 15 minutes to steam out the wrinkles from packaging, jacket is very well constructed, medium to heavy weight with the fur lining inside arms too. Love that hood is removable and cuffs are adjustable. Ordered an X- large for 190pounds, 5'10\" as he has long torso and will want to wear sweatshirts underneath for extra warmth, fit is perfect! Fantastic quality, price and shipping was less than 2 days. So very happy I chose the right jacket, you won't be disappointed!"
			},
			{
				"name": "Patty Tee",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Fits Perfect",
				"review": "I am super impressed with this jacket. At first I was skeptical since the jacket arrived in a box and the box felt super light. Upon opening the box, the jacket wasn't bulky but layered perfectly enough to keep me extremely warm. The quality and style of the jacket can be best compared to that of the Columbia brand jackets. I ordered an XXL (I'm 6'2 265 pounds) and it fits plentiful with room to layer up underneath it. (I think am XL would've fit me fine as well). Upon first two times wearing the jacket, it left a bunch of fuzzies on my shirt but after that it was fine. I love the jacket and I will be buying another color for a backup jacket"
			},
			{
				"name": "Keshia",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " warmth",
				"review": "I bought this coat for my hubby because we had to attend a funeral in Ohio this past December (2022) & we were coming from the Hampton Roads area of Virginia where the weather is considered BIPOLAR. Unfortunately, we didn't need the coat & I returned it because his uncle gave him over 5 coats in excellent condition; some still had tags on them. However, he did try it on & he liked it; but didn't need it anymore."
			},
			{
				"name": "Mommyd484",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great gift",
				"review": "This is great quality at an amazing price! My husband kept refusing to get a coat and I figured I would give this one a try for him! I gave it to him for his birthday and he said it was his favorite gift!"
			},
			{
				"name": "Lulu",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Handsome warm mens coat",
				"review": "This coat was the biggest bargain of all my shopping. It's just as stated very warn and made for skiing weather. It's also so light weight you wouldn't think it could\nBe so warm. The price of this coat is a fantastic buy!"
			},
			{
				"name": "Robyn",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great for the price!",
				"review": "Bought this coat for my son- he usually wears a M but we got a L so he could layer under it. It doesn’t really fit as big as we expected. But it’s a great fit. He did mention yesterday that he thinks it’s weird that the lining isn’t in the sleeves only in the body of the jacket."
			},
			{
				"name": "Russ",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " The fit",
				"review": "Never have bought a jacket online without trying it on 1st I've bought 3 of these jackets this month alone and all 3 of you are per"
			}
		]
	},
	{
		"id": "6Mv1NS",
		"title": "Levi's Men's Trucker Jacket",
		"imageUrl": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/71NLhtuespL._AC_UX342_.jpg",
		"price": "$39.97",
		"description": "Product Details\nFabric Type\n100% Cotton\nCare Instructions\nMachine Wash\nOrigin\nImported\nAbout this Item\nSits at waist\nLoose through seat and thigh\nStraight leg\nThe model in the image is 6' 4\" and is wearing Medium.\nDescription\n\nThe original jean jacket since 1967. A symbol of self-expression for decades, and a great starting point for customization. Gets better over time from natural wear with fading, stains and holes.\n\nSee more\nAbout this Item",
		"totalReviewCount": "17,305 global ratings",
		"averageStarRating": "4.6/5",
		"reviews": [
			{
				"name": "johnnyjohnny",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " AS GOOD AS YOU'D EXPECT",
				"review": "so, like, who hasn't had one of these Levi's trucker jackets, and doesn't know how great they are. just amazing.\nbut for years now i've been seeing thick denim work or Western shirts, which i bought, but started thinking how great one of these jackets would look used as a shirt. especially one of the already distressed ones. so after about 5 years of thinking this, i got one just for that purpose.\ni normally wear an XL in these jackets when using them as a jacket, but as a shirt i went down a size and it's perfect...better fitting than most of my shirts prior to washing/shrinking them. i got the distressed black, so it's a bit more 'shirt'like. i have to say if anyone is considering doing this i highly recommend it. it does give you a bit of the Elvis '68 Special look, which is never a bad thing, except of course this is not leather. but it does have the thickness and so it's very similar to that look. i wear mine a la The Kind, with the collar turned up, and like how the bottom sits just below the beltline on my...you guessed it, Levi's bootcut jeans.\nso, you may already know how cool these jax are as jax, but not you can wear them all the time, even when no jacket is needed....as a shirt. one of the pleasures in life."
			},
			{
				"name": "Drew Rummel",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Exactly how a jean jacket is supposed to be",
				"review": "Love it. Blast from the past. I grew up wearing these in the 80s. They're still pretty much the typical classic jean jacket and are exactly how they are supposed to be. Fit and feel exactly as they should. Unless you're a youngster or just have unrealistic expectations theres nothing to complain about with these. They are what they are."
			},
			{
				"name": "RGB",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Best yesterday and today",
				"review": "50 years ago levi trucker jackets were the very best in style, material and craftsmanship. Today it still is. I have two jackets. 1 sized to wear over sweaters etc and another over Ts and lightweight shirts. I highly recommend. I'm 69 yo and could change brands but the others are just not like a Levi. My sizes are 3x & 2x. The 100% cotton version is only version for me. Not stretchy. My chosen sizes are room enough and movement is zero problems. Final thought, the cotton weight is medium to light heavy. Perfect feel for durability proven wear for work or just because you look so good in an authentic Levi trucker jacket."
			},
			{
				"name": "Mattea Williams",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Perfect",
				"review": "I wanted a normal length Jean jacket, and it’s hard to find when you are a taller female. I actually have a female Levi’s trucker jacket and it looks cropped on me. Apparently it still looks good but it’s not what I was going for. BUT THIS is perfect. It’s slightly oversized on me but but loose enough I can comfortably wear a hoody under it. I’m ecstatic. This also appears to be authentic Levi’s, if anyone is worried about getting knock offs off . I will made and comfortable.\n\nJust in case it doesn’t show for some reason, I got a large. 5’10 female approximately 200lbs, fit."
			},
			{
				"name": "Chloe",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great",
				"review": "I got this as a gift for my bf and he loves it, I looks great on him. I recommend"
			},
			{
				"name": "L. Underwood",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Husband loved it!",
				"review": "Fit as I had hoped it would for my husband who wears XXL shirts. He is happy enough with this jacket to replace his well worn old one."
			},
			{
				"name": "W Harvey",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great Jacket",
				"review": "I was really worried about ordering this jacket because of all the reviews, but this jacket is perfect. The fit is perfect (you don’t have order a size up) and the jacket looks great! Just like the one I had in high school!"
			},
			{
				"name": "Shawny Alan",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Good wear, comfortable and cant beat the price",
				"review": "Very comfortable fits just right, I played it safe and picked Large, I would normally pick Medium but I want extra room in case I want to layer shirts or t-shirt. I like the hoodie style and the arms have that sweatshirt stretch feel.\n\n-Just in case go a size up if you think jacket will be tight, For reference I compared it to my normal levi's medium denim, and this hoodie version feels much more comfortable, from eyeing both they look the same size, minus the hood on this one I bought.\n\nI am 5'6 male with medium build.\n\ntag says made in china\n\nno issues with delivery\n\nI already know which levi's i'll buy next."
			},
			{
				"name": "Robert Evans",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Levi Trucker 2 Jacket",
				"review": "Absolutely love this jacket. The fit is as expected and has two deep inside pockets.\nThe denim is rigid and of very high quality - unfortunately rigid 501 jeans in the UK are titled classic/vintage and cost upwards of £130.00. I therefore order mind direct from the USA - Rocky Mountain Connection in Colorado offer excellent service."
			},
			{
				"name": "Garry",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " I need the return address",
				"review": "Too big!"
			},
			{
				"name": "mike",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great looking hoodie",
				"review": "As expected from Levi a great looking hybrid that attracts attention and comments\nfantastic idea"
			},
			{
				"name": "Sky",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " The Original white Levi",
				"review": "Happy with the jacket Bot Happy to have to pay import duty of 25%!!!"
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Reliable servivce",
				"review": "Exactly what I wanted"
			}
		]
	},
	{
		"id": "OC8zOJ",
		"title": "MOERDENG Men's Waterproof Ski Jacket Warm Winter Snow Coat Mountain Windbreaker Hooded Raincoat",
		"imageUrl": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/51aqP+WdDyL._AC_UY445_.jpg",
		"price": "$40.99",
		"description": "Product Details\nFabric Type\n100% Polyester\nCare Instructions\nHand Wash Only\nAbout this Item\nWaterproof Windproof Snow Ski Jacket, also can fights bad rainy or misty weather, Keep your body always dry and comfortable when you are outside.\nAdjustable cuffs help to seal and keep warm, and the inner wear-resistant soft shell is highly wind-resistant.\nProfessional water repellent coated, fluff lining and durable fabric guarantees the best heat retention, Relaxed-fit style with quick-dry material.\nMultipurpose：Downhill Skiing, Snowboarding, Snowsports and other winter outdoor sports.\nSize notes: Jacket offers a standard fit. Please choose by US size.\nSee more\nAbout this Item",
		"totalReviewCount": "20,513 global ratings",
		"averageStarRating": "4.6/5",
		"reviews": [
			{
				"name": "JavaInMyCup",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Retains Body Heat!",
				"review": "Pros:\n1) This jacket is great at trapping your body heat! Great for Fall and Winter.\n2) Looks good\n3) Fits\n4) Good casual wear for regular outings\n5) Good at blocking wind.\n\nCons:\n1) The textile used to make the zippers are indeed delicate. Will tear if you're brutish with it otherwise it's okay. It's about 1 tier below regular zippers we're all used to.\n2) Can tear if you're wearing this jacket for high activity outings like skiing etc.\n3) The first few minutes after donning the jacket and stepping outside may be a bit chilly (winter season) until you warm it up with your body heat. Like I said it's great at trapping heat.\n\nPro tip: After measuring the size to fit; buy 1 size larger. I had to return my first jacket b/c it fits too damn well; exposing the shape of my beer belly. My second one was 1 size larger (still fits) and that is where I gave it my 5 stars. And no you don't see my tummy."
			},
			{
				"name": "Natnat",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Perfect gift for my frequent skier, live in mountain's brother.",
				"review": "I bought is as a Christmas gift. My sister and brother in law live in the Sierras and are on the slopes every chance they get. I was concerned about the size (as I always am). He loved it! It fit perfectly as stated and has a sleek look. It is also lined and has pockets and waterproof. Tested on the slopes and lives up as described. I got it at a good price. In fact, I ordered a womens for my sister."
			},
			{
				"name": "MattyTao",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Did not expect how good this ski jacket was 😂",
				"review": "Loved how warm it was! I brought this to Vancouver with me while it was snowing and it has kept me warm the WHOLE TIME. Def something I will keep on me for a while and don’t have plans to return this at all. Espeically for such a good deal from a brand I didn’t know of. I would highly recommend it again and again for someone lookin for a ski jacket without hurting to much in the bank. They’re an honest brand and I would recommend again!"
			},
			{
				"name": "Max",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Looks Great and Feels Nice on the Inside",
				"review": "I purchased this mainly as a snowboarding jacket because of the waterproofing abilities and the great deal! I've been eyeballing this jacket for a while and when I saw it go on sale I pulled the trigger and I'm glad I did. It's nice and cozy on the inside and the outside performs as intended in the snow/cold. This will definitely be used off the slopes as well"
			},
			{
				"name": "Enid",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Look great. Fits very well",
				"review": "These look great and fit perfectly. My son used these for a ski trip to Canada and was in love. These kept him very warm and were lightweight enough for him to do many activities. Totally waterproof. He wore these with thermals and snow bibs did not need anything else. It was around 17F."
			},
			{
				"name": "Laura G",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Perfect for deep sea fishing.",
				"review": "I bought this for my husband. He went deep sea fishing and his last waterproof jacket was not so waterproof. This one fit great, kept him warm and dry, and is super easy to clean. Plus he can use it for snow trips too. Would recommend."
			},
			{
				"name": "Nelda R.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Super Warm",
				"review": "This jacket has been the best jacket I have ever worn. I did not feel the cold going to my chest nor anywhere on my torso area on a 10 degrees weather. It was windy as well and I did not feel any of it. I had two shirts on and these jacket. I bought two more for my kids."
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great",
				"review": "Used for my recent travel to Colorado. Use while exploring the Rocky Mountains with temperatures of -1*F and it did the job. I use a long sleeve shirt under it, and i never had a problem with te temperature. Warm enough also light. Very good product. I recomend it."
			},
			{
				"name": "Owen",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "2/5",
				"reviewTitle": " Zip broke within 2 days of wear",
				"review": "This was bought for my son's skiing trip and the side pocket zip broke on day 2. I am now struggling to find out how I can return this as it was bought more than 30 days ago, but believe I should be able to return for a full refund. Anyone know who to contact?"
			},
			{
				"name": "Philippe Lamontagne",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " very hapy with it",
				"review": "definitly surprised at the quality\n\nthe people who complain about the pocket sippers must be gorillas...\n\nvery nice quality for the price\n\nbeen abusing it in quebec winter ( ice fishing , fat biking, ski etc ) and i dont have anything negative to say\n\nits light and thin so perfect for winter sports but also very warm\n\nvery happy\nthe sizing was perfect. i am 5’8 very wide shoulders and just like all my other jackets i went for XL and its perfect fit"
			},
			{
				"name": "Dana Bellagamba",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Perfect winter jacket",
				"review": "This jacket fits great. It looks great and is warm. Very good quality and at a great price point. The sizing chart is true to size. My husband is 6’1 and weighs 230lbs. The XL fits perfectly."
			},
			{
				"name": "Certified reviews",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "2/5",
				"reviewTitle": " Oversized | Not warm | Heavy | Defective",
				"review": "I am giving it two stars as I liked the color, style, and vacuum packing of the jacket. Apart from it, there was nothing good about it. The size is not as per the chart. It is oversized, It is not warm at all. maybe for +8 C, it is ok. The inner lining of the jacket was defective in terms of threading and a big tear on the side.\n\nIt was not for me. Not satisfied with the product as per the price of it"
			},
			{
				"name": "darren tierney",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Perfect jacket for the price",
				"review": "After looking on  for a couple hours at jackets, I was frustrated with the so so reviews. I went into an Atmosphere store and looked at jackets only to be shocked by seeing $300 price tags… in the clearance section. So I gave Amazon another go and landed on this jacket.\n\nI’ve been really happy with it. It’s warm. Size was great (XL for a 6’6” 220lb guy). I’m not sure how long it will last but so far this winter I’ve worn it a lot and there’s no big signs of wear or breaking. Really happy with this jacket considering it’s price and it’s competitors prices."
			}
		]
	},
	{
		"id": "-iMBBL",
		"title": "Weatherproof Midweight Soft Shell Jackets for Men - Men’s Water Resistant Windbreaker with Stand Collar (S-3XL)",
		"imageUrl": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/81ATEgfkzNL._AC_UX342_.jpg",
		"price": "$52.50",
		"description": "Product description",
		"totalReviewCount": "2,529 global ratings",
		"averageStarRating": "4.6/5",
		"reviews": [
			{
				"name": "Martin",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Quality Jacket",
				"review": "I ordered the Large and it fits perfectly. I like how you can adjust the cuffs to help keep cold air from getting in at your wrists. The bottom of the jacket can be adjusted as well so you have a snug fit around your waist. Jacket is very comfortable to wear."
			},
			{
				"name": "Karen",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Nice jacket.",
				"review": "Mostly purchase Under Armor, Banana Republic and JCrew, husband is very happy with this jacket. Looks good and seems to be good quality. 88"
			},
			{
				"name": "TiredMama",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Best jacket he ever had!",
				"review": "Got this for my brother as a gift. He says it’s the best jacket he’s ever had. Fabric is thick and quality. Fit and shape are flattering. Plenty of pockets."
			},
			{
				"name": "MATT NADLER",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Well made",
				"review": "I bought this weatherproof jacket to wear when I'm dragon boat paddling in Seattle on cold nights. Then I found that wearing multiple layers of a variety of thicknesses was more than satisfactory to keep me warm. The jacket is too bulky to wear under a life jacket. I'm now wearing it as a midweight good looking jacket instead...not for paddling."
			},
			{
				"name": "Cedric R. Brown",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " The Jacket I wanted",
				"review": "This jacket has all of the qualities that I wanted in a jacket. It stops water and the wind. It is light enough were I feel very comfortable wearing it. I like it and you will too."
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Comfortable fit",
				"review": "The jacket is comfortable and I would have given it 5 stars but it came with loose threads in the inside pocket making it awkward"
			},
			{
				"name": "Lawrence J. Laffer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Nice jacket",
				"review": "Had the same jacket before. This one is nearly the same. Good all purpose jacket."
			},
			{
				"name": "Wendy Ruano",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Cómoda",
				"review": "Es muy cómoda y talla perfecto. Su material es suave y resistente. Es algo pesada."
			}
		]
	},
	{
		"id": "-RfKEA",
		"title": "Wrangler Authentics Men's Long Sleeve Quilted Lined Flannel Shirt Jacket with Hood",
		"imageUrl": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/61J2YWfGrXL._AC_UX342_.jpg",
		"price": "$30.93",
		"description": "Product Details\nFabric Type\nHeather,Flannel\nOrigin\nImported\nAbout this Item\nRELAXED FIT. Constructed with comfort in mind, this long sleeve quilted lined flannel shirt is a wardrobe essential for those cold Winter nights.\nHEAVYWEIGHT MATERIALS. Built with button cuffs and quilted polyester padding for more durability and added warmth.\nFOR ADDED WARMTH. Padded with diamond black quilted polyester to create extra warmth while also creating breathability, this is an extremely versatile flannel shirt.\nFUNCTIONAL STYLE. Lined with 100% cotton, this brushed flannel is made with style in mind. Wear it on the job or out to lunch, this essential closet staple can be worn for many occasions.\nADDED STORAGE: Constructed with (2) dual front chest pockets and (2) side seam pockets, this flannel has easy-access storage for all your basic necessities.\nDescription\n\nPerfect for the cold winter days, the Wrangler authentic big and tall long sleeve quilted lined flannel shirt jacket with hood features quilted body interior, 2 side pockets and a brushed flannel exterior. The jacket offers a cotton blend hood offering more warmth and comfort, making this jacket a go to item for any man this winter.\n\nSee more\nAbout this Item",
		"totalReviewCount": "11,840 global ratings",
		"averageStarRating": "4.6/5",
		"reviews": [
			{
				"name": "cargru",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Comfortable, warm and stylish!",
				"review": "Bought this a Christmas present for my husband and he absolutely loves it! For starters, he's always loved wearing flannels, so this jacket is like an upgraded flannel since it's lined and warm. The hood is definitely a nice add-on. Definitely great value for the price. Super happy with my purchase and hubs is happy with his gift!"
			},
			{
				"name": "Paige",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " So nice for the price",
				"review": "I bought this for my husband for Christmas and he loved it, much nicer than I expected. Definitely worth it."
			},
			{
				"name": "M. Elaine Murphy",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " My Husband Loves This Jacket",
				"review": "My husband, who got this for Christmas this year, has hardly taken it off since he got it."
			},
			{
				"name": "Pamela Yarborough",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Nice looking casual jacket.",
				"review": "Bought this for my husband and he loves it. I love it on him, too. It fits well and is lightweight and comfortable."
			},
			{
				"name": "Joel Ostmo",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " A little big",
				"review": "I usually wear a large but reviews said to go up a size. Just get the size you normally wear. Other than that’s it’s a very nice coat."
			},
			{
				"name": "cindy s",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Fits great",
				"review": "She loves it, doesn't want to take it off"
			},
			{
				"name": "Winters Run",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Good Insulator on Those Frosty Mornings",
				"review": "Perfect before the hard winds and sub-zero temps of winter set in. Finally a quilted flannel shirt that fits well and keeps you warm before its time to break out the heavy coats. Good quality and workmanship."
			},
			{
				"name": "Dave Reksnis",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Great purchase",
				"review": "It’s a great hoodie! Fits good and is comfortable! We are happy with it ."
			},
			{
				"name": "Bradford Christian",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " I'm impressed with it. It's warm.",
				"review": "Quality is great. Inner lining is great. Color is great (I got blue).\n\nIt fits a little large on me. Some reviews said it fit a bit small. (Especially on the other Wrangler one like this with no hood)... I was worried I was going to have to get an XL. I got a large and it's a bit huge on me. No worries because I'm currently bulking up. (I'm 6ft tall and 210lbs) However, it makes me wonder how much shrinking I can expect from washing it. Normally I'm about 170 lbs and probably would've still taken a chance on Large... but apparently I would've been swimming in it. Even as it stands, it makes me look like I'm almost 300lbs because it's quite big.\n\nI also wondered (based on another review) if the color would be faded... but the blue is nice and vibrant.\n\nIt's a LOT more like a jacket than a regular hoodie. Partly due to the sort of quilted inner lining, partly due to how big and warm and cozy it is I guess. If it's around 0 degrees I can get away with just this plus t-shirt under, no REAL winter jacket/coat.\n\nLike some other options out there, the design for this one could've probably benefited from an inner zipper and then the buttons... and of course some dudes would prefer snaps instead of buttons.\n\nLady loves it. I'm impressed with it. It's warm. Pockets are useful."
			},
			{
				"name": "Merardo Garcia Gonzalez",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Chamarra Ligera, amplia y muy cálida.",
				"review": "Ligera, Caliente, Ideal para utilizar por debajo de la misma algún suéter, playera o similar, buena manufactura, botones resistentes y bien fijos, ojales de buen tamaño, bolsas amplias, gorro muy calientito y amplio.\n\nEs la primer prenda de esta marca que compro y quede muy satisfecho con mi compra, me gustó su color y lo ligera y abrigadora que resulta ser.\n\nEn mi caso soy talla XL, me gusta andar holgado y no muy justo de talla, de igual forma pudiera haber sido la talla L pero no me quejo, en realidad muy satisfecho con la calidad del producto en relación a su costo, entrega en 1 solo día y si problema.\n\nAmpliamente recomendable."
			},
			{
				"name": "Telnets",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " not a shirt",
				"review": "Id never wear this as a \"shirt\".. but as a light spring/fall jacket i would. Its got a quilted material liner, and the material is decently thick. Its heavier then a shirt, but lighter then a jacket.. It also fits slightly large, maybe by an inch more then i expected, but thats okay if wearing a shirt under it."
			},
			{
				"name": "Eric the great",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Was as expected. Happy for the price.",
				"review": "I would describe this as a light outer jacket. Costco sells a similar product if you’ve ever seen it you should know what to expect here. Fit me well, i sized myself as I would usually for clothing and went for a small. I’m male 5’5 and 130lbs I’m happy with how it fits.\n\nThe hood I would say is it’s weak point. Kind of an odd shape and the material was a little light there. Nice that is had that feature at all though honestly. I got this to wear at work and in that environment it won’t last forever (nothing would) and I would buy it again."
			},
			{
				"name": "Bruce Yamamoto",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Very lightweight and comfortable",
				"review": "It’s lightweight and comfortable to wear during spring, fall or around the house. I usually wear XL but I bought 2XL because I thought it would shrink after I washed it.\n\nIt didn’t shrink as much as I expected and it’s still about the same size, but the hood is HUGE. It’s so big that I can easily wear it over my bike helmet. LOL"
			}
		]
	},
	{
		"id": "whWxDh",
		"title": "London Fog Men's Auburn Zip-Front Golf Jacket (Regular & Big-Tall Sizes)",
		"imageUrl": "https://m.media-amazon.com/images/I/71oZCnwm8NL._AC_UX385_.jpg",
		"price": "$23.47",
		"description": "Product Details\nFabric Type\n92% Polyester, 8% Nylon\nCare Instructions\nMachine Wash\nOrigin\nImported\nAbout this Item\nLightweight zip-front jacket lined in mesh and featuring double-entry hand pockets\nLong sleeves with adjustable snap cuffs\nDescription\n\nAuburn zip-front golf jacket ( regular & Big-Tall sizes )",
		"totalReviewCount": "12,990 global ratings",
		"averageStarRating": "4.5/5",
		"reviews": [
			{
				"name": "Jeffrey A. Moon",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " My favorite light jacket!",
				"review": "Loved this so much I bought four more in various colors. Very well tailored!!! Nice soft fabric. Quality stitching and zippers. I can tell these will last. Plenty of non conspicuous pockets. Repels light rain. I’m 5’10” and weigh 165 pounds. Slim build with somewhat broad shoulders, long torso and arms. The medium gives me a perfect, leaning towards roomy fit in the chest area. Perfect length at waist and arms. Make sure it has the London Fog label as one of mine was a different jacket.  corrected that quickly and the other four I purchased were correct. If interested in the yellow, the pics are confusing showing it as bright yellow and another pic shows more of a light beige color. Mine was a very nice pale yellow. The pink is very pale as well. I don’t normally wear much pink but this very pale pink is nice. Doesn’t scream PINK. Also have the black, green and beige matching the display pictures. Excellent price for such quality."
			},
			{
				"name": "John S",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Tall sizes are great",
				"review": "Ended up trying a regular XL on a 7 day trial and then purchased the XL Tall. I’m 6’5, so like most regular XLs this jacket was too short in length and in the arms. Probably fits someone else great but not me. Luckily with the XL tall size, this jacket fit perfectly.\n\nIt seems to be great in the fall and as an over coat with a hoodie underneath in the winter. It’s a nice windbreaker material but keeps you warm. Will definitely getting my moneys worth with this one and will be buying this jacket in different colors."
			},
			{
				"name": "A photographer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Excellent light jacket",
				"review": "In my area it's only really cold a few days of the year. While I own several coats and jackets that keep me warm during those few times, they are too warm the rest of the time. I needed something light, something to keep off a chill while holding off the wind and the occasional light mist. Enter two great choices: The London Fog Auburn Jacket and the Weatherproof Classic Golf Jacket. Both jackets were available from  at reduced prices so I bought both. The bottom line is I like both and I'm keeping both. Both are similar and both are winners. My advice is to buy based on color and cost because you can't really lose.\n\nThe Weatherproof Classic Golf Jacket differs from the Auburn Jacket by having knit cuffs and bottom edge. The Auburn Jacket has elastic in the bottom edge and the cuffs snap closed. I have no preference either way. The outer fabric of both is microfiber polyester (whatever happened to poly/cotton twill, I wonder). Both feel like the same weight and look like they could have been cut from the same bolts of cloth except for the colors. The liners are a little different with the Weatherproof being slightly heavier but in no way bulky or thick. The Auburn has a lighter feeling fabric inside. Again, I have no preference either way. Fit-wise they are very much alike. The Weatherproof is a little longer in the body than the Auburn when the Auburn is bought in standard sizes. Personally, I probably should have gotten the tall size of the Auburn but reviews indicated the Auburns sleeves are a bit too long and tall sizes usually have even longer sleeves. I'm almost exactly six feet tall with a long torso so I can usually go either standard or tall without either seeming off. I ordered the Auburn in standard length and it's okay but just a tad short. However, I wouldn't want the sleeves to be any longer. The Weatherproof fits me perfectly in length and the sleeves are okay too--not as long as those on the Auburn. I ordered XXL in both jackets and I cannot detect any difference in the fit around the chest or waist. They're roomy enough in my case for wearing a heavy sweater if need be. I've worn them with thick sweatshirts but nothing heavier.\n\nI've worn both jackets in 45F weather but not in the rain. Both cut the wind well. I don't expect either to be waterproof like my Eddie Bauer rain parka. Probably fine for a light mist or a quick shower. What I find so great about these jackets is that they're comfortable over a wide range of temperatures. I can wear one while driving without having to deal with the bulk of a heavier coat and I can wear it indoors for extended periods without feeling overheated. Even on cold days, I usually only need a jacket for those times I'm outdoors between buildings or from the car to a building. I only need a really warm coat when I'm outside for more than a few minutes.\n\nWhich to buy? Both are great. I have a tan London Fog Auburn and a light blue Weatherproof Classic Golf. Both colors will coordinate and match with other colors fine. The London Fog has more color choices here on Amazon so that might be a factor. My decision was made based on price. At the time I bought both jackets, the prices were at a low point and both jackets were bargains.\n\nEDIT 01/18/2019:\n\nI've worn both these jackets for a while now and I have to give the edge to the London Fog. That's based on a couple of things about the Weatherproof that wasn't evident at first. Mainly it has to do with the knit cuffs on the Weatherproof. In a very short time, they are beginning to pill on the right side of my jacket. I'm not sure this speaks well for the quality of the fabric for the longterm. Another thing I did not notice early on is that the cuffs on the Weatherproof do not match. The left cuff's knit is different from the right. This might explain the pilling of the right cuff. However, I admit I like the way the knit cuffs fit compared to the snap cuffs of the London Fog. On the London Fog, the cuffs feel either too tight or too loose, depending on which snap I use."
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Little to short",
				"review": "The overall fit was wonderful! Sleeves long enough, chest good, BUT, just wish it was about 2 inches longer in length. For a TALL, it was a little to short. But we will keep it, because it always seems we can’t find things quite long enough. Great fabric."
			},
			{
				"name": "Alessar",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Dapper lightweight jacket for the plus size man",
				"review": "I'm at a size where it's quite difficult to find men's big and tall that fits me well. Often the proportions are bad or the size is not a good fit because there's so much a regularity in what a 2x means for people and brands. I was very happy with this jacket I had been looking for a lightweight jacket I could layer with a hoodie or where during the transitional fall weeks. It very much met my expectations and I've received compliments on how nice it looks. London Fog has come through with a good quality classic item here."
			},
			{
				"name": "Patricia Holmes",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " London fog 3x jacket",
				"review": "This jacket is wrinkly and the zipper is sticking when pulling it down hence the four stars. If u don’t like this don’t buy it."
			},
			{
				"name": "Omar",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Great budget purchase!",
				"review": "This was on sale when i purchased it. I didnt have a bomber jacket and this fit the bill!\n\nIt is a nice quality, and not too thick. So, it can be worn on cooler days as well."
			},
			{
				"name": "brett miller",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " awesome jacket",
				"review": "This jacket is an awesome jacket. way better than i thought especially for the price. its soft texture on outer and inner shell is the first thing i noticed. it looks cool not like something a kook would put on. it has a designer fashion with nice lines and cutout features. i like the collar it gives it a professional look unlike others that dont have a collar. im going to order up to 3x big because i go baggy for more comfort the 2 x is a tad tight for my taste. all in all i would recommend not wasting time and just buy it if you want a jacket that covers all your needs except maybe rain or ice cold weather its good for going out and looking sharp in."
			},
			{
				"name": "kronos4ever",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Smart, comfy, roomy. Lovely jacket.",
				"review": "Generous sizing means the XL fits my 44 chest and 6’3” frame perfectly. A very smart looking jacket that feels good quality. 5/5"
			},
			{
				"name": "Freda",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Perfect fit",
				"review": "Very smart and good quality"
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " A lot bigger than expected",
				"review": "I bought a medium sized jacket. On paper it’s the right size but this seems huge."
			},
			{
				"name": "William Savage.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Not what l expected.",
				"review": "When l recieved this jacket it was in a plastic bag and the jacket had so many creases in it l could not believe the condition of the jacket,very disappointed with this."
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Avoid",
				"review": "The jacket arrived with a seized Zip and was badly creased. The zip broke when tugged really hard and I had to throw the jacket out. Avoid London Fog"
			}
		]
	},
	{
		"id": "e5X9ac",
		"title": "CRYSULLY Men's Military Tactical Sport Warm Fleece Hooded Outdoor Adventure Jacket Coats",
		"imageUrl": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/71K8HZe0-bL._AC_UX342_.jpg",
		"price": "$43.98",
		"description": "Product Details\nFabric Type\nPolyester\nAbout this Item\nNOTE: This jacket zip is on the left side.\nMaterial: Polyester\nDouble zipper, long sleeve with thumb-hole, fleece hoodie\nMulti Pockets: Military tactical design, total 7 pockets. 2 large pockets in front, 2 pockets in back, 2 small pockets in left sleeve and 1 small pocket in right sleeve.\nSuit Occasion: Ideal for outdoor active, Hiking, Camping, Fishing, Hunting, Climbing, Cycling and other outdoor sports.",
		"totalReviewCount": "4,824 global ratings",
		"averageStarRating": "4.3/5",
		"reviews": [
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Good fleece with only a couple fo quirks",
				"review": "I bought one to try as I wear allot of this style outerwear and my current inventory is getting fairly old/worn. I'd say fit and finish is excellent on the jacket received. It's warm, blocks wind well and fit true to sizing for the most part (I ordered XL as I usually wear). the extra pockets take some getting used to but do come in handy.\nI only have two minor grips:\n1) The zipper pull is on the left side as is common with woman's clothing. I knew this going in as it's clearly advertised but it doesn't make it any less annoying every time I put the garment on/off.\n2) The arms are 2-3' too long and I believe they are designed that way given the have thumb slots so you can wear them down over your hands somewhat. (This also seems like a woman's clothing feature.) It's not bad but it is noticeable.\nAll in all, I had hoped to order a couple of more of these to keep around but those two minor issues will keep me shopping for another brand."
			},
			{
				"name": "todd",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Ok but weird",
				"review": "I was pleasantly surprised buy the material weight. Good heavy dense fleece. It fit ok, good for spring fall. It's not a winter jacket (unless you live somewhere where it doesn't get cold). No surprise there.\n\nNow for the rest:\nArms are long\nThe thumb hole things are really small, not really useful... but are they really anyway?\nZipper on the left side?\nHood..not sure what the intent was but its big, and odd shaped, like it was supposed to fit over helmet or something.\nI don't understand the visor feature, it's floppy, and makes a great sail that pulls the hood back when it's windy.\n\nI don't hate it, I bought it for an inner layer so it works good for that. If You're looking for something marginal, at a decent price this is it.\nIf you want some great quality with great features..maybe this isn't it"
			},
			{
				"name": "Kelsey Quinn",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Order a size Up",
				"review": "I purchased this as a gift for my son and it looked good to me on him, but he felt it was too snug. I did agree that the sleeves were a bit short. He actually wanted to go two sizes up, which we did and he likes the loose fit but I think it’s too big. So I would say go one size up. He really likes it and it is a good looking jacket."
			},
			{
				"name": "Richard A Lefler",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Excellent product!",
				"review": "This is my favorite buy of 2022! I love this product, just got it but I could not be happier! This is warm and comfortable and perfect for chilly early mornings! Love the deep front pockets, the sleeve pockets and the pocket in the back! For the original price this is a major win! For the discounted price, I’ll be stealing another one in a different color! If you’re considering this and need something warmer than an average fleece, this is it! Runs, slightly big in medium but this is my new go to fleece!"
			},
			{
				"name": "Dennis",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Nice jacket",
				"review": "Just got mine in after a long wait. Everything seems well made, the jacket is very comfortable. Am very dissapointed that I need to return mine,I ordered a 2 XL and it fits like a 3 XL. Be sure to order one size under you normal size. The jackets are 100% polyester so they will not shrink upon washing"
			},
			{
				"name": "Chris Casey",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Good value for price",
				"review": "Solid product for price. Thought it would be a little heavier but it is warm. It is better than what some departments stores sell at double the price. Good work coat."
			},
			{
				"name": "JeffinNM",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " + & - of this jacket",
				"review": "Gave one to each of my sons for Christmas. They liked all the pockets, style, and material. I was expecting a loose fit, but the jackets run a bit small on both of them. Still deciding whether to keep or order a larger size."
			},
			{
				"name": "JB",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Good jacket",
				"review": "The jacket is warm and comfortable. I don`t like the left side zip. It`s not a deal breaker though, just take some getting use to. I would recommend."
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Garbage",
				"review": "Total fraud, this is a liner from a 3 in 1 system, really thin and pockets are in useless places. Don’t waste your time or money on this, it’s worth about $2 maximum."
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great outdoor hoodie",
				"review": "It fits well an anatomically correct man, but if your head is small, have narrow shoulders and short arms it's probably not for you. I like the design, the arm pockets have room for a pack of smokes, lighter, phone, compass etc. The back pocket can hold an emergency kit or whatever. It provides good head, cheek and neck protection. Thick and warm enough on chilly days."
			},
			{
				"name": "dave raymond paquette",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Cut is not designed for North Americans",
				"review": "The size is far to be small to be a size of XXL. The back is ok but the arms are tiny on these. Arms cut like they were from a large not for an XXL."
			},
			{
				"name": "Fernando",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Incredibly warm",
				"review": "Love how warm it keeps you, wearing it currently for work but I, personally overheat so quickly in this that I have to strip it off. Fantastic overall, will probably order another colour for casual wear. Large fits like an XL so if you want a tighter fit, step down a size."
			},
			{
				"name": "Kindle Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Better than expected!",
				"review": "Nice jacket. Fleece is a reasonable weight. Fit is a bit small for the size. If you like close fir, size works out. Only issue is no hood string to close up in wind. Easy fix as the channel is already in the hood, so some paracord and a couple of spring stays (eclipses?) and alls well."
			}
		]
	},
	{
		"id": "eSQy0-",
		"title": "Columbia Men's Granite Mountain Fleece Jacket",
		"imageUrl": "https://m.media-amazon.com/images/I/71pQfI+ZFpL._AC_UX342_.jpg",
		"price": "$34.96",
		"description": "Product Details\nFabric Type\n100% Polyester\nOrigin\nImported\nAbout this Item\n100% polyester.\nMockneck collar.\nTwo Zip Close Front Hand Pockets\nDrawstring Adjustable Lower Body\nImported.\nDescription\n\nThe next generation of a Columbia classic, this outdoor staple features a finely tuned fit and a soft-yet-rugged filament-fleece fabrication to keep you warm when temperatures plummet. Stay protected from the elements in the Granite Mountain Fleece. Made from MTR fleece, this jacket is as lightweight, warm, and durable as it is soft. The elastic at the wrists will block out the wind, and you can stow essentials in the secure pocket. It's perfect for an evening around the fire, a weekend out at the cabin, or an early morning hike. With a modern classic fit, the Columbia Men's Granite Mountain 2.0 Full Zip Fleece Jacket will keep you warm in style this season.\n\nSee more\nAbout this Item",
		"totalReviewCount": "3,176 global ratings",
		"averageStarRating": "4.6/5",
		"reviews": [
			{
				"name": "SWW",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Light Weight Jacket",
				"review": "Light weight, good for days that start out a little cool or for layering when you don’t quite need the full blown winter gear. True to size meaning most shirts I wear an XL and that’s the size I got and the fit is perfect."
			},
			{
				"name": "cindylsnyder",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great quality.",
				"review": "Love the quality. My husband has worn his old one every morning for over 15 years and was getting worn. So happy to see him in a new one. He loves it. So cozy and warm."
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Comfortable",
				"review": "So comfortable ! Thick but lightweight...keeps me warm even when it's only 57 degrees outside"
			},
			{
				"name": "Grammy",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Warm and nice looking.",
				"review": "This jacket has a quality look about it with a warm thick fleece fabric.\nIt’s definitely worth the price."
			},
			{
				"name": "Kala Mavity",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great jacket.",
				"review": "Great jacket. Very soft. Runs a little large but overall fits pretty true to size."
			},
			{
				"name": "Julie B",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Comfortable and warm",
				"review": "I got this for my son and it is very soft and warm and washes well in the machine"
			},
			{
				"name": "Alejandro Rocha",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " If you’re 5ft 6in, M is a little large",
				"review": "M is a bit large on me."
			},
			{
				"name": "Dan",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Perfect",
				"review": "It’s a great jacket. For the cool days or as layer to go along with my winter coat. I have a 44 1/2 in chest with a 37” waist. Great fit. Not tight or loose. I ordered a large."
			},
			{
				"name": "Riggs",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " BUEN PRODUCTO",
				"review": "No le he dado el uso rudo para el que esta hecha, pero en el día a día es un producto muy resistente. Y cumple sin dudas el objetivo de proteger del frío."
			},
			{
				"name": "R Morggendorffer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Cumple 99% mis expectativas. Me encanta!",
				"review": "Es calientita y ligera. Tela de buen grosor. El único detalle es que viene ligeramente grande, la compre para alguien talla M, pero no fue motivo para cambiarla."
			},
			{
				"name": "Stephane Plante",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Bien. Bonne qualité.",
				"review": "Rien à redire. Satisfait."
			},
			{
				"name": "Cliente de ",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Esta muy bonita",
				"review": "Buen material"
			},
			{
				"name": "Francisco M.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " excelente producto",
				"review": "solo que es mas gris que negra"
			}
		]
	},
	{
		"id": "Mg5GA6",
		"title": "Columbia Men's Watertight Ii Jacket",
		"imageUrl": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/6142UY8xXeS._AC_UX342_.jpg",
		"price": "$33.62",
		"description": "Top-notch rain protection — this waterproof-breathable, fully seam-sealed jacket will keep you nice and dry, even in the heaviest of rains. An essential waterproof jacket that packs versatile protection in a variety of stylish color options. What’s more, it's lined with a fine mesh lining for extra comfort in dreary weather. This lightweight jacket is so comfortable, it acts as an everyday insulated windbreaker and rain jacket. It features an adjustable hood, zippered hand pockets, a drawcord adjustable hem. You'll be comfortable and dry in this off-weather coat. Offered in several stylish colors and sizes. Available in extended sizing. Regular Fit. To ensure the size you choose is right, utilize our sizing chart and the following measurement instructions: For the sleeves, start at the center back of your neck and measure across the shoulder and down to the sleeve. If you come up with a partial number, round up to the next even number. For the chest, measure at the fullest part of the chest, under the armpits and over the shoulder blades, keeping the tape measure firm and level.",
		"totalReviewCount": "23,888 global ratings",
		"averageStarRating": "4.7/5",
		"reviews": [
			{
				"name": "Ty.H",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Good coat -  not helpful with exchange",
				"review": "This jacket arrived as described. I ordered the charcoal color and it appeared to be genuine and well made. Unfortunately I didn’t get to test it. I ordered a size up based on the  suggestion, but when it arrived it was too big and it fit over my normal winter coat with room to spare. When I tried to exchange it, even though it is a product shipped and sold by Amazon, the price changed by more than $30 and Amazon wouldn’t help beyond offering a $10 credit - which would mean I was still going to have to spend $20 more than what I initially spent.\n\nOverall, the jacket seems really nice and I’m going to miss not having it probably. But Amazon customer service has been less than good for a while now and this is just another example."
			},
			{
				"name": "Amanda",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great jacket-good quality",
				"review": "Got this in just in time for the California rains. As another person commented, this is a great fit for us plus size women who don’t have many options in the way of jackets and Columbia has limited plus sizes for women. This is really intended as just a rain jacket/wind breaker- not thick enough to provide much warmth (but that’s not the intention). Adjustable hood with cords that are designed in a loop so they don’t pull out. Zipper and Velcro closure provides double protection. Velcro wrist closures allow to be tightened at the wrist. Great color options. Ordered the 4x which gives some room for thicker shirts underneath."
			},
			{
				"name": "Halloween",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " A little loose but no big deal",
				"review": "I need a light rain jacket and came across this one. The size large was on sale for half the price and large is what I wear. Arrived on time and what can I say but I love it! It has a cinch at the bottom of the coat which is good. It’s just a tad too long for my liking but it worked out. The cuffs have Velcro and the zipper has a flap with Velcro down it."
			},
			{
				"name": "Heather",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Nice Jacket",
				"review": "Bought this as a gift on Black Friday. It was on sale for about 80.00. But I guess the size made a difference on the price. I bought a men’s 4xl for my female friend who is a bit busty. Perfect fit. She normally wears about a 3xl in men’s so these do seem to run slightly smaller sized as compared to other products. Great rain jacket. Columbia has always provided durable products in my experience."
			},
			{
				"name": "Nettie",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great quality in hard to find red.",
				"review": "This jacket is really nice. It's difficult to find red jackets. It's absolutely beautiful. It's just loose enough that you can comfortably wear normal clothes under it and be able to move around without restriction. The length goes to the upper thigh. I highly recommend this jacket & plan to buy several more in different colors & sizes for family members. It's very well made & appears that it will last for years without falling apart."
			},
			{
				"name": "Teal Sheath",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " 2nd one",
				"review": "I bought one of these on a whim at a sporting good store 10 years ago… It ended up being my favorite jacket, literally until it’s worn out a few weeks ago. This new one is perfect, it’s almost an exact duplicate, except the logo is printed on instead of embroidered, so that kind of sucks, but otherwise, I love this jacket, and it is legitimately fully waterproof, and you can stuff it anywhere."
			},
			{
				"name": "Joe Average",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Just exactly what I was looking for",
				"review": "Right size b/c I wanted to size it large enough to go over my hoodie. Not too long so in heavy ran, my bum or legs will probably get rain soaked. However perfect for errands or a a quick walk."
			},
			{
				"name": "hypercore HC",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " 5 stars but PAY ATTENTION!",
				"review": "It's a great rainproof jacket HOWEVER it is a FAKE brand, it is not ACTUAL Columbia. Avoid any sharp objects at all costs! It's easy to rip. But comfy and does great job though!"
			},
			{
				"name": "Sammy",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Good waterproof but not breathable",
				"review": "Very smart jacket, very waterproof, nice lining, so close to being perfect. Unfortunately it isn't very breathable and it doesn't have pit zips so you end up getting very damp and sweaty, as a waterproof jackets job is to keep you dry I find it to be counter productive. If you were doing a low intensity stroll (around the shops or walking with young children) then it is perfectly fine. I have kept it as a backup jacket.\nThe Columbia evaPOURation jacket is far better than the Watertight II as it is breathable and has pit zips, but it does lack the comfortable mesh lining."
			},
			{
				"name": "Fraoch",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great jacket",
				"review": "Bought as a gift, recipient delighted with fit and performance has been tested to the max in the recent inclement weather conditions, would def recommend."
			},
			{
				"name": "Just a Guy",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Couterfeit jacket",
				"review": "This is not the proper Columbia jacket. Despite the images showing it should be..\n\nThe logos on the chest and arms are cheap prints and not the correct styling. The hood is twice the size it should be and the general fit is way off."
			},
			{
				"name": "David Bilney",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great fit",
				"review": "Took a while to arrive but a great fit"
			},
			{
				"name": "Coral Grimes",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Plus-size women: Read this review",
				"review": "One of the frustrating things about being an active plus-size woman, particularly one that carries a substantial amount of weight in the chest or belly, is the near-total lack of high-quality technical gear available for purchase. Most companies assume that if you’re overweight, you must not go outside in inclement weather, and most certainly not to *gasp* exercise! As many plus-size people out there know, many of us do both, and many of us are committed to improving or restoring our health, be it from weight-gain due serious injury or illness, or from simply choosing a healthier path in life. (Both happen to apply in my case.)\n\nThe problem as a woman, however, is the extremely limited range of plus sizes in high-quality technical gear. Columbia is one of the only brands to have plus-sizes at all, but even theirs only go up to a 3X for women. And, unfortunately, their 3X is more like a 1X-2X in other plus-size brands like Penningtons. That leaves women over 240 lbs out in the cold (literally and figuratively).\n\nHowever, plus-size women, there is hope. I ordered this Columbia men’s plus-size jacket in 4X and it was the equivalent of a women’s 4X at Penningtons. Just as important (and rather surprising): the sleeves are not excessively long like most men’s jackets. They’re only slightly too long for my arms (about an inch) which is easily dealt with by using the Velcro straps.\n\nThe rest of the jacket is equally well-proportioned. While it doesn’t hug the hips in a feminine way, it’s not bulky or pouchy in other areas, and easily passes as a unisex or women’s jacket in my opinion.\n\nAs expected from Columbia, the jacket materials are superb. The jacket is very lightweight, waterproof, breathable, and exceptionally comfortable. It’s infinitely more comfortable and higher-quality than any of the plus-size department store-brands I tried, and it’s about 40% less expensive.\n\nHighly recommend to anyone who is plus-size and desires excellent outdoor gear."
			}
		]
	},
	{
		"id": "_7vqYa",
		"title": "Carhartt Men's Big & Tall Loose Fit Firm Duck Insulated Flannel-Lined Active Jacket",
		"imageUrl": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/91qg2qv0AzL._AC_UX342_.jpg",
		"price": "$105.75",
		"description": "When old man winter and mother nature get all riled up, reach for Carhartt duck active jacket it can handle what this fearsome twosome dishes out. Proudly made in the USA, it's warm, versatile, and rugged. 12-ounce, firm-hand, 100 percent ring spun cotton duck. quilted-flannel lining in body, quilted-nylon lining in sleeves. attached quilted -flannel-lined hood with draw cord closure. two inside pockets. two large lower-front pockets. rib-knit cuffs and waistband. triple-stitched main seams for durability. back length: large regular: 29 inches; large tall: 31 inches. made in the USA",
		"totalReviewCount": "18,979 global ratings",
		"averageStarRating": "4.7/5",
		"reviews": [
			{
				"name": "BigDawg0814",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Never go wrong with Carhartt",
				"review": "It was bitterly cold -20 degrees(temp with wind chill) and wind blowing. The wind did not go through the coat. From my body heat I kept warm in this weather(upper body portion). Definitely worth getting. But the only thing bad to say is the hood sits or lays when hood is down it does not lay comfortably it feels like it is still up but it could be because of being new and not broke in(same way with the whole coat is like this) but definitely not a deal breaker."
			},
			{
				"name": "Victoria M.Gentilcore",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Excellent purchase for a gift",
				"review": "Have purchased this specific jacket in the past (5 years or more) for my son. He Loved this jacket so much, wanted another in black. Carhartt is the best jacket for young men. Durable, stays dry and warm. I like the jacket with the hood, which I know he will wear the hood if it's real cold. Excellent purchase for this product."
			},
			{
				"name": "jeff borrall",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Warm coat",
				"review": "I bought this coat for a winter coat and it great in cold south dakota conditions. I'll go outside on break my legs and hands will be cold but my upper body feels like I'm not even outside. Love this coat.\nI don't think you can beat this coat for the price point. Always wanted a carhartt jacket and love it. I can't say enough good things about this coat.\nI'm 6 ft 3 and about 205 lbs and got myself a xl tall.\nIf your debating getting one buy it you won't regret it"
			},
			{
				"name": "hassam cordova",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Fit",
				"review": "The material is rough on the outside, soft on the inside and it’s pretty well stitched.\nIt keeps you warm in the cold and it’s spacious to move around in (specially if you’re working). It looks great for work and to go out in casually. I use it for both home and work daily. It fits big, so what ever size you choose think almost* a size up. I chose the XL and it fits like an XXL (almost)"
			},
			{
				"name": "LUIS EDUARDO FLORES ELVIS",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " La mejor inversión que e podido hacer y me volví fanático a esa marca",
				"review": "La chaqueta si realiza su función contra el frío lo único que los puños puños de la chaqueta y el porde de abajo son muy flexibles para mí gusto un poco más grueso pero de verdad apartando todo me gustó o me gusta mucho la chaqueta"
			},
			{
				"name": "Landon Piard",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Super worm, great quality, comfortable",
				"review": "I’m pretty small so naturally it’s kinda big on me but honestly I don’t mind at all. It being oversized let’s me layer underneath it on a super cold day. The quality is great too, it’s the type of coat you can fall asleep in in a warm car. The color makes me feel like a bear"
			},
			{
				"name": "Kaylinb92",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Husband approved",
				"review": "My husband loves this jacket! He has had the same carhartt jacket for the last 10 years. So it was time for a new one. He is 6’3 and has a hard time finding things long enough for his torso. He loves that this one is long enough and made for someone with some height!"
			},
			{
				"name": "Manuela Ortiz",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Carhartt Coat",
				"review": "My second time getting this coat for my husband. We are in nyc and it can get really cold. Business owners and always outdoors, this coat is extremely warm and comfortable to have on all day!"
			},
			{
				"name": "Brad",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " ***Sizing information****",
				"review": "When on the Carhartt website I out in my height and weight and it said I needed a 2xl.\nI ordered a 2xl and a 1xl big & tall\n\n6 foot tall and 280lbs\n\nThe 1xl big & tall fit me better. It was still big enough to he able to have a t shirt and a hoodie underneath. The big & tall is 2inch longer in the length which I like more.\nThe 2xl did fit but I felt it was big. When I grabbed the jacket in the middle of my chest and pulled out there was 5 to 6 inches of extra room. The sleaves felt really baggy and it was barely at waist height.\n\nIf your unsure about sizing order both and see. The 1xl b&t was slimmer fitting while being a little longer as I'm 6'.\nThe 2xl felt too big and boxy. More suited for a bigger dude who's sorter then myself."
			},
			{
				"name": "Brandon",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Sizing Info",
				"review": "So to start, I was looking for a winter/fall\nJacket that would be used on milder weather days during the winter and late fall months ( around +5C to -10C). I already have a proper winter jacket but it dosent make sense to wear a jacket that’s rated up to -30C on days where it’s -5C outside as it would be overkill in my opinion. I saw great reviews on YouTube and  for Carhartt and at first I bought an XXL because I wanted a little extra room (I’m a size XL) to be able to layer up if necessary however this jacket (and it does NOT mentioned on the tag in the pictures put up on Amazon) was a “Loose Fit”! As a result, the jacket felt more like a 3XL or 4XL. I ended up exchanging it for an XL “Loose fit” which fit more like a XXL because I wanted the extra room but I’m certain that if I got a large it would have been form fitting. All in all, I love it! It’s a little stiff but as it breaks in, I’m sure this thing will feel more like a sweater than a jacket which is dangerous because I’ll run the risk of wearing it all the time haha. Otherwise it’s a good buy in my opinion but I don’t think that it will be as protecting against the cold on a day where it’s -30C outside."
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " This what you want",
				"review": "This is my first Carhartt jacket and now I understand the popularity. This is built with an almost mythical quality I have not seen since vintage gems like a 50’s Harris Tweed. Mind you this is no fancy-mans jacket. Tough as nails you actually feel protected. The zipper is HEAVY duty. I’m 5’10” 170 lbs and the medium is perfect. It is loose as said but I wear a sweater. Temps right now are about -15c/ 5F. The hood seems built for wearing a hat or helmet under for sure—it’s shallower then I like but it warm and cozy. It’s pretty much everything people say it is, and it’s made in the USA which is great by me being Canadian. If you think you don’t want one, you are just wrong! I think it’s very well priced for the quality."
			},
			{
				"name": "Mathieu",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Superbe veste",
				"review": "Veste très confortable, relativement chaude, je peux la porter seule jusqu'a des températures avoisinant les -5 celcius, autrement je mets un cotton ouatté en dessous et j'ai été confortable jusqu'aux -25C.\nDétail important, la veste servait à aller pelter et aller au travail, donc mon temps à l'extérieur sans activitée était limité, je ne l'ai pas porté pour de longues heures.\nLe tissus est très résistant.\nJe porte normalement des chanfails 5xl, j'ai fait de même pour la veste malgré les recommendations de prendre une taille plus petit. En terme de longueur de la veste et des manches le \"fit\" est parfait, en terme de taille, tour de taille, diamètre des bras, c'est un peu grand, mais me permet facilement de porter une à deux couches additionnelles en dessous me permettant d'affronter les températures plus basses sans problèmes.\n\nLes 2 seuls points négatif que j'ai pu noter\n1-) manque de souplesse dans le capuchon, il tiens vraiment haut sur les épaules et me gêne la vue en conduisant\n2-) le matériel utilisé bien que résistant attire les poils et cheveux comme un aimant, je dois passer la brosse tout les jours dessus avant de quitter. J'ai 2 chats et le manteau est rangé sur des crochets aux murs.\n\nAutrement superbe produit, j'espère qu'il me durera des années car je l'adore."
			},
			{
				"name": "Devo",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Just size down",
				"review": "I usually get a extra large but I purchased a large and fits perfectly. I’m 5foot8 inch tall and 250 pounds with a slight beer belly. Seems to be the real deal and not a fake. Label says made in the USA. I paid 135 Canadian. With is a great deal. Better than paying 205 at marks for the exact same jacket."
			}
		]
	},
	{
		"id": "CpeYKY",
		"title": "MAGCOMSEN Men's Winter Coats Waterproof Ski Snow Jacket Warm Fleece Jacket Parka Raincoats with Multi-Pockets",
		"imageUrl": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/81g0yoiDLjL._AC_UX342_.jpg",
		"price": "$61.98",
		"description": "Product description",
		"totalReviewCount": "4,380 global ratings",
		"averageStarRating": "4.5/5",
		"reviews": [
			{
				"name": "Mitch",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Well worth the money.",
				"review": "Super warm. Warer resistant for sure. Looks just as shown in the pictures and sizing is pretty spot on. Most reviews around my hieght purchased mediums for the same weight bracket 150 lbs. I bought a large. Im 5'9\" @ 150 lbs. I like a slightly loose fit to my coats and this didn't disappoint. Length puts it just below my belt line. Shoulders have a little extra room, but not too much. Sleeves don't have fleece lining, but they are lined well and keep your arms warm wearing nothing more than a t-shirt under it. Sleeve length is great as well. Not short, not long. Hood is fleece lined. Left handed zipper. Its an amazing buy for anyone looking for a nice, warm, and comfortable winter coat. Don't hesitate to buy if you need an inexpensive coat without losing visual appearance. Sizing is pretty on point."
			},
			{
				"name": "Patrick H.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Fits Perfectly!!!",
				"review": "Purchased the XL in the cobalt blue/black combination and it's perfect. Fits like a glove. Noticed immediately how important the fleece lining is to keeping warm. Hood is nice and a with a little room for a ski hat or any hat. The Velcro strap keeps the hood in place under my chin. I love it! 👍🏻👍🏻"
			},
			{
				"name": "jon stolpe",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " SO WARM !!!!!",
				"review": "This coat is SO RAD, It looks good but even better than that it works awesome, I stay so warm in this thing. If you need a good winter coat don't even think twice, get this thing you'll be very very happy with what you get."
			},
			{
				"name": "muhammad nuredeen",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Perfect for Chicago winters 2023",
				"review": "Just in time for Chicago winter and heavy winds. Was able to be outside in -7 degree weather for 20 min and felt good. As a 6ft male 205lbs I got a large and still have room for a smaller fall coat underneath for better warmth.\nLove it."
			},
			{
				"name": "Kevin B.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Warm and perfect fit!",
				"review": "I ordered this for a trip to Steamboat where the avg temp was 20F and it was perfect. I’m 6’3 225 and the XXL was a great fit over long underwear and a turtleneck. Add some gloves and face covering and this jacket will keep you cozy!!"
			},
			{
				"name": "Nancy Snow",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " MAGCOMSEN MEN'S WINTER COAT",
				"review": "Very nice jacket, stylish, plenty of pockets, and will definately keep you warm in the cold months ahead. Husband loves it."
			},
			{
				"name": "Elizabeth",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Works perfectly in cold, rain and snow!",
				"review": "I got this for my grandson, he loves it. We're in Washington, where it's currently snowing and tells me that he's sweating a little."
			},
			{
				"name": "gabi",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " good!",
				"review": "The coat is really excellent and warm!"
			},
			{
				"name": "Legally Red ♡",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Soft lining - Perfect for winter ❥❥❥",
				"review": " This coat was bought for my 14 years old son and he loves it. There are 2 main pockets and a third smaller pocket in the front. And there is an inside pocket as well on the left side.\n\nThe body of the jacket and the removable hood is lined with warm fur-like fabric.\n\nThere is no adjustable elastic at the bottom of the jacket to prevent snow from going up the jacket. However, that being said, my son has been wearing this coat for 4 months now and he plays with his 3 younger brothers in the snow all the time and he has never had any issues with snow getting into his coat. He's worn it in -25C weather and wasn't cold at all.\n\nWhen asked what he loves about this coat, his answer is always the same. He says it is super comfortable to wear and it keeps him warm and toasty and the hood is not only big enough to protect his head but protects most of his face as well. Overall a great purchase. Would recommend.\n\nIf my review was helpful let me know by clicking on the ''Helpful'' button :) 👍🏻"
			},
			{
				"name": "Andrew Riddles",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great Warmth, Great Value",
				"review": "Just to let you know, I ordered this in November to see if I could get away with a winter coat at the cheaper end of the market. I am only writing a review now because we have now had some cooler days here in Ottawa. Last week we had -18C [for those in the mediaeval states that still use Fahrenheit, that is -1F (or 33 degrees below freezing point)]. The \"Feels like\" temperature was -25C (which is -13F, or 45 degrees below freezing point). For those who don't experience these kind of temperatures, your eye lashes start to freeze together at that temperature, and your nose hairs freeze. In the wind, especially if your fingers or other extremities are wet and exposed, you risk frostbite. THIS COAT though kept me warm - with just a t-shirt and a cable knit cotton sweater underneath. It's the real deal - it works in very cold temperatures.\n\n(Waits patiently for someone from Winnipeg to come on and say I don't know what the word cold means because I live in Ottawa where the winters are 'warm' compared to Winnipeg...)\n\nUPDATE: Winter is almost done (It only lasted 18 months this year). I stand by my initial review, except to say if you live somewhere tropical like Britain, it will be way too warm for your winters. Great for -20C - -30C (For those countries still in the 18th century that is between -4F and -22F)."
			},
			{
				"name": "Crosbyman",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " nice but... sleeves long and armpits narrow",
				"review": "Received today Dec.13 fast delivery\nfit wise… 2 basic issues with my xxl size ( I am 5 foot10 …...260 lbs heavy set guy )\nsleeves found to be a bit to long for me….. but better to long than to short :-)\ncoat is a bit tight under the armpits\noverall quality looks fine but I have not experienced it in really cold temps yet….\n\nI am keeping it but if store bought locally….I would have tried a few more on the rack for better fit.\n\nupdate jan 25 2020... Very satisfied coat performed great at -20C\n\nupdate march 30… winter is over coat was great no complaints great product"
			},
			{
				"name": "Mark Samuel",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Both coats perfect sizes!",
				"review": "Recieved this coat yesterday. It fits perfectly! I know by reading the reviews and also when I read them the most frightening part is ordering the right size. I'm 5'7 and 210 pounds, I ordered a XL and it's perfect. I ordered one for my son he is 5'8 and 160 got him a large, again a perfect fit! As for the cost itself. It is very warm, not bulky at all. Yesterday it was -20 celcius and I wanted to test it so I just put a Golf polo on with the coat and I was warm! So all in all a great coat for the price."
			},
			{
				"name": "Geoff",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Excellent Winter Jacket...So Far",
				"review": "The jacket arrived on time and is a perfect fit. I ordered the XXL and am 6'3\" and approximately 280lbs (127Kg) and it just fits with a bit of room to spare. The arm length is good and zipping up the jacket with a smaller jacket underneath is done with no issue but not a lot of room to maneuver. Not tight but not overly loose either. I can also comment on the one user who said the zipper is flimsy. If you go hard at that zipper, it likely will break off. It is not rugged. If you calmly zip the jacket up, you will have no problem.\n\nI have walked with this jacket/smaller jacket combo in -7 Celsius with good warmth, even a little hot after 15 minutes. In 0 degree Celsius this is too hot. I live in the North where the temperature will get down to -50, with an average around -35 in the January - April months. I will do up an addition to this review when I have gone through a few days like that. Until then, this is a very good jacket for the money and so far, serving me well."
			}
		]
	},
	{
		"id": "Wnl7In",
		"title": "Columbia Men's Steens Mountain 2.0 Full Zip Fleece Jacket, Black, Medium",
		"imageUrl": "https://m.media-amazon.com/images/I/61E5vGH5fyS._AC_UX342_.jpg",
		"price": "$34.99",
		"description": "Product Details\nFabric Type\n100% Polyester\nCare Instructions\nMachine Wash\nOrigin\nImported\nFur Description\nMachine Wash\nCountry of Origin\nBangladesh\nAbout this Item\nSOFT FABRIC: This Columbia Men's Steens Mountain Full Zip 2.0 Fleece Jacket is crafted of ultra-soft 100% polyester MTR filament fleece for the perfect amount of warmth\nHANDY FEATURES: This fleece jacket features two side zippered security pockets to keep your small items secure\nULTIMATE COMFORT: With a collared neck and zippered closure, you're sure to be protected from the frigid cold\nCLASSIC FIT: A modern classic fit and with a soft, lightweight feel make this fleece jacket a staple for comfortable outdoor activity\nVERSATILE: Soft and warm, this fleece jacket is the perfect layer for any winter activity\nPRODUCT UPDATE: Jacket may come with “Columbia” embroidered or logo patch sewn on.  Both are authentic Columbia Sportswear products.\nDescription\n\nA soft fleece layer is a must for any fall, winter, or spring wardrobe—even more so for cross-campus walks, that’s why our collegiate version of the Columbia Flanker III Fleece Jacket was made. This is a soft, cold weather ready staple, and everyday style piece in support of your alma-mater. You're bound to be warm and worry-free in this fleece jacket crafted of our super-soft polyester filament fleece. It's the perfect layering piece and first line of defense to combat cold outings. When high activity is a factor, a classic fit allows for comfortable movement that you'll appreciate. Zippered side pockets keep hands and small items secure and warm. An added bonus is the warm collar that's flexible enough to wear up or down – depending on your desired level of toastiness. Columbia offers this collegiate jacket with multiple college logos and in a variety of sizes. To ensure the size you choose is right, utilize our sizing chart and the following measurement instructions: For the sleeves, start at the center back of your neck and measure across the shoulder and down to the sleeve. If you come up with a partial number, round up to the next even number. For the chest, measure at the fullest part of the chest, under the armpits and over the shoulder blades, keeping the tape measure firm and level.\n\nSee more\nAbout this Item",
		"totalReviewCount": "1,818 global ratings",
		"averageStarRating": "4.7/5",
		"reviews": [
			{
				"name": "Aden T.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Not great for windy days",
				"review": "Wind sort of just blows right through this, so don't use this if a windbreaker is what you're looking for. It's more like a very thin blanket over your torso, so keep that in mind if you plan on buying this product."
			},
			{
				"name": "Julian C Flores",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Fits great",
				"review": "Just what I looking for"
			},
			{
				"name": "George Black",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Black is actually grey",
				"review": "The color is not black as in the photos, more of a dark grey. Otherwise looks great, but I was hoping for a true black color."
			},
			{
				"name": "Sheila Morrison",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Always perfect, my favorite brand!",
				"review": "Great value, always as expected."
			},
			{
				"name": "Joe P.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Nice material",
				"review": "Light weight for cool days"
			},
			{
				"name": "This is a pen name",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "2/5",
				"reviewTitle": " Not convinced this jacket is made to be worn outside.",
				"review": "Very comfortable for indoor use but not warm enough for outdoors below 60 degrees. The wind tears through this jacket. Also, not convinced this is an actual Columbia brand jacket due to quality of stitching and cheap logo patch."
			},
			{
				"name": "nerrek2000",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " If you're looking for a snug or athletic fit, order a size smaller than normal.",
				"review": "Likes: Zippers all run freely and smoothly. The added length to mid hip helps keep out drafts along with shock cord pulls at the bottom of the garment. The slightly loose fit allows for layering underneath this fleece top.\n\nDislikes: Depending on the color and size you want, there is a very wild swing in price.\n\nNote: This is the 3rd one of these that I've purchased. The first one I bought 3 years ago, and the second one I bought 2 years ago. They get worn every day 6 months of the year and are still going strong, with very minor pilling on the one I've had for 3 years. A very solid product."
			},
			{
				"name": "emefede",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Excelente!!",
				"review": "El talle quedó bien, la calidad es excelente como todo lo de la marca Columbia."
			},
			{
				"name": "MxJm1",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Suave y comoda",
				"review": "Suave al tacto, no se hace fea al lavarla. Es caliente para climas no muy fríos. Se ve muy bien y queda como se espera. El color es igual al de la foto. La marca Columbia es muy buena."
			},
			{
				"name": "ARMANDO L.",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Talla incorrecta",
				"review": "Pedí mediana y me llegó grande, me queda olgada pero pues así la usaré, me da weba aventarme el proceso del cambio, por lo demás todo bien."
			},
			{
				"name": "Michael",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Good quality procuct",
				"review": "Very comfortable"
			},
			{
				"name": "Dany Ramones",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Chaquetón!",
				"review": "Muy buena compra, el material es suave y muy cálido, de buena calidad. El color negro es casi un gris oscuro pero igual se ve muy bien."
			},
			{
				"name": "Felipe Hernández",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Excelente producto",
				"review": "Es muy bonita y muy caliente. Justo lo que esperaba del producto en todos los aspectos."
			}
		]
	}
]
