[{"id":"XmVD0z","title":"Berghaus Men's Prism Polartec Interactive Jacket","imageUrl":"https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/9184a-A3MIL._AC_UX385_.jpg","price":"$70.95","description":"Product Details\nFabric Type\n100% Other Fibers\nCare Instructions\nMachine Wash\nOrigin\nImported\nAbout this Item\nWarmth to weight - great warmth to weight ratio with Polartec Classic fleece fabric\nInteractive -when rain clouds gather you can zip into one of our interactive waterproof outers in seconds - for ultimate layered protection\nReliably secure - keep essentials reassuringly safe in zipped hand pockets\nPolartec Classic (251 G/M2)Contend: 100% polyester Thermal Insulation 0. 9 87% recycled polyester\nDescription\n\nWhen sunny days take a chilly turn, that's when the prism pt. jacket comes into its own. With a great warmth to weight ratio, the Polartec classic fleece fabric is incredibly soft with a high quality feel. For versatility you can't go wrong as the interactive zip makes it the perfect companion to zip inside a Berghaus interactive jacket for extra weather protection. Plus you're never far from your essentials as zipped hand pockets keep everything safe. So, no matter how changeable the weather, this will match it.\n\nSee more\nAbout this Item","totalReviewCount":"859 global ratings","averageStarRating":"4.6/5","reviews":[{"name":"Jasonbtx","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great Coat","review":"Bought to go with my coat. It zips right in, nice and thick. Nice and warm at 15°F. Fits perfect!!"},{"name":"BW","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Definitely recommend.","review":"Ordered this jacket to replace the one my husband has worn so much and for so many years that it has holes in it. Great product. Highly recommend. Fit is great and keeps you warm!"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" fits appropriately","review":"Berghaus is the best, fits well"},{"name":"Tomislav Bacic","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" great product","review":"it looks a bit big if you wear it over the t-shirt. you need a ticker cloth underneath."},{"name":"Mark Lawton","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" 100% real","review":"Fortunately for me, the Berghaus I received direct from  (as opposed to a Marketplace seller) is real, and, as expected, it’s a nice one. I know that because I’m a bit of a fatty and I like the cut on Berghaus fleeces because they don’t make me look as if I’m wearing a kaftan.\n\nI am also a real customer, not a bot or a fake review writer, just in case you were wondering."},{"name":"Herefordshire yokel","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" FAKE COPY BERGHAUS","review":"Looks like a fake with berghaus labels on. One day of use and the fleece is pilling up and coming away. I've owned these before and never seen this. Buy direct from berghaus, dont buy this junk."},{"name":"JamMC","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Can confirm the zips align with the Cornice III Interactive jacket","review":"Bought this for the Cornice III jacket. Purchased the Medium fleece size for a Medium jacket, the zip fittings align well on both garments and had no trouble fitting the fleece to the jacket. There are also two loops at the sleeves which attach to internal fasteners in the jacket sleeve. Soft, comfy material, no complaints so far."},{"name":"Blueeye","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" Poor quality and was too small","review":"I have purchased Berghaus many time in the past and all their products h@be been great and have fitted well but not this garment it was way too small and th3 quality not very good at all I returned this garment 😡"},{"name":"Hotwired","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Good but missing features","review":"I bought this to go in a Hillwalker jacket. It fits fine but one thing really irritates me; my wife bought the same product for women and it had really nice internal mesh pockets accesible from inside, useful for gloves, hats etc. The men's version has the same pockets but they are only accesible from the outside, so great when you are wearing this alone but inaccessible when zipped into another jacket as an \"INTERACTIVE\" lining. A really stupid design fault."}]},{"id":"SCWd2h","title":"Men’s Winter Coat Jacket Long Parka Ultra Warm Snow Ski Removable Hood Fleece Lining All USA Sizes","imageUrl":"https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/61HUl0w59VL._AC_UX342_.jpg","price":"$49.95","description":"Stay warm and comfortable when the winter winds and heavy snows come your way with a stylish and versatile extra-long men’s parka from Lion Force Wear.\n\nBefore you know it the winter months will be upon us and you’ll be shivering to stay warm against the cold wind and snow. That’s why we developed the Lion Force Men’s X-Long Parka, an insulted, fleece-lined jacket that provides supreme comfort and coverage for all your daily travels and adventures.\n\nDesigned for the modern man, these coats offer a stylish design, removable hood, and a fully-zippered front to make it quick and easy to throw on or take off while you’re living life on the go. When you need to stay warm and need comfortable convenience, choose Lion Force Gear and make even the coldest winter day seem a little bit brighter.","totalReviewCount":"209 global ratings","averageStarRating":"4.1/5","reviews":[{"name":"ANGEL BARNES","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Keep me warm","review":"Love it😍😍😍😍"},{"name":"jean","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Great turn around for orders and return. Will not hesitate to order again.. in the future","review":"The sleeves need a cuff."},{"name":"Patilu","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Attractive, warm coat that is flattering, not bulky looking","review":"I'm writing review for my husband with his consent. He is happy with the jacket. The jacket has very clean lines and is attractive on him. It looks modern while still looking age appropriate (late middle age). It does not have that bulky, puffy look like some coats. He is 6' 1, has a 44 waist and XXL fits well. My husband runs warm and in most cases the jacket is plenty warm for him. You might want to layer up under the jacket if you're going to a football game in wind and freezing weather. We live in the midwest and this jacket is just right for routine daily use in our cold winters."},{"name":"Diane Sims","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Nice coat!","review":"Very pleased with this coat. It is well made, well finished. Looks great and fits very nicely ."},{"name":"Rantan","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Just right","review":"It very difficult to find quality and affordable big and tall coats. This one is just the ticket."},{"name":"David","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Alright","review":"Ordered charcoal, got a dark green. There's two pictures of the jacket, if you notice. The actual jacket looks nothing like the first picture, but does look like the second one. Just a different color. It's very warm though, does the job. Those in the reviews saying it looks like a designer coat are crazy, but, this is good for the price. Just don't like that the color came dark green instead of charcoal"},{"name":"Deb","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Very warm","review":"Daughter loves the jacket"},{"name":"Lisa","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" True to fit sizing","review":"There are conflicting answers on how this coat fits, but it seems true to fit to me.Bought it as a gift, 5'4'', 175 pounds, extra large is perfect. Feels very warm, but winter hasn't quite hit us yet so I will edit my review if it turns out not to be warm enough New York winter's. The shipping was very impressive. With in an hour of ordering it was shipped, and arrived a lot quicker than they said. I am very pleased with this order 😊"}]},{"id":"JS6xyW","title":"LEPOAR Men's Winter Jacket Military Jacket Fleece Lined Warm Cargo Jackets Removable Hood Cotton Work Coat","imageUrl":"https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/71YmbGtbx4L._AC_UX385_.jpg","price":"$59.99","description":"Product Details\nFabric Type\nOutshell: 100% Cotton; Lining: 100% Polyester\nCare Instructions\nMachine Wash\nOrigin\nImported\nAbout this Item\n【WINTER WARM JACKET】：High density washed pure cotton fabric and thick fleece lining and length make this hip-length jacket your barrier against harsh conditions, keeping you warm and providing maximum wind protection in all directions.\n【MENS WINTER JACKETS】：All zippers and buttons have been replaced with new ones, which have been tested for thousands of times and become more stable. Pockets and sleeves were lined with thicker, denser fabrics. The wool lining inside provides excellent comfort. The insulated cap features a zipper closure for easy removal and connection, while the drawstring with a drawstring makes it more flexible. Jackets with ribbed collars, quilted sleeves and stretch cuffs are more versatile.\n【7 FUNCTIONAL POCKETS】: Mens coats with several exterior pockets and 1 interior pocket, you conveniently bring your keys, wallet, phone, passport and other accessories.\n【CASUAL EVERYDAY PARKA FOR A WINTER】： Military jacket combined with a simple look is a good gift choice for family and friends as daily wear on many occasions, e.g., riding,work,cycling, travelling, fishing, camping, hunting, hiking, etc.\n【SIZE COLOR NOTE】: The mens winter jackets offers a standard fit.True to size. Two styles, 6 colors for each style. If there is no color you like, please let me know and we will consider adding it.\nSee more\nAbout this Item","totalReviewCount":"279 global ratings","averageStarRating":"4.2/5","reviews":[{"name":"Savanna","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Thick jacket","review":"I got this for my dad because he needed a winter coat and he said he loves it. It’s freezing in the morning when he goes to work and gets cold again on his way home. He’s always wearing it when he leaves and when he gets back. It’s soft on the inside which I didn’t realize from the photos but was a nice surprise. It’s heavier and thick. The only reason I took one star off is bc he is a XL and I got a size up and it just perfectly fits, and because the color was a little darker from the brown I saw in the picture but not too noticeable."},{"name":"Terry","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" In the 3x size 1x to 1 1/2x smaller than average 3x","review":"Very disappointed I loved the looks and the great quality of material of this jacket but it didn’t fit. I wear a 3x in shirts and jackets this jacket 3x is about 1x to maybe 1 1/2 x smaller and 3x was largest size they make in this jacket. Once again I loved the looks and quality of material very sturdy made. Unfortunately I had to return. If I had read the testimonies first I would have learned this before buying. Hopefully this will help others and save more returns."},{"name":"Richard M. Mathis","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" This versatile and high-quality jacket exceeded my expectations in both warmth and comfort.","review":"I am extremely satisfied with this jacket. Not only did it keep me warm during a snowstorm in Utah, but it also prevented me from feeling too hot while indoors or driving. The lightweight design and lack of bulkiness make it comfortable to wear, and the numerous pockets are a convenient feature for storing my belongings. I personally did not have the need to use the hood, but it seems like a useful feature for rainy weather. Overall, I highly recommend this jacket."},{"name":"djsmoove24","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Great coat at a great price! But...","review":"Coat arrived fast. Fits great. But I didn't like the child like patches. This is advertised as a \"men's coat\". Yet childish patches were on each sleeve lol! I quickly removed them."},{"name":"TED SCOTT","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" good. intermediate coat","review":"Good coat for cost. Great for everyday casual use. Would not use it for heavy duty outdoor wear."},{"name":"Forrest w cox","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great coat.","review":"This code is excellent. It's very warm it's heavy. To be honest it's better than I expected. I definitely give this coat a thumbs up. And it's rare that I give a five-star written review. But this coat is worth it"},{"name":"foxfire","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Runs small","review":"Runs small"},{"name":"No name","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" The price!","review":"A gift."}]},{"id":"sG7_Kj","title":" Essentials Men's Packable Lightweight Water-Resistant Puffer Jacket","imageUrl":"https://m.media-amazon.com/images/I/71yFpt7xjAL._AC_UX342_.jpg","price":"$21.90","description":"Product Details\nFabric Type\nShell: 100% Nylon; Lining: 100% Nylon; Fill: 100% Polyester\nCare Instructions\nMachine Wash\nOrigin\nImported\nAbout this Item\nCold-weather style is easy with this versatile water-resistant lightweight puffer jacket featuring a full-zip front and stand-up collar\nWith a stand-up collar, zip pockets and elasticized cuffs; packs neatly into included carrying bag with drawstring closure\nOutfit the entire family with comfortable, quality clothing from  Family\nWinter made better: we listen to customer feedback and fine-tune every detail to ensure quality, fit, and comfort\nDescription\n\nAn Amazon brand - Cold-weather style is easy with this versatile water-resistant lightweight puffer jacket featuring a full-zip front and stand-up collar\n\nAmazon Essentials is focused on creating affordable, high-quality, and long-lasting everyday clothing you can rely on. Our line of men’s must-haves includes polo shirts, chino pants, classic-fit shorts, casual button-downs, and crew-neck tees. Our consistent sizing takes the guesswork out of shopping, and each piece is fine-tuned to offer quality and comfort.\n\nSee more\nAbout this Item","totalReviewCount":"22,904 global ratings","averageStarRating":"4.5/5","reviews":[{"name":"Avant","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Good cheaper alternative but not for heavy use","review":"I bought for the purpose of travel and outdoor use in those times where temps can change drastically from 70F in the morning down to 40F at night.\n\nI got this on sale for $20 which was a far cry from $60-120 asking price of other packable down jackets. For the price, it's much warmer than I thought and has well thought out features. So far I've worn this in 42F weather, coldest and just going on a walk I was breaking a bit of a sweat with it half zipped. It has 2 exterior pockets and 2 internal pockets. Personally I wouldn't put too much in these, as I can really feel the thing stretch and drag down. Just gloves, hat, phone etc. should be fine, nothing like a can of soda or something. Water resistance is what you expect for thin nylon stuff, a few drops is fine, actual rain, get an umbrella or an actual waterproof layer. It's also pretty windproof, took it out in the aftermath of a pseudo hurricane and didn't feel the wind.\n\nIt packs down pretty well into a 6 inch long 3 inch or so bundle but nothing like the high tech hiking stuff, I just wish there was a shorter loop so I can carabiner it to my pack easier but seems like it was intended to be carried like an umbrella. Also wish it packed into itself rather than have a bag which may get lost one day. The material imo isn't very durable, I have no rips yet, but I'm not confident and think if I rub on something the wrong way it's going to tear. The stitching seems fine so far, and doesn't seem to be leaking filler yet.\n\nSizing wise, I have a 45 chest and usually wear XL, but this is kinda big even for an XL, maybe because they were antiicpating you layer something like a thick sweater underneath. It is also a bit long for my torso, about 2-3 inches more than I need to sit at my waist. I have 23 sleeves and that fits perfect.\n\nI don't expect this to last a long time, but it's useful for the time I'll have it.\n\n12/28 edit:\nSo I just used this exactly for what I bought it for because of the huge winter storm that swept across the north and east coast US. Temps went from nearly 60 degrees in daytime all the way down to 23 by late afternooon with extremely high winds that were throwing doors around and knocked some street signs off their mounts, and it was perfect. I just had a t-shirt underneath and on top of this was a gymax waterproof windproof jacket. Again my only complain might be if the material doesn't last and it's a bit long."},{"name":"Christopher Zele","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great inexpensive puffer jacket","review":"I was able to snag one of these puffer jackets for my Step Dad for $21 for Christmas. It runs a little bit big and he normally is a Medium, but I bought him a Small and that seems it will be perfect for him. The quality of the material is very nice they used a good filler and the jacket feels nice when I tried it on to see how it would fit. Most puffer jackets are $40 or $30, so when I saw this for the low $20s I had to pick one up.\n\nYou can fold this puffer jacket up into a ball, which is a nice plus if you're hiking somewhere cold and it warms up in the afternoon and you want to put the jacket away.\n\nThis jacket definitely feels like a $40+ product. I own an Old Navy Puffer Jacket, which I've used for years and a Patagonia one. This  one is very close in quality to the Old Navy one. It feels good to the touch and looks sharp.\n\nIf I was in the market for another gift for someone, or I needed another puffer jacket for myself I would definitely buy an Amazon Basics because they're both cheap and high-quality."},{"name":"Nunya001","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Big Performance for a very low cost","review":"I bought this jacket to wear at work - I make a wood product and I'm outside in all weather. I need jackets to be no fuss and functional but also affordable so if I tear it, spill oil on it, burn it with welding sparks I can shrug it off and buy a new one. As a point of reference Patagonia is my personal go to outdoor wear supplier, but that's way too expensive for work.\n\nI've been wearing this jacket now for a couple of months. Just went out in 13 F with pretty decent wind gusting - warm and comfortable. It's cut allows good movement and it's not so bulky so you can put a shell over it in wet weather, although I've worn it in the rain without a shell and it does pretty well. I'm 6'2 185 with long arms and a medium fits just right. I wish it was 4 inches shorter - that's my only suggestion."},{"name":"Dan","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Depends on the fit you like. See more for good info.","review":"Really great for the price $22 I got a large and ordering a 2nd that is medium, if I used it a lot (or it cost more) I would get something more durable like a name brand. But price wins and it is warm, it works for what I use it for. The fit is more of a traditional fit that is to say a large is baggy for my slim fit preference. I am a man who is 190lbs 5'11. Before the pndmic I was 175 (got gains) and would have gotten a small knowing the sizes haha #goals.\n\nIf you want a long term thermal go buy a brand name it will look 6 times better, but this thing has its place for sure!! I like things more tight fitted and in my post pndmic body i'd get a medium or probably a small to wear under a jacket. So if I was 175-180 i'd probably get a small I think to wear under stuff, but a medium if its the main thing and you don't like fitted clothes.\n\nI planned to get 2 of these with one to wear to work and another to get dirty from yard work and outside things. I first ordered a large and it is baggy for my preference but probably what most men would want. I like fitted clothes and have ordered another one in size medium to wear to work. I am keeping the large for yard work and other things. Great to have 2 or 3 instead of one high priced item.\n\nHope it helps!"},{"name":"Clau","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Excelente compra!!!","review":"Está increíble la calidad. Es muy similar a las chamarras Uniqlo, con una diferencia de precio enorme. Se guarda perfectamente bien en su bolsita y no pesa prácticamente nada. Es calientita. Básica para los viajes. El color es igual a las fotos de la publicación de , y viene ligeramente jaspeado el tono. Viene amplia. Estaba dudando entre la L y la XL y compré la L y acerté. Si estás entre dos tallas escoge la pequeña. Súper recomendada! Si esta reseña te fue útil da click en me gusta para evaluar si escribir otras reseñas"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Surprisingly good","review":"So I have to say I had rock bottom expectations buying this. But corona has been good to me and I’ve lost 30 kg in the last year. As such basically nothing fits me. Therefore in desperation I turned to  to help me out. The coat is lightweight. Folds super small in the provided bag. Has a nice matte finish. Sizing is good. I’m 175cm and 71kg - the small is just a shade too big. Otherwise really happy."},{"name":"JHK","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" size","review":"Im a 46\" chest and a 36\" waist. Im 6'0\".\nMy normal size to go to is XL.  apparently knows this and recommended a 2XL.\nHowever, having read the reviews I went for my go to size XL.\nIt arrived. Way too big. So I returned it using their carrier which was EVRI which annoyed me cos I thought I could return via the  shop which is much easier. EVRI system and machines are shocking.\nI then ordered the L. Very rarely do I do that as they are normally too tight.\nIt arrived. Fits fine on the chest and shoulders , arms and length, but the waist is a bit baggy and loose. It's like for a 39\" waist I would say. ( I do train/swim a lot and have a v shape)\nIm being super fussy, but for £37 I feel I should be. I am sticking with it as I figure a M would be too tight.\nAnother thing. It is a female zip. Zips up on the wrong side. No big deal these days as we are alll meant to be one and the same right? Just letting you all know that's all.\nHope this helps. Surely Amazon Essentials should be able to get sizing and measurement information right and show it with the products.\nCome on Amazon. I love you but you really should give more information and more accurate sizing with your products. Hope this helps you as requested."},{"name":"Tony K","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Fabulous value","review":"Truly surprised by how warm this jacket is. It’s feather light and my first thought was that it is pretty thin so my expectations were pretty low. How wrong was I? I work outdoors in N Scotland and already in Oct temperatures are only 4 or 5C. I’ve been wearing it under my overalls instead of a fleece and wow it’s warm. It isn’t an Arctic level puffa jacket but I think that’s fairly obvious but it’s way warmer than a fleece, not at all bulky and fabulous value for money. I definitely recommend it"},{"name":"Jay Dee","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Delighted...","review":"...with this jacket.\n\nIt is everything it claims to be in the description and despite being lightweight it is pleasingly warm [snug as a bug actually].\n\nThe stitching is excellent and I found no loose threads. It has two external zipped pockets and two large inside lower front quite deep pouch pockets. The zip, in keeping with the 'lightweight' theme is quite narrow but works well and zips right up to the top of the collar.\n\nSize-wise I would say it is 'true to size' bearing in mind what you may be wearing under the jacket in cooler times."}]},{"id":"a4ujMh","title":"Levi's Men's Washed Cotton Hooded Military Jacket","imageUrl":"https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81ue5-58RmL._AC_UX385_.jpg","price":"$56.14","description":"This jacket in rich neutral colors will you keep as warm as you need to be with its removable hood and lining.","totalReviewCount":"7,746 global ratings","averageStarRating":"4.6/5","reviews":[{"name":"Justin","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Review from a tall dude","review":"I feel like I got very lucky with my purchase here. I pulled the trigger on the tall and am so glad that I did because it's just the right length in the arms and the torso. For reference, I'm 6'3 and around 210lbs and I got the large tall. I would opt for XL a lot of the time but with reviews saying this ran big I decided to stick with the large.\n\nThis is made of really sturdy materials. Not as sturdy as something like a Carhartt for example, which in my opinion is almost too tough (and quite a bit more expensive), but it feels like this is built to last a good while. The detachable hoodie part is a really cool touch. The wrist cuffs have two buttons for a looser or tighter fit. The inside of the torso is sherpa while the inside of the arms is a nice quilted material. The front pockets for your hands are on the sides, although the pictures make it seem like they would go in under a flap. I got the brown version (lighter one) and it's exactly as pictured. Overall I'm happy with this coat overall and look forward to perhaps buying other colors."},{"name":"Barredbard","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" A Great Fit for an Understated Look","review":"I had always wanted a winter coat that didn't quite look like one, or have the bulk and heft of one. The somewhat pseudo-military or even quasi-cowboy look has always appealed to me. I am thrilled with this coat. I usually wear a large, but with winter coats I tend to get a size up, to accommodate any garments underneath. It was the right call. The look is crisp and understated, which is what I was going for. With the hood, it's a blend of the trendy, with the classic.\n\nAs I wore it for the first time, I thought the only thing missing is the ability to remove the hood at my option. I checked, and low and behold, the hood can be unzipped and removed. I am not sure why this important feature was not mentioned. I almost did not buy it because I was debating that white hood. The fact that it can be removed is excellent.\n\nGreat coat."},{"name":"Malckiah","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Buy it!","review":"I bought an XXL based on what everyone was saying. I ended up sending back for XL which I never do... but when I got the wrong size I could see that this jacket was WELL worth the money. Definitely a good quality jacket that will keep you warm. I would definitely reccomend and it was worth the trouble to send it back for the right size. I am 5\"10... 190lbs... XL is perfect for me."},{"name":"Louis arc","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Fits comfortably but durability is questionable","review":"After less than a year with this jacket, a portion of the back has a rip about 7 inches long and has exposed the cotton underneath. I would like to arrange for a replacement if possible because it is a nice jacket but can't continue wearing it as is."},{"name":"Aqueeta Parker","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" The perfect winter jacket","review":"I have been looking for a jacket for my boyfriend for some time and finally stumbled on this on. It is a perfect fit, he is 5’11 200 lbs, just below is waist. We got it in a size large, it is the perfect jacker for the rainy winter season because it works well at a rain jacket as well as a layered winter coat."},{"name":"Lanloesh","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" It's worth 70 bucks.","review":"Comfort and warmth are the standouts for this jacket. You're essentially getting a hoodie and a jacket in one. The feel is top notch and I feel like I could wear it all day."},{"name":"E. Brooks","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Narrow shoulders, wide waist","review":"My husband is broad shouldered and slim waisted, he is also tall. Got him an XL and it was too large through the body and much too small through the shoulders."},{"name":"robert dolan","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" I like how it looks and feels","review":"Step above a Hoodie jacket can wear with other jackets under the coat or with a coat over it very warm I have 2 of them now."},{"name":"rjg.1969","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" You won’t be disappointed!","review":"Good fit. Quality jacket. Quality brand."},{"name":"P Williamson","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect","review":"Excellent fit"},{"name":"Glen","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Not good quality","review":"I love the look of this jacket, but I must say the quality has left me disappointed. The fit is not overly generous for the size I bought, but it's OK. The main issues I have had are that the zipper pull broke on day one - not a big problem, I was able to rig a replacement, and yesterday (just after the return period closed), a seam on the right sleeve at the back of the shoulder opened up about 4 inches. I had to take the jacket to a tailor to repair it. I have only worn the jacket a few times so far, so there's no way it should be coming apart already. Really not impressed.\n\nUpdate 22-2-22 - today the seam on other sleeve came apart as I was simply reaching up to take off my hat. This jacket is SUCH poor quality - I STRONGLY ADVISE AGAISNT BUYING ONE. I will be contacting the seller to see if they will refund, even though the date has passed."},{"name":"Mau","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Calidad excepcional","review":"Me encantan los materiales, el forro, el teñido y la talla. Creo que es la primera prensa que siento me convenció en todo aspecto"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Too short","review":"Way too short on me, bought a large and the only sizing charts are for chest size but nothing about length. I am 6'4\" and unfortunately only realized it didn't fit after I removed the tags. Every shirt I own sticks out the bottom of the jacket. I like the quality of it though but it would be nice if I knew what size would actually fit me."}]},{"id":"GUcV7Q","title":" Essentials Men's Packable Lightweight Water-Resistant Puffer Jacket","imageUrl":"https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/81Qyp3yf1US._AC_UX342_.jpg","price":"$21.90","description":"Product Details\nFabric Type\nShell: 100% Nylon; Lining: 100% Nylon; Fill: 100% Polyester\nCare Instructions\nMachine Wash\nOrigin\nImported\nAbout this Item\nCold-weather style is easy with this versatile water-resistant lightweight puffer jacket featuring a full-zip front and stand-up collar\nWith a stand-up collar, zip pockets and elasticized cuffs; packs neatly into included carrying bag with drawstring closure\nOutfit the entire family with comfortable, quality clothing from  Family\nWinter made better: we listen to customer feedback and fine-tune every detail to ensure quality, fit, and comfort\nDescription\n\nAn Amazon brand - Cold-weather style is easy with this versatile water-resistant lightweight puffer jacket featuring a full-zip front and stand-up collar\n\nAmazon Essentials is focused on creating affordable, high-quality, and long-lasting everyday clothing you can rely on. Our line of men’s must-haves includes polo shirts, chino pants, classic-fit shorts, casual button-downs, and crew-neck tees. Our consistent sizing takes the guesswork out of shopping, and each piece is fine-tuned to offer quality and comfort.\n\nSee more\nAbout this Item","totalReviewCount":"22,904 global ratings","averageStarRating":"4.5/5","reviews":[{"name":"Avant","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Good cheaper alternative but not for heavy use","review":"I bought for the purpose of travel and outdoor use in those times where temps can change drastically from 70F in the morning down to 40F at night.\n\nI got this on sale for $20 which was a far cry from $60-120 asking price of other packable down jackets. For the price, it's much warmer than I thought and has well thought out features. So far I've worn this in 42F weather, coldest and just going on a walk I was breaking a bit of a sweat with it half zipped. It has 2 exterior pockets and 2 internal pockets. Personally I wouldn't put too much in these, as I can really feel the thing stretch and drag down. Just gloves, hat, phone etc. should be fine, nothing like a can of soda or something. Water resistance is what you expect for thin nylon stuff, a few drops is fine, actual rain, get an umbrella or an actual waterproof layer. It's also pretty windproof, took it out in the aftermath of a pseudo hurricane and didn't feel the wind.\n\nIt packs down pretty well into a 6 inch long 3 inch or so bundle but nothing like the high tech hiking stuff, I just wish there was a shorter loop so I can carabiner it to my pack easier but seems like it was intended to be carried like an umbrella. Also wish it packed into itself rather than have a bag which may get lost one day. The material imo isn't very durable, I have no rips yet, but I'm not confident and think if I rub on something the wrong way it's going to tear. The stitching seems fine so far, and doesn't seem to be leaking filler yet.\n\nSizing wise, I have a 45 chest and usually wear XL, but this is kinda big even for an XL, maybe because they were antiicpating you layer something like a thick sweater underneath. It is also a bit long for my torso, about 2-3 inches more than I need to sit at my waist. I have 23 sleeves and that fits perfect.\n\nI don't expect this to last a long time, but it's useful for the time I'll have it.\n\n12/28 edit:\nSo I just used this exactly for what I bought it for because of the huge winter storm that swept across the north and east coast US. Temps went from nearly 60 degrees in daytime all the way down to 23 by late afternooon with extremely high winds that were throwing doors around and knocked some street signs off their mounts, and it was perfect. I just had a t-shirt underneath and on top of this was a gymax waterproof windproof jacket. Again my only complain might be if the material doesn't last and it's a bit long."},{"name":"Christopher Zele","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great inexpensive puffer jacket","review":"I was able to snag one of these puffer jackets for my Step Dad for $21 for Christmas. It runs a little bit big and he normally is a Medium, but I bought him a Small and that seems it will be perfect for him. The quality of the material is very nice they used a good filler and the jacket feels nice when I tried it on to see how it would fit. Most puffer jackets are $40 or $30, so when I saw this for the low $20s I had to pick one up.\n\nYou can fold this puffer jacket up into a ball, which is a nice plus if you're hiking somewhere cold and it warms up in the afternoon and you want to put the jacket away.\n\nThis jacket definitely feels like a $40+ product. I own an Old Navy Puffer Jacket, which I've used for years and a Patagonia one. This  one is very close in quality to the Old Navy one. It feels good to the touch and looks sharp.\n\nIf I was in the market for another gift for someone, or I needed another puffer jacket for myself I would definitely buy an Amazon Basics because they're both cheap and high-quality."},{"name":"Nunya001","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Big Performance for a very low cost","review":"I bought this jacket to wear at work - I make a wood product and I'm outside in all weather. I need jackets to be no fuss and functional but also affordable so if I tear it, spill oil on it, burn it with welding sparks I can shrug it off and buy a new one. As a point of reference Patagonia is my personal go to outdoor wear supplier, but that's way too expensive for work.\n\nI've been wearing this jacket now for a couple of months. Just went out in 13 F with pretty decent wind gusting - warm and comfortable. It's cut allows good movement and it's not so bulky so you can put a shell over it in wet weather, although I've worn it in the rain without a shell and it does pretty well. I'm 6'2 185 with long arms and a medium fits just right. I wish it was 4 inches shorter - that's my only suggestion."},{"name":"Dan","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Depends on the fit you like. See more for good info.","review":"Really great for the price $22 I got a large and ordering a 2nd that is medium, if I used it a lot (or it cost more) I would get something more durable like a name brand. But price wins and it is warm, it works for what I use it for. The fit is more of a traditional fit that is to say a large is baggy for my slim fit preference. I am a man who is 190lbs 5'11. Before the pndmic I was 175 (got gains) and would have gotten a small knowing the sizes haha #goals.\n\nIf you want a long term thermal go buy a brand name it will look 6 times better, but this thing has its place for sure!! I like things more tight fitted and in my post pndmic body i'd get a medium or probably a small to wear under a jacket. So if I was 175-180 i'd probably get a small I think to wear under stuff, but a medium if its the main thing and you don't like fitted clothes.\n\nI planned to get 2 of these with one to wear to work and another to get dirty from yard work and outside things. I first ordered a large and it is baggy for my preference but probably what most men would want. I like fitted clothes and have ordered another one in size medium to wear to work. I am keeping the large for yard work and other things. Great to have 2 or 3 instead of one high priced item.\n\nHope it helps!"},{"name":"Clau","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Excelente compra!!!","review":"Está increíble la calidad. Es muy similar a las chamarras Uniqlo, con una diferencia de precio enorme. Se guarda perfectamente bien en su bolsita y no pesa prácticamente nada. Es calientita. Básica para los viajes. El color es igual a las fotos de la publicación de , y viene ligeramente jaspeado el tono. Viene amplia. Estaba dudando entre la L y la XL y compré la L y acerté. Si estás entre dos tallas escoge la pequeña. Súper recomendada! Si esta reseña te fue útil da click en me gusta para evaluar si escribir otras reseñas"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Surprisingly good","review":"So I have to say I had rock bottom expectations buying this. But corona has been good to me and I’ve lost 30 kg in the last year. As such basically nothing fits me. Therefore in desperation I turned to  to help me out. The coat is lightweight. Folds super small in the provided bag. Has a nice matte finish. Sizing is good. I’m 175cm and 71kg - the small is just a shade too big. Otherwise really happy."},{"name":"JHK","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" size","review":"Im a 46\" chest and a 36\" waist. Im 6'0\".\nMy normal size to go to is XL.  apparently knows this and recommended a 2XL.\nHowever, having read the reviews I went for my go to size XL.\nIt arrived. Way too big. So I returned it using their carrier which was EVRI which annoyed me cos I thought I could return via the  shop which is much easier. EVRI system and machines are shocking.\nI then ordered the L. Very rarely do I do that as they are normally too tight.\nIt arrived. Fits fine on the chest and shoulders , arms and length, but the waist is a bit baggy and loose. It's like for a 39\" waist I would say. ( I do train/swim a lot and have a v shape)\nIm being super fussy, but for £37 I feel I should be. I am sticking with it as I figure a M would be too tight.\nAnother thing. It is a female zip. Zips up on the wrong side. No big deal these days as we are alll meant to be one and the same right? Just letting you all know that's all.\nHope this helps. Surely Amazon Essentials should be able to get sizing and measurement information right and show it with the products.\nCome on Amazon. I love you but you really should give more information and more accurate sizing with your products. Hope this helps you as requested."},{"name":"Tony K","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Fabulous value","review":"Truly surprised by how warm this jacket is. It’s feather light and my first thought was that it is pretty thin so my expectations were pretty low. How wrong was I? I work outdoors in N Scotland and already in Oct temperatures are only 4 or 5C. I’ve been wearing it under my overalls instead of a fleece and wow it’s warm. It isn’t an Arctic level puffa jacket but I think that’s fairly obvious but it’s way warmer than a fleece, not at all bulky and fabulous value for money. I definitely recommend it"},{"name":"Jay Dee","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Delighted...","review":"...with this jacket.\n\nIt is everything it claims to be in the description and despite being lightweight it is pleasingly warm [snug as a bug actually].\n\nThe stitching is excellent and I found no loose threads. It has two external zipped pockets and two large inside lower front quite deep pouch pockets. The zip, in keeping with the 'lightweight' theme is quite narrow but works well and zips right up to the top of the collar.\n\nSize-wise I would say it is 'true to size' bearing in mind what you may be wearing under the jacket in cooler times."}]},{"id":"HMtuOR","title":" Essentials Men's Lightweight Water-Resistant Packable Hooded Puffer Jacket","imageUrl":"https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81TnIAEZoBS._AC_UX342_.jpg","price":"$24.40","description":"Amazon Essentials is focused on creating affordable, high-quality, and long-lasting everyday clothing you can rely on. Our line of men’s must-haves includes polo shirts, chino pants, classic-fit shorts, casual button-downs, and crew-neck tees. Our consistent sizing takes the guesswork out of shopping, and each piece is put to the test to maintain the highest standards in quality and comfort.","totalReviewCount":"7,960 global ratings","averageStarRating":"4.5/5","reviews":[{"name":"joel oleta","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" felt like it wasnt going to do the job, i was wrong its great","review":"Well i bought this so i can have an affordable puffer jacket i can abuse and not feel bad about. used it for everything and anything that involved being cold outside.\nNot wanting to risk expensive jacket incase i ruin it or hate it i purchased this one but so far it has withstood the abuse. i am pleased with the purchase and i recommend it if your in the market for this item and price is an issue . i have used it for concerts ,camping ,late night shopping trips ,taking out the trash at 4 am also just for the random day hikes .\nthings i like it packs really small and is very light it also comes with its own drawstring bag that seams to match the color you purchased , i think anyhow because i have purchased 4 different colors (Christmas presents for family members ) and all come this way.\nAlso this thing does very well in windy conditions it seams to have a very thin feel for a puffer jacket but the small amount of insulations paired with the inner and outer shell of jacket material reminds me of safety blankets ability to reflect body heat back to you this feature for staying warm is doing great for lack of \"poof\".\ni took this to a outdoor concert in LA (besame mucho) and it was very cold and windy because of concert rules only small see through bags were allowed so i brought this jacket in its drawstring bag and took a very small amount of space and was perfect for the situation kept me warm through the whole night night. had very large outside pockets with zipper closures and very deep inside pocket behind the outside zip up ones, they seam to share the space keep this in mind when placing bulky items one side will use space from the other even thought they are separate a pocket . the hoody does not have draw strings but i dont feel needs them i think we have gotten use to everything needing drawstrings, it is a bit spacious inside the hood i guess if you have a beanie or a baseball style cap it should fit fine and extends just before the bill of cap. i just hated that they tried to ship it in no box just a clear see through bag the first time had to return arrived damaged.\nIn new condition its durability is uncertain until this point it has held up (2months), not sure yet the feel is not the toughest it has a thin feel but notably i have not torn it and it has at least been through the wash once keep in mind i airdried all this said it looks brand new and is in great shape , i would whole heartedly recommend this jacket just look for the deals also get the vest for an added layer of warmth"},{"name":"Bill O.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Runs a little big but does a good job of being a lightweight jacket","review":"The main purpose of a lightweight jacket is to keep you warm when it's cool outside but not super cold. For me that means I purchased this jacket for temps between 35 and 60. I wouldn't want to rely on it any colder than that. For that purpose, it does extremely well. I don't feel too hot wearing it in the upper 50s, and as long as I don't spend hours outside when it's in the 30s, it keeps me warm.\n\nMy only knock is that the sizing feels like it is from 20 years ago when everything was a bit more loose fitting. That's good if you want to layer up, but the styling is not the current trend of slim/ form fitting. Since I'm an older guy now, that's not as important to me, but it may be for others."},{"name":"Linda-Lu","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Loving it so far","review":"I bought a man’s jacket for the extra length and larger pockets. I know the sleeves are too long. But idm. I’ll just roll them up. A size down would’ve been better, but there’s nothing wrong with a little extra space for layering. (I’m not doing any fashion shows). My comfort is my priority.\n\nThe jacket feels good on. It’s light weight.\nIt stores nicely into the sack provided and comes out wrinkle-free. It allows for a sufficient/confortable heat and is rain resistant (in a light rain). I tested it out today.\n\nOverall, I am VERY VERY happy with this jacket. I’m glad I bought it.\n\nI only wish I had another one to alternate between colors."},{"name":"Breck","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Fantastic Value Puffer Jacket","review":"Is this the best puffer jacket you can get? Probably not. Is it a fantastic value, high-quality puffer jacket for a fraction of the price of others? You betcha. Very pleased with this jacket. I did order a size up and I'm glad I did. I typically wear an XL, but I ordered an XXL so I can wear it over thicker hoodies and sweaters and I'm glad I did. I don't think the XL would be as comfortable over bulky layers. The XXL is almost too big though, I wish there was like a 1.5 or something. But I'm still very happy with it. It's a higher quality jacket than I was anticipating. It's very lightweight and packs up super small when you need it to. If you're looking for a quality jacket for chilly weather, you won't be disappointed."},{"name":"Jerry L.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Worth It","review":"If you need or want a good puff jacket that you can easily pack into your hiking pack and a just in case you need it jacket this is it. I have a Columbia one as well that is much warmer to be honest but I got this more for cool fall days, it is truly worth the price. When it gets wet I do not feel like it is making me wet so it has good weather resistance. If you are a guy who is not small order a size up than you normally would get, it will fit you much better."},{"name":"A-Aron","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great Versatile Jacket on Grand Canyon Backpacking Trip","review":"Took a risk on this budget jacket as a lightweight warm layer option during a three day Grand Canyon November backpacking trip. Setting out, I wore frog toggs on top of this jacket as a water resistant layer as we descended the south rim in a “winter mix” as one ranger referred to it, a sideways barrage of freezing rain and hail. We were moving at a good pace with 40lb packs, but this jacket kept me at a perfect temperature for all days of the hike. At night, I wore it to bed in a 20-degree sleeping bag and it kept me toasty as overnight temps were near freezing. I thought it might be a single use type of product, but I continue to wear it as a primary option out and about when I want to stay warm. I’ll likely take it on another trip and will happily do so. I wouldn’t trust it in a downpour, but it can take a short, light sprinkle without issue. Zipper is higher quality than expected, hood is prefect, comes with a small stash bag."},{"name":"Sush.Diss","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very comfortable","review":"This is a very lightweight yet effective jacket. Keeps you warm. It has two large pockets closed with zips (no chest pocket or inner pockets). The hood does not have a zip code to tighten around the face. The main zip slider is strangely on the left. It slides easily.\nBut this is a very comfortable jacket. Well worth the price. I ordered one size larger as my arms are longer than what it should be. So it fits slightly loose on the chest.\nOverall I like the jacket. Would recommend to others."},{"name":"Matt Morris","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Nice but baggy","review":"Nice jacket. Smooth, soft, warm, comfy. I'm a 41\" chest and it fits nicely around my shoulders chest and arms, but it's pretty baggy around the stomach. As there's no elastic at the bottom it's pretty loose. Will likely see if a tailor can put some elastic in it or something. Probably better off waiting to see if Trespass have anything in the Christmas sales to be honest."},{"name":"Kiran","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Good value for money","review":"100% Good value for money\nQuality is better than what I paid.\nOnly one suggestion or downside, this is not adjustable, they could easily make this adjustable but still deserves 5 star\nReduced 5 to 4 stares for the following reasons:\n1) Zipper is apposite side (this is not related to cost )\n2) Tested on moderate chilli wind and it doesn't stand. (I understand it is a lightweight but I expect it holds for moderate cold weather )"},{"name":"Jerry C.B.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Lightweight and good fit","review":"Accurate sizing.Comfortable fit;ideal for spring or autumn when weather is more unpredictable.Not easy to fit into bag provided but otherwise as good as expected.Slightly overpriced but, overall, no complaints."},{"name":"ardbigyin","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" dont like zip on womens side","review":"bought from  warehouse i bought xl iam roughly 46/48 maybe should have bought large as loose on me would not pay full price that amazon are asking for"}]},{"id":"7L3Uic","title":"Columbia Men's Ascender Softshell Jacket","imageUrl":"https://m.media-amazon.com/images/I/71gluQqwAYL._AC_UX342_.jpg","price":"$58.70","description":"Product Details\nFabric Type\n100% Polyester\nCare Instructions\nMachine Wash\nOrigin\nImported\nAbout this Item\nCOMFORT STRETCH: Crafted from 100% polyester that offers comfort stretch, this comfortable softshell makes for versatile wear — from the trail to the office.\nWATER RESISTANT: don't worry if it starts to drizzle or the wind picks up. The water-and-wind-resistant jacket has you covered.\nCLASSIC FIT: This softshell is made with a regular fit cut, for a classic design that you don't have to think twice about.\nHANDY FEATURES: Thoughtful touches include an abrasion resistant chin guard, zippered chest and hand pockets, adjustable cuffs, and an adjustable hem.\nBUILT TO LAST: Columbia’s attention to detail is what sets our apparel apart. Specifying only the highest quality materials, expert stitching, and craftsmanship. This is a long-lasting garment you will enjoy for seasons to come.\nDescription\n\nThis wind-and-water-resistant softshell will keep you warm—whether you want to stand out or blend right in. It's built for foul-weather outings, with a comfort stretch fit, an adjustable hem, and adjustable cuffs. Made of a durable yet light 100% polyester, with a soft, abrasion resistant chin guard and multiple zippered pockets. Columbia offers this jacket in multiple colors and sizes. Regular Fit. Extended sizing available. To ensure the size you choose is right, utilize our sizing chart and the following measurement instructions: For the sleeves, start at the center back of the neck and measure across the shoulder and down to the sleeve. If you come up with a partial number, round up to the next even number. For the chest, measure at the fullest part of the chest, under the armpits, and over the shoulder blades, keeping the tape measure firm and level.\n\nSee more\nAbout this Item","totalReviewCount":"10,704 global ratings","averageStarRating":"4.7/5","reviews":[{"name":"Justice A.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Most durable jacket I’ve ever owned.","review":"I have a black Ascender jacket I purchased back in 2016. I’ve worn it 3-5 times a week, 5 months a year for the last 6 years..\nI’ve done yard work, mechanic work, and carpentry work in it consistently during that time. I always knew I could i could throw it in the washer and it come out good as new with the same vibrant color. Until the fateful day I wore it while painting outside..\n\nAcrylic paint doesn’t come off easily, so I had to purchase another for wearing out to dinner and such.. Now my original jacket is worn solely for work and still; Another few months later, no holes or rips in the fabric, and the cuffs and collar are un-frayed and fit perfect.\nAmazing stuff!"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" The quality is still there for casual Columbia fans.","review":"I was spooked by some finger reviews saying the quality had drastically dropped but mine came in as advertised. I bought one of these jackets maybe 6 years ago now and I imagine this one will last as long. The only thing is I wished they had lined the collar with the fleece material like on my old one instead of leaving it bare.\n\nMedium fits me perfect for the weather I wear it in (40's to 50's with a t-shirt or light long sleeve shirt. Anything colder requires a heavier coat)."},{"name":"Mark W","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Nice jacket","review":"Jacket fits true to size (recommend using the sizing chart). Jacket works well and keeps you warm between 40-50 degrees. If you are looking to layer up with this jacket, I would recommend ordering the next size up. Overall very pleased with this jacket."},{"name":"Appaiah Mallu","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Good","review":"Good but my father told me it is bit tight."},{"name":"Thad Riley","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great quality","review":"I bought this jacket as a replacement for my previous Columbia jacket that I seem to have lost. That was a great jacket as well but the outer material was different, more of a nylon woven type of material. This jacket is more of a shell. The design is very sharp, smooth and simple. The material is extremely resistant to dirt. I was recently working an event where the jacket was under a table on a concrete floor for the entire day. I was worried about it getting very dirty, but when I pulled it out there was no dirt on it in spite of there being a lot of dust bunnies. Love the jacket and will replace it with the same kind when this one has lived its full life and moved on to jacket heaven."},{"name":"DaisyGirl51","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" He is between sizes so this was the perfect size to order. Will get a couple of years wear.","review":"Jacket is perfect. Our grandson thought his dad was \"sharp\" in his and loved it so we got him one for Christmas/ He wore it for his \"performance\" at his Christmas school program. He loved it!!"},{"name":"Edward G","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very love this jacket!","review":"Exactly what I need."},{"name":"Mor Messry","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" The perfect jacket for outdoor job. Thanks.","review":"excellent and good value for the price."},{"name":"David Far and Wide","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Not bad, solidly built. A bit too baggy for me.","review":"It's a really solidly built softshell - very substantial and definitely not for warm days. Keeps the wind out well and is styled in a way that means it's probably more towards casual wear than technical.\n\nI didn't really love it in the end though because the sizing was too much on the large size. I'm on the small size really - 37\" chest, 5'7 height - supposedly a SMALL in Columbia, but although this fit okay, it wasn't the technical or slim fit I was hoping for - more baggy and boxy, hanging off me rather than close to the body. Great if you want a wear a full weight fleece underneath I suppose."},{"name":"Colin C","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Excellent quality","review":"After some adjustment this now fits rather well and I am quite pleased although the price, including postage, is higher than direct from Columbia UK."},{"name":"Vincent Miller","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Excellent quality jacket","review":"Good quality jacket"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" Poor Quality Zipper","review":"After just a few months of wearing the jacket the zipper broke. Luckily  looked after our problem and had a new jacket sent to us. Columbia`s customer service department was TERRIBLE!!! They wanted me to send the jacket back at my cost so that they could evaluate whether it would be considered under warranty OR go to a tailor to have the zipper fixed. We live very remotely and the nearest tailor is over 2 hours away. When I asked whether there was another option they said NO. Again, Amazon came through for us and reafirmed why I love ordering from them. I won`t be ordering a Columbia product again and give their customer service department a 1 star rating."},{"name":"Allan Pendlebury","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Very comfortable but zipper broke after six months and little use.","review":"It is a very comfortable jacket. It seems to hold wind at bay and although I haven't been out in any heavy rain, just light rain that beaded on the jacket without soaking in. I did read another review where the zipper wasn't heavy enough. It isn't as heavy duty as my last, but so far works well. I will practice more care when doing it up; just in case.\n5/15/22: Edit: Just out walking dog in what I would say was moderate to heavy rain and stayed dry under jacket.\nSomething else I forgot to mention: I really like the breast zipper pocket to store my smartphone while hiking.\n10/24/22: Edit: Zipper broke this AM. I haven't worn it over summer so not that much use; have to reduce the stars to 1. Everything else is fine but it has become a throw away and search for another jacket with sturdy zipper."}]},{"id":"AhNG5m","title":"Wrangler Authentics Men's Long Sleeve Quilted Lined Flannel Shirt Jacket with Hood","imageUrl":"https://m.media-amazon.com/images/I/813Dgg2DflL._AC_UY445_.jpg","price":"$30.77","description":"Perfect for the cold winter days, the Wrangler authentic big and tall long sleeve quilted lined flannel shirt jacket with hood features quilted body interior, 2 side pockets and a brushed flannel exterior. The jacket offers a cotton blend hood offering more warmth and comfort, making this jacket a go to item for any man this winter.","totalReviewCount":"20,178 global ratings","averageStarRating":"4.6/5","reviews":[{"name":"Kirsten","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" It's a button up","review":"Got this as a gift for my boyfriend and it fits perfect and is good quality! Although, I didn't realize or pay attention to if this was a zip up jacket or button up but this jacket is a button up one. Super light weight and he wears it all the time and likes it."},{"name":"Sonia","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Light as a windbreaker!","review":"This jacket is really light, very similar to a windbreaker. Love the style, it’s a button up jacket with a hoodie. Will definitely use when it’s a little cool, more of a 70 degree jacket, not a 60 degree weather jacket."},{"name":"Kimberly Chamblin","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great flannel not too hot just right","review":"What a great shirt it's very well made soft and comfortable. Everything then some you would expect out of a great quality shirt. Very happy with this purchase"},{"name":"Litlmarn74","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Keeps you warm my son loves it.","review":"Flannels seem to be back in and this was a hit with my almost 20 yr old. Nice quality and warm when you don’t want a heavy coat."},{"name":"Audrey Olson","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" GREAT FLANNEL","review":"My son loved the fit, feel and style of this flannel with a hood. I really liked the color of it. He has been wearing it daily to and forth to the gym. Good price."},{"name":"Tiffany","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" PERFECT","review":"My husband absolutely loves this wrangler jacket. It is lightweight but it keeps him warm and it’s very comfortable. The hood is a plus and it’s true to size."},{"name":"Sandra","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Christmas present","review":"Bought as a Christmas present for my son. He loved the colors the fit. He said that it wasn’t to light or to heavy."},{"name":"TEBY","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" A little different type of material","review":"The material is different. It feels like more of a poly blend than 100% cotton. I guess it's for less shrinkage after drying."},{"name":"Ganie","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Warm and great fit.","review":"Medium size is perfect for me (5'-8\", 165lbs). The outer material is great and feels really good. The inside lining is warm enough for quick errands in this winter weather. Really nice color. Does not bleed during washing. 4-star rating is due to getting a bit deformed after the first wash. I think the outside material shrinked a little bit but the inside lining remained the same. Ironing could probably fix it but I am still not quite happy about it. But overall quality and fit is great."},{"name":"christopher gallagher","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Three Stars","review":"very little padding in the quilting"},{"name":"hdamoca","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Nice but huge. I mean HUGE.","review":"I bought this for my husband for Christmas. He's not a big guy but I figured it's , often clothes are way smaller than Canadian or US made clothes, so I went up 2 sizes. Wish I hadn't as the 2X is about 3 sizes too big. I sent the shirt back and reordered an Xlarge, it's still humungous, arms hanging past his fingertips. I worried that going down to a large would be too small after washing, so I kept the bigger size and hope it shrinks some. So, buy the size you'd buy in stores, don't size up or you'll be returning one too."},{"name":"Maya B.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great product","review":"My husband requested one of these for his ritualistic campfire every Saturday night to keep warm during the Canadian Autumn days. He received it and was well pleased. It was the right fit, perfect fit even, and was very comfortable. Mind you, my husband weighs about 210 lbs and is about 5'10\". It's only been one day, so I'll make sure to change my review if ever we find snags or issues with this jacket."},{"name":"Steve Bogdon","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" I like it but....","review":"I like it. That said I read the reviews and there were lots of people mentioning this should have a zipper rather than the buttons. I ordered it thinking the buttons would be fine, I was wrong.\n\nI still like this coat and wear it often but with the style, fit, and fabric weight.....a zipper would have been a nice feature.\n\nI would still order it again with the buttons but would order faster with a zipper."}]},{"id":"JkMkmM","title":"TACVASEN Men's Jackets-Windproof Bomber Jacket Full Zip Winter Warm Padded Coats Outwear","imageUrl":"https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/610DOILk1jL._AC_UX385_.jpg","price":"$46.98","description":"Product description","totalReviewCount":"5,064 global ratings","averageStarRating":"4.4/5","reviews":[{"name":"Ace Traveller","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very impressive for $50","review":"Let me start by saying that I have not had this jacket long enough to know how it will hold up over time but so far this jacket is amazing.\n\nFit\nAt 6'2\" / 200 (long legs) I was tempted to get the XL but got the Large as I wanted something really light as I have a full winter coat but could not be happier with sizing of the Large.\n\nMaterials\nThis jacket has a really soft and water resistant outer skin. I placed my arm under my water spigot and the water just bounced off and two quick shakes of my arm and it was dry. The inner liner is very good at storing body heat so you could probably get away with this being a three season jacket if you live in an area with relatively mild winters.\n\nFeatures\nThere are four pockets on the jacket I have, two traditional waist-level jacket pockets on the left and right with an inner pocket and an outer left arm pocket. The two hand pockets are decent but a little shallower than I expected. The inner pocket is nicely sized and readily falls to hand. I will likely never use left arm pocket as it feels odd to access and awkward to zip back up. Speaking of zippers, all of them appear to be of at least decent quality as the zippers feel decently robust and the tracks are metal. It is a bit annoying that the main zipper on this jacket is on the left which is different than any other jacket I have owned and takes a little brain retraining to get use to.\n\nOverall\nI have spent a lot of money on jackets in the past but also got my money's worth. I went a bit cheaper this time but I am pretty impressed even in the short time I've worn this one. I will add an edit if this impression changes due to unexpected quirks or wear."},{"name":"G Unit","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Wrinkled. Must steam.","review":"Jacket is nice. But shipped wrapped in plastic bag. Put in washer, hung to dry and then steamed on low setting to get all the wrinkles out. I would never wear the jacket as shipped. The wrinkles are bad."},{"name":"Kindle Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Good jacket","review":"I wore the official military flight jacket for years, i wore it out after 20 yrs, so I was looking for a replacement, and this came highly reviewed, so I figured what the heck. It arrived as stated, and in pretty flat shipping bag. I was alittle disappointed because it lack the sheen like the photo, but I wore it outside the next day, 50F, and sunny, I got really warm fast and had open up the zipper, it moves well and fit nice, will be my yard work and local hiking and walking jacket on those cool days."},{"name":"Woods13","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Early spring/late fall","review":"Decent coat for the money. Not as warm for winter weather as I had hoped. Polyester fill is fairly thin."},{"name":"Dave Garcia","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Cool jacket","review":"I bought this for my son-in-law for Christmas. He really liked it. He said even though it is not overly bulky, it was still warm. A good buy I think."},{"name":"Karleesha","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Keeps you warm , light weight , Great for the price","review":"No dislikes . The jacket was a Gift for my boyfriend for Christmas . He loves it ."},{"name":"Repairman","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Nice jacket, but the zipper is on the wrong side.","review":"Nice lightweight windbreaker jacket but the zipper is on the wrong side."},{"name":"Richard Morgan","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great Coat, Fast Shipping","review":"I love this coat, it is a good quality at a great price"},{"name":"AD VAN DYK","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" Flimsy, not thick at all","review":"I thought it would be much thicker. But it's really flimsy. Not suitable for winter at all. The size is good. I'm 6.2 and ordered an XL.\nI also have a real Alpha Industries genuine bomber jacket and it's 10x thicker than this one. Also the green is not like on the picture advertised.\nOH well, I'll wear it in the spring and fall."},{"name":"Canada Neu","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" YOU WILL NOT GET WHAT YOU SAW ON THEIR ADS.","review":"As first sight, it looked a well made wind breaker but details and quality don't match what they shown.\nJoint of elastic waistband and main body is single, not doubled stitches like their photo shown. Inside pocket is the same (single stitch). Zipper is cheap looking and not even close to what they showed on the photos. Pencil pocket is made with single layer of fabric with no thicken edge. If you use this, soon the fabric will be torn.\nSomeone mentioned that inside smells like old insulation. I agree. It has old hay like smell. I'm not sure if the smell goes away eventually. You need to order one size bigger than what you normally buy.\nWhat they showed as good features/quality are not there. You should check your jacket very closely if you bought one. The price is reasonable but YOU WILL NOT GET WHAT YOU SAW ON THEIR AD."},{"name":"Ryan Kells","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" My Review","review":"My jacket order was fast. Ordered on Sunday, received on Wednesday. Colour (navy) and quality as advertised. It;s not a puffy coat and it's not real thin. Somewhere in between. Size chart and sizing is accurate. I'm 5' 10, 210 lbs (size 46 suit jacket), I ordered an XL and it's great. My son is 5' 11\", 175 and the XL is not too big but L would be perfect. Zipper was a LITTLE wonky like others have mentioned in their reviews. All in all, very satisfied."},{"name":"Laurence Dube","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Nice quality and good looking but size chart is seems to be missing","review":"I like the material and model of this jacket. Tend to get puffed up a bit since there are air pocket in the insulation. Nothing major but this jacket won't drop super straight on you. Giving only 4 stars because middle zipper is a bit hard to start and there were a couple of loose threads of fabric I had to remove here and there. All seems ok but was not expecting to do this with a 50$ jacket. The size chart was missing to ended up ordering a Medium and a Large. I am 5'10'' and weight 180 lbs. Large was perfect for me. I am super satisfied of the look of the jacket."},{"name":"Kent","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Solid Lightweight & Warm","review":"For me this jacket is perfect! Zipper works great and YES it is LH but that is traditional in this style jacket. Just get used to that guys! Although it weighs next to nothing it slips on easily and is perfect warmth for me even here in Northern Ontario. Yeah dead of winter I will be layering anyway and I do have a parka this is the COLD NORTH! Most of the year this is going to a perfect casual jacket!\nI don't know why so many are complaining about the quality this is really nicely sewn and all the zippers work smoothly etc.. Do yourself a favor and give it a try!"}]},{"id":"dRNxAh","title":" Essentials Men's Full-Zip Polar Fleece Jacket (Available in Big & Tall)","imageUrl":"https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/816R2GcSWUS._AC_UX342_.jpg","price":"$12.08","description":"Amazon Essentials is focused on creating affordable, high-quality, and long-lasting everyday clothing you can rely on. Our line of men’s must-haves includes polo shirts, chino pants, classic-fit shorts, casual button-downs, and crew-neck tees. Our consistent sizing takes the guesswork out of shopping, and each piece is put to the test to maintain the highest standards in quality and comfort.","totalReviewCount":"34,358 global ratings","averageStarRating":"4.5/5","reviews":[{"name":"Texas Mimi","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Amazing bargain!","review":"My hubby loses jackets frequently because he's on a job site, takes them off and they disappear.\nHe needed (another) casual jacket. Nothing to big and heavy like a coat. Just something for cold mornings but easy to stash when the day warms up. I picked this jacket because of the cost, to be honest. $15?? I figured it would be thin and cheap but if he lost this one too, no great loss. What a surprise when it arrived. A nice mid-weight fleece, heavy duty zipper, looks good, and looks like something I paid a lot more for. He's even hanging on to this one and hasn't lost it yet! Highly recommend!11"},{"name":"DJL","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Cozy and warm! But sizing is kind of crazy.","review":"It's soft, relatively light, and warm. I planned to use it as an under-layer on bike rides, but now find that it is also quite comfortable to wear while puttering around indoors.\n\nThe sizing makes no sense.  displayed \"large will fit you best\", but large was hopelessly long and baggy. The one I'm wearing in the picture is a medium size, which is comfortable but still a little too long for use with an outer shell-type bicycling jacket. I also purchased a small in a different color (forest green), but it is slightly tight in the stomach -- and still too long!\n\nThe camo colored one (medium size) is made in Vietnam. The forest green (small size) one is from Indonesia, and seems slightly less soft."},{"name":"Brandon","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very good product","review":"I’ve always been told that I’m cheap. I don’t think that’s a fair description, I just like to find the best bang for my buck… and I like to reuse paper towels lol. If you can find this fleece on sale like I did, buy it. It’s a really good find. I live in Maryland and it’s cold out right now. This fleece fits great and is keeping me warm. I’m also impressed with its comfort and zippered pockets. The pockets are really useful because they are deep pockets. So if you put your phone in one and forget to zip it up, you don’t have the feeling that anything will slip out of your pocket as you bend over to pick something up off the floor (like I do 300 times a day with my four y/o daughter)"},{"name":"WannabeTechie","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Could be a North Face or Patagonia","review":"I'm 5' 9\" and 175 lbs. Got an XL b/c I like things a little loose. It does look a tad big on me but I would still get this over a L if you like loose clothing.\n\nOverall... great deal! This green/black look makes it look a little more unique than the other mono colors. If you were to slap a Patagonia or North Face logo on here, no one could ever know the difference. Warm and stylish."},{"name":"kcinAlaska","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Wow, Just Wow!","review":"I ordered one of these jackets for my husband in late summer. He loved it and wore in right into cold weather. He loved it so much that he had me order two more! He can no longer wear them in our Alaska winter weather, but since we keep our house at 68 degrees in the winter, he now wears one around the house. They are just perfect in every way - fit, comfort, warmth and, most of all: affordability. Oh, he wished me to add that they have great pockets - the outside pockets zip shut, plus there are two inner pockets. How could I forget that - he has raved about the pockets. Thank you so much."},{"name":"samlanus","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" PERFECRT， but ...","review":"12/07/2022 reviewed again: I bought two Large at the very first time.\nI am 5’7” tall.177lbs weight. It fits me perfectly. Three days after I receive them. I bought another one for myself again and two for my brothers. This  Essentials Polar fleece jacket is soft and warm. It’s thickness is medium, thick enough to keep me warm.. That’s why I would like to give 5 Stars Plus. I sewed the issue by myself.\nAmazon Essentially product lines are as reliable as just like Costco’s Kirkland brand. Love it.\n\nLarge size is perfect for me. I would like to give this fleece jacket 5 stars plus. Everything about the jacket is perfect. Very resonable price,very comfortable,very good quality... But the huge pockets inside have not sewn on purpose. I don't know why. The other brand of jackets with big pockets never have the issue like this.\nDon't put your cell phone inside the big pocket.\n\nSuggestion to Amazon: Please sew the pockets completely."},{"name":"Matthew Hall","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Excellent jacket, pleasantly exceeded expectations","review":"I bought it excepting a regular jacket similar to Walmart quality but I was surprised because this  Essentials jacket seemed closer to the quality from stores in a mall. I only planned on buying one because I won't need jackets that often where I live but I believe I'll buy a 2nd one, if anything to have a spare. If anyone is on the fence about it being a basic Amazon brand, in my experience it's as good as name brand."},{"name":"JustAnotherName12","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" So close....","review":"Long story short, this is the second fleece that I've bought over a couple of years. The first one that I purchased was in a regular size (not tall) and the fit was nice enough for me to wear holes in but the sleeves were a little on the short side. If I extended my arms out in front of me, the cuff of the sleeve would miss my wrist by about 4 inches. So with this purchase, I decided to account for that issue and I ordered a Tall size...now the cuff of the sleeves are like 5 inches too long. The rest of the fit is great, but the sleeve length needs to be dialed in a little better.\n\n(FYI, I'm only 6'1\" but I usually by Tall when ordering shirts)"},{"name":"✅ SteP ✅","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" ESSENTIAL NEL NOME MA NON DI FATTO - CALD, MORBIDO E PERFETTO PER IL FREDDO","review":"🟥 🟧 🟨 🟩 🟦 🟪 🟫🟥 🟧 🟨\n🚫 TEST E CONSIDERAZIONI: 🚫\n🟥 🟧 🟨 🟩 🟦 🟪 🟫🟥 🟧 🟨\nFelpa acquistata a marzo 2019 e recensisco ora, maggio 2020, a distanza di oltre 1 anno, dopo averla indossata parecchio, specialmente per stare nei dintorni di casa, non essendo elegante, ma davvero molto molto calda e pratica.\n\nLe lampo con cordino permettono di allacciarla e slacciarla al volo, sono davvero toste, sia quella per la chiusura della felpa che quelle delle tasche, sono lampo con chiusura femminile, ovvero al contrario di quella maschile, per intenderci il cursore lo farete scorrere con la mano destra anzichè con quella sinistra come sono abituati gli uomini, ma poco male è questione di abitudine.\n\nLa felpa è in pile, molto comodo, caldo e soffice, tiene davvero caldo in inverno pieno anche con venticello moderato, ovviamente se il vento è consistente l'aria passa, non essendo fatta di materiali wind stop.\n\nRisulta discretamente traspirante, tanto da non mettersi sonovuoto quando la indossate.\n\nIo sono alto 175cm e peso circa 72Kg, ho preso la taglia S e mi calza alla perfezione, stretta ma non troppo, perfetta di maniche. Le tasche con cerniera sono comode e profonde. Non si tratta di un capo alla moda ma adatto a coloro che lavorano e che necessitano di un indumento caldo per l'inverno da mettere magari sotto la giacca per poi poterlo utilizzare da solo in caso la giornata si scaldi leggermente.\n\nSono totalmente soddisfatto, nonostante le finiture non precise anzi, tutt'altro, il proprio dovere lo fa egregiamente, tiene caldo e dopo 1 anno di lavaggi praticamente settimanali è ancora soffice e perfetto, difficile pretendere di più.\n\n🟥 🟧 🟨 🟩 🟦 🟪\n🔹 CONCLUSIONI:🔹\n🟥 🟧 🟨 🟩 🟦 🟪\nAl prezzo di 18 euro a marzo 2019 (attualmente 19,99 euro) è difficile pretendere di più da questo genere di indumenti, non di certo adatti a situazioni eleganti ma pià che altro a situazioni pratiche in cui l'efficacia passa in secondo piano rispetto alla bellezza dell'indumento. Diversi colori disponibili ma il camouflage verde è quello che mi ha colpito di più.\n\nInserisco qualche foto e vi ringrazio per la lettura\nStefano"},{"name":"Arthur R.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" Zip","review":"Sadly this product was disappointing considering all the positive reviews.\nFirstly the zip fastener stuck and I put it down to being new or perhaps because it was on the LHS, but after numerous tries I decided it was faulty.\nAlso the L size fitted my arms in length and was comfortable but the body was way too small. And that's the problem with buying stuff on line. One man's large is another man's small.\nIt was however lightweight and what I wanted but..................."},{"name":"🇮🇹 Schälflj 🇮🇹","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Apprezzabile comfort, calore e vestibilità, nonostante la economicità del capo","review":"Mi piacciono le camicie e le giacche sportive a quadrettoni e quando ho notato questa giacca in pile della serie AMAZON ESSENTIALS, con delle caratteristiche in descrittiva che erano interessanti, ho deciso di acquistarla per utilizzarla in campagna nelle nostre zone collinari, anche durante le escursioni con i miei cani.\n\nLa giacca arriva in una busta trasparente perfettamente piegata e non appena rimosso il capo ho potuto subito constatare una apprezzabile QUALITA' complessiva della giacca tutto sommato discreta, pur sempre proporzionata alla caratteristica economica del prodotto.\n\nConsiderando che siamo infatti difronte ad una GIACCA in PILE di fascia economica e piuttosto sportiva, non mi è dispiaciuta la scelta del tessuto integralmente sintetico (100% poliestere) che sebbene si percepisce subito risulta comunque sufficientemente morbida e piacevole sulla pelle.\n\nApprezzabile ho trovato anche il suo CONFEZIONAMENTO sufficientemente curato ed attento ai particolari, come entrambe le TASCHE esterne con CHIUSURA a CERNIERA, la ampia TASCA INTERNA aperta e l’ELASTICO ai POLSINI, senza trascurare la CERNIERA LAMPO FRONTALE, che però presenta l’unico “difetto” di essere al contrario, ovvero al femminile, scelta che ammetto non ho compreso e che in alcune circostanze mi procura qualche rallentamento nella chiusura.\n\nA proposito della CERNIERA LAMPO, non si tratta di una marca nota YKK come indicato in alcune recensioni, ma in questa colorazione rosso-bisonte è una più economica che però svolge egregiamente il suo compito, con innesti sufficientemente precisi e scorrimenti fluidi in apertura come in chiusura, peccato solo per il montaggio al contrario a cui molti dovranno abituarsi.\n\nMi è piaciuta invece la tonalità del TESSUTO a QUADRETTONI rosso/blu dallo stile vagamente nord americano, con un PESO medio ed una sufficiente morbidezza, che mi ha piacevolmente sorpreso per il CALORE che garantisce, perfetto per la stagione fredda in arrivo.\n\nConsiderando inoltre la economicità di questo pile, trovo comunque gradevole il confezionamento della giacca, senza evidenti difetti e con quel colletto alto chiudibile con la cerniera lampo fin sotto il mento, per una linea complessiva piacevole che gli conferisce una certa personalità e carattere.\n\nIl TAGLIO è ovviamente sportivo ed indovinando la propria TAGLIA corretta, la VESTIBILITA' risulta comunque discreta.\nNeppure le MANICHE le ho trovate abbondanti in lunghezza come a volte accade ed avendo seguito le indicazioni in descrittiva ho scelto correttamente la M.\nSi tratta di una MISURA che per me che normalmente indosso giacche taglia 48 è risultata corretta, senza abbondanza ma una apprezzabile comodità, che mi permette di vestire il PILE con sotto anche una camicia, una polo o comunque un ulteriore capo.\n\nDopo aver considerato attentamente le misure indicate in descrittiva, come da altri evidenziato suggerisco di valutare di acquistare una TAGLIA IN MENO a quella che normalmente si è abituati a vestire, si tratta infatti di un capo che veste largo e non ho neppure riscontrato la vita stretta come segnalata nelle descrizioni.\n\nNel cercare di offrire dei riferimenti i più precisi possibili in relazione alle MISURE della TAGLIA M da me ordinata, se vado a misurare la giacca a riposo su un appendiabiti, i valori che posso confermare sono:\nTORACE (solo frontale) 54.5 cm, SPALLE 43 cm, VITA (solo frontale) 52 cm, MANICA 65 cm da fine spalla a polsino.\n\nLa giacca si indossare bene, non lega, non vincola nei movimenti, consentendo di vestire sotto ancora un ulteriore capo non troppo aderente come una camicia.\nIl capo infatti non stringe ne a vita come neppure sulle spalla e garantisce quel calore che potrà migliorare il comfort quotidiano durante i primi abbassamenti di temperature di fine autunno - inizio inverno, pur non essendo eccessivamente spesso.\n\nLe CUCITURE e quindi il confezionamento del tessuto, risultano discrete e sempre in linea con la tipologia sportiva/economica del capo, un pile che comunque non stona abbinato ad un paio di pantaloni sportivi, anche dei semplici jeans, per una abbigliamento molto informale e pratico che trovo apprezzabile nella nostra zona collinare di campagna, ma anche da utilizzare semplicemente in giardino o durante le escursioni con i nostri cani.\n\nNel complesso mi sento quindi di promuovere questa giacca della serie AMAZON ESSENTIALS, per le caratteristiche complessive del capo, acquistato a fine ottobre 2022 al PREZZO di 12.45 euro nella taglia M color ROSSO BISONTE, un costo che ritengo equilibrato.\nL'ultima verifica che andrà fatta è la reazione del tessuto dopo i primi lavaggi, ma è probabile che valuterò di acquistare altre colorazioni più classiche.\n\nIn quanto alla spedizione e consegna da parte di , sono state anche in questa circostanza efficienti e puntuali grazie al servizio Prime.\nMi auguro che questa recensione possa essere di aiuto e se avete dubbi o quesiti non esitate a chiedere."},{"name":"Mr D","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Less is more.","review":"This may not be the best fleece jacket you will ever own, but it could well be the best value for money. Fleece is a fairly basic material that is reasonably warm, highly breathable and fairly light weight, compared to say wool. However it offers almost no protection against wind or rain so is best suited to being worn as a mid layer.\nThis jacket offers almost no frills e.g. no shoulder or elbow reinforced patches, no 2 way zip and not even a hem cord with cord locks. However most of these features merely add weight and cost and provide very little benefit in the real world.\nUltimately what really matters are decent materials, good quality construction and accurate sizing and happily this jacket is very good when it comes to these criteria.\nOverall this jacket provides good warmth, from a mid weight material, being around twice the weight of a micro fleece fabric. It fits me very well and the slightly elasticated cuffs and hem are sufficient to keep out any draughts. There are two hand warming outer pockets with zips and additionally 2 large inside “poacher” pockets big enough for a Ordnance Survey map but much more likely to be used for a hat or light weight windproof shirt/waterproof smock. The poacher pockets also provide a useful double layer of insulation, like wise the collar also has double thickness of material\nIf worn under a Goretex type jacket you may miraculously find that the jacket suddenly becomes far less leak prone. This is because around 99% of the moisture inside the jacket is not in fact rain coming in, but sweat that cannot get out, but can be managed very effectively by the fleece."},{"name":"B.M.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Good, with flaws","review":"Other reviewers have complained about the zip on “wrong” side, but a more serious problem is that the 2 very useful inside pockets have slit holes in the bottom (maybe to allow MP3 headphones to be threaded through?) which makes them useless for keys, coins, smaller phones (my iPhone SE goes straight through). So you need an obliging lady with needle and thread to fix this first before you lose your stuff. Otherwise, an OK fleece, with two front zip pockets, rather loose fit on the chest, but good value for money."}]},{"id":"Z7o6r2","title":"Levi's Men's Trucker Jacket","imageUrl":"https://m.media-amazon.com/images/I/71NLhtuespL._AC_UX342_.jpg","price":"$39.97","description":"Product Details\nFabric Type\n100% Cotton\nCare Instructions\nMachine Wash\nOrigin\nImported\nAbout this Item\nSits at waist\nLoose through seat and thigh\nStraight leg\nThe model in the image is 6' 4\" and is wearing Medium.\nDescription\n\nThe original jean jacket since 1967. A symbol of self-expression for decades, and a great starting point for customization. Gets better over time from natural wear with fading, stains and holes.\n\nSee more\nAbout this Item","totalReviewCount":"17,305 global ratings","averageStarRating":"4.6/5","reviews":[{"name":"johnnyjohnny","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" AS GOOD AS YOU'D EXPECT","review":"so, like, who hasn't had one of these Levi's trucker jackets, and doesn't know how great they are. just amazing.\nbut for years now i've been seeing thick denim work or Western shirts, which i bought, but started thinking how great one of these jackets would look used as a shirt. especially one of the already distressed ones. so after about 5 years of thinking this, i got one just for that purpose.\ni normally wear an XL in these jackets when using them as a jacket, but as a shirt i went down a size and it's perfect...better fitting than most of my shirts prior to washing/shrinking them. i got the distressed black, so it's a bit more 'shirt'like. i have to say if anyone is considering doing this i highly recommend it. it does give you a bit of the Elvis '68 Special look, which is never a bad thing, except of course this is not leather. but it does have the thickness and so it's very similar to that look. i wear mine a la The Kind, with the collar turned up, and like how the bottom sits just below the beltline on my...you guessed it, Levi's bootcut jeans.\nso, you may already know how cool these jax are as jax, but not you can wear them all the time, even when no jacket is needed....as a shirt. one of the pleasures in life."},{"name":"Drew Rummel","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Exactly how a jean jacket is supposed to be","review":"Love it. Blast from the past. I grew up wearing these in the 80s. They're still pretty much the typical classic jean jacket and are exactly how they are supposed to be. Fit and feel exactly as they should. Unless you're a youngster or just have unrealistic expectations theres nothing to complain about with these. They are what they are."},{"name":"RGB","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Best yesterday and today","review":"50 years ago levi trucker jackets were the very best in style, material and craftsmanship. Today it still is. I have two jackets. 1 sized to wear over sweaters etc and another over Ts and lightweight shirts. I highly recommend. I'm 69 yo and could change brands but the others are just not like a Levi. My sizes are 3x & 2x. The 100% cotton version is only version for me. Not stretchy. My chosen sizes are room enough and movement is zero problems. Final thought, the cotton weight is medium to light heavy. Perfect feel for durability proven wear for work or just because you look so good in an authentic Levi trucker jacket."},{"name":"Mattea Williams","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect","review":"I wanted a normal length Jean jacket, and it’s hard to find when you are a taller female. I actually have a female Levi’s trucker jacket and it looks cropped on me. Apparently it still looks good but it’s not what I was going for. BUT THIS is perfect. It’s slightly oversized on me but but loose enough I can comfortably wear a hoody under it. I’m ecstatic. This also appears to be authentic Levi’s, if anyone is worried about getting knock offs off . I will made and comfortable.\n\nJust in case it doesn’t show for some reason, I got a large. 5’10 female approximately 200lbs, fit."},{"name":"Chloe","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great","review":"I got this as a gift for my bf and he loves it, I looks great on him. I recommend"},{"name":"L. Underwood","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Husband loved it!","review":"Fit as I had hoped it would for my husband who wears XXL shirts. He is happy enough with this jacket to replace his well worn old one."},{"name":"W Harvey","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great Jacket","review":"I was really worried about ordering this jacket because of all the reviews, but this jacket is perfect. The fit is perfect (you don’t have order a size up) and the jacket looks great! Just like the one I had in high school!"},{"name":"Shawny Alan","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Good wear, comfortable and cant beat the price","review":"Very comfortable fits just right, I played it safe and picked Large, I would normally pick Medium but I want extra room in case I want to layer shirts or t-shirt. I like the hoodie style and the arms have that sweatshirt stretch feel.\n\n-Just in case go a size up if you think jacket will be tight, For reference I compared it to my normal levi's medium denim, and this hoodie version feels much more comfortable, from eyeing both they look the same size, minus the hood on this one I bought.\n\nI am 5'6 male with medium build.\n\ntag says made in china\n\nno issues with delivery\n\nI already know which levi's i'll buy next."},{"name":"Robert Evans","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Levi Trucker 2 Jacket","review":"Absolutely love this jacket. The fit is as expected and has two deep inside pockets.\nThe denim is rigid and of very high quality - unfortunately rigid 501 jeans in the UK are titled classic/vintage and cost upwards of £130.00. I therefore order mind direct from the USA - Rocky Mountain Connection in Colorado offer excellent service."},{"name":"Garry","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" I need the return address","review":"Too big!"},{"name":"mike","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great looking hoodie","review":"As expected from Levi a great looking hybrid that attracts attention and comments\nfantastic idea"},{"name":"Sky","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" The Original white Levi","review":"Happy with the jacket Bot Happy to have to pay import duty of 25%!!!"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Reliable servivce","review":"Exactly what I wanted"}]},{"id":"1HNQ5O","title":"Haellun Men's Long Sleeve Sherpa Lined Shirt Jacket Flannel Plaid Fleece Coats","imageUrl":"https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/71vbA21ljyL._AC_UY445_.jpg","price":"$49.98","description":"Product Details\nFabric Type\nCotton\nCare Instructions\nHand Wash Only\nOrigin\nImported\nAbout this Item\nMaterial: Made of 85% Cotton,Sherpa Lined,soft and skin-friendly\nDesign: Regular fit, Classic lapel collar, yellowstone style, cotton fabric plaid splicing, one chest pocket with button, Great shirt winterwear for men. Plush Thicked Fuax Fur Fleece Sherpa Lining. Soft and Comfy to wear, mid-weight and warmth keeping\nWarm Protection: Constructed with comfortable flannel corduroy fabric, this splicing shirt has both warmth and breathability to keep you thermal in chill weather. Wear alone or with additional layers in cooler temperatures\nGreat gift & Suitable occasion: This sherpa lined cotton shirt jacket is built for warm,function and style. Good gift for your husband/ boyfriend/ father/ brothers on vacation, like Christmas. Perfect for many cold winter and autumn occasions like: hanging out, dating, working, camping, fishing and other daily\nUS SIZE for selection, Machine / Hand Wash softly\nSee more\nAbout this Item","totalReviewCount":"1,029 global ratings","averageStarRating":"4.5/5","reviews":[{"name":"schotz","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Light weight but warm","review":"This was a Christmas gift for my husband. He loves it. He said it was just what he wanted. He says it’s warm but not too heavy. He loves all the pockets and really likes the fact it has snaps. Easy on and off. The color was neutral will go with anything. Price was a little much for just a little jacket but bottom line I would buy again. Just what I was looking for. Thanks  for fast shipping. Just in time."},{"name":"GloWorm","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Update","review":"The product itself is nice material and looks like the right size but it was missing a button right out of the package. I hope the replacement gets here quickly, its a Christmas present. Will update.\n\nThe product was replaced very quickly and is perfect! As I said it is a Xmas gift, but I took it out and the lining is soft and the jacket looks just as pictured. It is not a heavy winter coat for sure, just casual wear, which I knew and is perfect :)"},{"name":"NML","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Husband loves it","review":"Great fit and husband loves it!"},{"name":"Blake wilkins","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Fits a little tight","review":"Very warm and comfortable just fits a little tight"},{"name":"Pam Gordon","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" So many compliments!","review":"Super comfortable and dresses up your outfit"},{"name":"Brooke","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Good materials","review":"Very nice materials used, just as pictured."},{"name":"Amanda Crane","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great for my Welder","review":"Product fits great and so far is wearing well through his days at work"},{"name":"James N.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" It is a present quite happy with it","review":"Happy wit my purchase it is a gift for my Mom !"},{"name":"customer man","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Cheap quality, same jacket from \"Alpha Wolf Tactical\" scam company","review":"After making the mistake of ordering off of a Facebook ad through a friend's recommendation, the jacket I got was thin, cheap, and dirty. After looking for a thicker, neck protecting variant, I discovered this product alongside a few others.\n\nAfter receiving it, I quickly realized that it is the SAME CHEAP JACKET from the Philippine fraudulent company that I ordered from. Both were cheap, flimsy, not thick at all for any sort of cold weather activity.\n\nTell me, in that photo I attached, can you tell me which one is the Haellun Men's Jacket?"},{"name":"Oma","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Not accurate sizing. But a nice quality.","review":"Gift. Sizing is not great."},{"name":"Clorinda Djordjevic","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Cowboy shirt","review":"Nice, would recommend, quality is great, true to size and picture shown"}]},{"id":"8_a1uz","title":" Essentials Men's Full-Zip Polar Fleece Jacket (Available in Big & Tall)","imageUrl":"https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81McI2xG3NS._AC_UX342_.jpg","price":"$12.08","description":"Amazon Essentials is focused on creating affordable, high-quality, and long-lasting everyday clothing you can rely on. Our line of men’s must-haves includes polo shirts, chino pants, classic-fit shorts, casual button-downs, and crew-neck tees. Our consistent sizing takes the guesswork out of shopping, and each piece is put to the test to maintain the highest standards in quality and comfort.","totalReviewCount":"34,358 global ratings","averageStarRating":"4.5/5","reviews":[{"name":"Texas Mimi","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Amazing bargain!","review":"My hubby loses jackets frequently because he's on a job site, takes them off and they disappear.\nHe needed (another) casual jacket. Nothing to big and heavy like a coat. Just something for cold mornings but easy to stash when the day warms up. I picked this jacket because of the cost, to be honest. $15?? I figured it would be thin and cheap but if he lost this one too, no great loss. What a surprise when it arrived. A nice mid-weight fleece, heavy duty zipper, looks good, and looks like something I paid a lot more for. He's even hanging on to this one and hasn't lost it yet! Highly recommend!11"},{"name":"DJL","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Cozy and warm! But sizing is kind of crazy.","review":"It's soft, relatively light, and warm. I planned to use it as an under-layer on bike rides, but now find that it is also quite comfortable to wear while puttering around indoors.\n\nThe sizing makes no sense.  displayed \"large will fit you best\", but large was hopelessly long and baggy. The one I'm wearing in the picture is a medium size, which is comfortable but still a little too long for use with an outer shell-type bicycling jacket. I also purchased a small in a different color (forest green), but it is slightly tight in the stomach -- and still too long!\n\nThe camo colored one (medium size) is made in Vietnam. The forest green (small size) one is from Indonesia, and seems slightly less soft."},{"name":"Brandon","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very good product","review":"I’ve always been told that I’m cheap. I don’t think that’s a fair description, I just like to find the best bang for my buck… and I like to reuse paper towels lol. If you can find this fleece on sale like I did, buy it. It’s a really good find. I live in Maryland and it’s cold out right now. This fleece fits great and is keeping me warm. I’m also impressed with its comfort and zippered pockets. The pockets are really useful because they are deep pockets. So if you put your phone in one and forget to zip it up, you don’t have the feeling that anything will slip out of your pocket as you bend over to pick something up off the floor (like I do 300 times a day with my four y/o daughter)"},{"name":"WannabeTechie","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Could be a North Face or Patagonia","review":"I'm 5' 9\" and 175 lbs. Got an XL b/c I like things a little loose. It does look a tad big on me but I would still get this over a L if you like loose clothing.\n\nOverall... great deal! This green/black look makes it look a little more unique than the other mono colors. If you were to slap a Patagonia or North Face logo on here, no one could ever know the difference. Warm and stylish."},{"name":"kcinAlaska","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Wow, Just Wow!","review":"I ordered one of these jackets for my husband in late summer. He loved it and wore in right into cold weather. He loved it so much that he had me order two more! He can no longer wear them in our Alaska winter weather, but since we keep our house at 68 degrees in the winter, he now wears one around the house. They are just perfect in every way - fit, comfort, warmth and, most of all: affordability. Oh, he wished me to add that they have great pockets - the outside pockets zip shut, plus there are two inner pockets. How could I forget that - he has raved about the pockets. Thank you so much."},{"name":"samlanus","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" PERFECRT， but ...","review":"12/07/2022 reviewed again: I bought two Large at the very first time.\nI am 5’7” tall.177lbs weight. It fits me perfectly. Three days after I receive them. I bought another one for myself again and two for my brothers. This  Essentials Polar fleece jacket is soft and warm. It’s thickness is medium, thick enough to keep me warm.. That’s why I would like to give 5 Stars Plus. I sewed the issue by myself.\nAmazon Essentially product lines are as reliable as just like Costco’s Kirkland brand. Love it.\n\nLarge size is perfect for me. I would like to give this fleece jacket 5 stars plus. Everything about the jacket is perfect. Very resonable price,very comfortable,very good quality... But the huge pockets inside have not sewn on purpose. I don't know why. The other brand of jackets with big pockets never have the issue like this.\nDon't put your cell phone inside the big pocket.\n\nSuggestion to Amazon: Please sew the pockets completely."},{"name":"Matthew Hall","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Excellent jacket, pleasantly exceeded expectations","review":"I bought it excepting a regular jacket similar to Walmart quality but I was surprised because this  Essentials jacket seemed closer to the quality from stores in a mall. I only planned on buying one because I won't need jackets that often where I live but I believe I'll buy a 2nd one, if anything to have a spare. If anyone is on the fence about it being a basic Amazon brand, in my experience it's as good as name brand."},{"name":"JustAnotherName12","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" So close....","review":"Long story short, this is the second fleece that I've bought over a couple of years. The first one that I purchased was in a regular size (not tall) and the fit was nice enough for me to wear holes in but the sleeves were a little on the short side. If I extended my arms out in front of me, the cuff of the sleeve would miss my wrist by about 4 inches. So with this purchase, I decided to account for that issue and I ordered a Tall size...now the cuff of the sleeves are like 5 inches too long. The rest of the fit is great, but the sleeve length needs to be dialed in a little better.\n\n(FYI, I'm only 6'1\" but I usually by Tall when ordering shirts)"},{"name":"✅ SteP ✅","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" ESSENTIAL NEL NOME MA NON DI FATTO - CALD, MORBIDO E PERFETTO PER IL FREDDO","review":"🟥 🟧 🟨 🟩 🟦 🟪 🟫🟥 🟧 🟨\n🚫 TEST E CONSIDERAZIONI: 🚫\n🟥 🟧 🟨 🟩 🟦 🟪 🟫🟥 🟧 🟨\nFelpa acquistata a marzo 2019 e recensisco ora, maggio 2020, a distanza di oltre 1 anno, dopo averla indossata parecchio, specialmente per stare nei dintorni di casa, non essendo elegante, ma davvero molto molto calda e pratica.\n\nLe lampo con cordino permettono di allacciarla e slacciarla al volo, sono davvero toste, sia quella per la chiusura della felpa che quelle delle tasche, sono lampo con chiusura femminile, ovvero al contrario di quella maschile, per intenderci il cursore lo farete scorrere con la mano destra anzichè con quella sinistra come sono abituati gli uomini, ma poco male è questione di abitudine.\n\nLa felpa è in pile, molto comodo, caldo e soffice, tiene davvero caldo in inverno pieno anche con venticello moderato, ovviamente se il vento è consistente l'aria passa, non essendo fatta di materiali wind stop.\n\nRisulta discretamente traspirante, tanto da non mettersi sonovuoto quando la indossate.\n\nIo sono alto 175cm e peso circa 72Kg, ho preso la taglia S e mi calza alla perfezione, stretta ma non troppo, perfetta di maniche. Le tasche con cerniera sono comode e profonde. Non si tratta di un capo alla moda ma adatto a coloro che lavorano e che necessitano di un indumento caldo per l'inverno da mettere magari sotto la giacca per poi poterlo utilizzare da solo in caso la giornata si scaldi leggermente.\n\nSono totalmente soddisfatto, nonostante le finiture non precise anzi, tutt'altro, il proprio dovere lo fa egregiamente, tiene caldo e dopo 1 anno di lavaggi praticamente settimanali è ancora soffice e perfetto, difficile pretendere di più.\n\n🟥 🟧 🟨 🟩 🟦 🟪\n🔹 CONCLUSIONI:🔹\n🟥 🟧 🟨 🟩 🟦 🟪\nAl prezzo di 18 euro a marzo 2019 (attualmente 19,99 euro) è difficile pretendere di più da questo genere di indumenti, non di certo adatti a situazioni eleganti ma pià che altro a situazioni pratiche in cui l'efficacia passa in secondo piano rispetto alla bellezza dell'indumento. Diversi colori disponibili ma il camouflage verde è quello che mi ha colpito di più.\n\nInserisco qualche foto e vi ringrazio per la lettura\nStefano"},{"name":"Arthur R.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" Zip","review":"Sadly this product was disappointing considering all the positive reviews.\nFirstly the zip fastener stuck and I put it down to being new or perhaps because it was on the LHS, but after numerous tries I decided it was faulty.\nAlso the L size fitted my arms in length and was comfortable but the body was way too small. And that's the problem with buying stuff on line. One man's large is another man's small.\nIt was however lightweight and what I wanted but..................."},{"name":"🇮🇹 Schälflj 🇮🇹","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Apprezzabile comfort, calore e vestibilità, nonostante la economicità del capo","review":"Mi piacciono le camicie e le giacche sportive a quadrettoni e quando ho notato questa giacca in pile della serie AMAZON ESSENTIALS, con delle caratteristiche in descrittiva che erano interessanti, ho deciso di acquistarla per utilizzarla in campagna nelle nostre zone collinari, anche durante le escursioni con i miei cani.\n\nLa giacca arriva in una busta trasparente perfettamente piegata e non appena rimosso il capo ho potuto subito constatare una apprezzabile QUALITA' complessiva della giacca tutto sommato discreta, pur sempre proporzionata alla caratteristica economica del prodotto.\n\nConsiderando che siamo infatti difronte ad una GIACCA in PILE di fascia economica e piuttosto sportiva, non mi è dispiaciuta la scelta del tessuto integralmente sintetico (100% poliestere) che sebbene si percepisce subito risulta comunque sufficientemente morbida e piacevole sulla pelle.\n\nApprezzabile ho trovato anche il suo CONFEZIONAMENTO sufficientemente curato ed attento ai particolari, come entrambe le TASCHE esterne con CHIUSURA a CERNIERA, la ampia TASCA INTERNA aperta e l’ELASTICO ai POLSINI, senza trascurare la CERNIERA LAMPO FRONTALE, che però presenta l’unico “difetto” di essere al contrario, ovvero al femminile, scelta che ammetto non ho compreso e che in alcune circostanze mi procura qualche rallentamento nella chiusura.\n\nA proposito della CERNIERA LAMPO, non si tratta di una marca nota YKK come indicato in alcune recensioni, ma in questa colorazione rosso-bisonte è una più economica che però svolge egregiamente il suo compito, con innesti sufficientemente precisi e scorrimenti fluidi in apertura come in chiusura, peccato solo per il montaggio al contrario a cui molti dovranno abituarsi.\n\nMi è piaciuta invece la tonalità del TESSUTO a QUADRETTONI rosso/blu dallo stile vagamente nord americano, con un PESO medio ed una sufficiente morbidezza, che mi ha piacevolmente sorpreso per il CALORE che garantisce, perfetto per la stagione fredda in arrivo.\n\nConsiderando inoltre la economicità di questo pile, trovo comunque gradevole il confezionamento della giacca, senza evidenti difetti e con quel colletto alto chiudibile con la cerniera lampo fin sotto il mento, per una linea complessiva piacevole che gli conferisce una certa personalità e carattere.\n\nIl TAGLIO è ovviamente sportivo ed indovinando la propria TAGLIA corretta, la VESTIBILITA' risulta comunque discreta.\nNeppure le MANICHE le ho trovate abbondanti in lunghezza come a volte accade ed avendo seguito le indicazioni in descrittiva ho scelto correttamente la M.\nSi tratta di una MISURA che per me che normalmente indosso giacche taglia 48 è risultata corretta, senza abbondanza ma una apprezzabile comodità, che mi permette di vestire il PILE con sotto anche una camicia, una polo o comunque un ulteriore capo.\n\nDopo aver considerato attentamente le misure indicate in descrittiva, come da altri evidenziato suggerisco di valutare di acquistare una TAGLIA IN MENO a quella che normalmente si è abituati a vestire, si tratta infatti di un capo che veste largo e non ho neppure riscontrato la vita stretta come segnalata nelle descrizioni.\n\nNel cercare di offrire dei riferimenti i più precisi possibili in relazione alle MISURE della TAGLIA M da me ordinata, se vado a misurare la giacca a riposo su un appendiabiti, i valori che posso confermare sono:\nTORACE (solo frontale) 54.5 cm, SPALLE 43 cm, VITA (solo frontale) 52 cm, MANICA 65 cm da fine spalla a polsino.\n\nLa giacca si indossare bene, non lega, non vincola nei movimenti, consentendo di vestire sotto ancora un ulteriore capo non troppo aderente come una camicia.\nIl capo infatti non stringe ne a vita come neppure sulle spalla e garantisce quel calore che potrà migliorare il comfort quotidiano durante i primi abbassamenti di temperature di fine autunno - inizio inverno, pur non essendo eccessivamente spesso.\n\nLe CUCITURE e quindi il confezionamento del tessuto, risultano discrete e sempre in linea con la tipologia sportiva/economica del capo, un pile che comunque non stona abbinato ad un paio di pantaloni sportivi, anche dei semplici jeans, per una abbigliamento molto informale e pratico che trovo apprezzabile nella nostra zona collinare di campagna, ma anche da utilizzare semplicemente in giardino o durante le escursioni con i nostri cani.\n\nNel complesso mi sento quindi di promuovere questa giacca della serie AMAZON ESSENTIALS, per le caratteristiche complessive del capo, acquistato a fine ottobre 2022 al PREZZO di 12.45 euro nella taglia M color ROSSO BISONTE, un costo che ritengo equilibrato.\nL'ultima verifica che andrà fatta è la reazione del tessuto dopo i primi lavaggi, ma è probabile che valuterò di acquistare altre colorazioni più classiche.\n\nIn quanto alla spedizione e consegna da parte di , sono state anche in questa circostanza efficienti e puntuali grazie al servizio Prime.\nMi auguro che questa recensione possa essere di aiuto e se avete dubbi o quesiti non esitate a chiedere."},{"name":"Mr D","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Less is more.","review":"This may not be the best fleece jacket you will ever own, but it could well be the best value for money. Fleece is a fairly basic material that is reasonably warm, highly breathable and fairly light weight, compared to say wool. However it offers almost no protection against wind or rain so is best suited to being worn as a mid layer.\nThis jacket offers almost no frills e.g. no shoulder or elbow reinforced patches, no 2 way zip and not even a hem cord with cord locks. However most of these features merely add weight and cost and provide very little benefit in the real world.\nUltimately what really matters are decent materials, good quality construction and accurate sizing and happily this jacket is very good when it comes to these criteria.\nOverall this jacket provides good warmth, from a mid weight material, being around twice the weight of a micro fleece fabric. It fits me very well and the slightly elasticated cuffs and hem are sufficient to keep out any draughts. There are two hand warming outer pockets with zips and additionally 2 large inside “poacher” pockets big enough for a Ordnance Survey map but much more likely to be used for a hat or light weight windproof shirt/waterproof smock. The poacher pockets also provide a useful double layer of insulation, like wise the collar also has double thickness of material\nIf worn under a Goretex type jacket you may miraculously find that the jacket suddenly becomes far less leak prone. This is because around 99% of the moisture inside the jacket is not in fact rain coming in, but sweat that cannot get out, but can be managed very effectively by the fleece."},{"name":"B.M.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Good, with flaws","review":"Other reviewers have complained about the zip on “wrong” side, but a more serious problem is that the 2 very useful inside pockets have slit holes in the bottom (maybe to allow MP3 headphones to be threaded through?) which makes them useless for keys, coins, smaller phones (my iPhone SE goes straight through). So you need an obliging lady with needle and thread to fix this first before you lose your stuff. Otherwise, an OK fleece, with two front zip pockets, rather loose fit on the chest, but good value for money."}]},{"id":"2XwQ1A","title":"CHEXPEL Men's Thick Winter Jackets with Hood Fleece Lining Cotton Military Jackets Work Jackets with Cargo Pockets","imageUrl":"https://m.media-amazon.com/images/I/81l64GsIcsL._AC_UX385_.jpg","price":"$57.76","description":"Product Details\nFabric Type\nOutshell: 100% Cotton; Lining: 100% Polyester\nCare Instructions\nMachine Wash\nOrigin\nImported\nAbout this Item\nFRIENDLY Note: The zipper is located on the left.This is a thin fashion jacket with a thin detachable hat, with a beautiful patch on the left chest and the right arm, and lights up this jacket.\nMaterial:Outer Fabric:100% Cotton,Fleece Lining:100% Polyester,Soft and Thick Fleece Lining adds insulation to make us more comfortable,Front Buttons with leather Closure and Front full Zipper Closure,Elastic cuffs,effective wind protection,Let this winter jacket succeeded.\nStructure:This jacket has a lot of pockets,almost satisfying all your needs.There are 8 pockets,2 Button Flap Pockets,2 Slant Hand Pockets,2 Button Flap Pockets on Chest,1 Inner Hidden Pocket On Left Chest,1 Pocket On The Left Sleeve.\nDurable:Sophisticated workmanship,each seam is a very precise car method,very suitable for autumn and winter season.For outdoor sports,homes,hiking,hiking,camping,skiing,and leisure everyday wear is a very lot of choices.\nSize Reminder：This jacket is a standard size of the US, please refer to the size table below when ordering order(handmade measurement will have a 0.2-0.8 inches of errors),if you are not satisfied with our products,please contact us,we will Provide you with a satisfactory solution.\nSee more\nAbout this Item","totalReviewCount":"911 global ratings","averageStarRating":"4.4/5","reviews":[{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Actually a really nice jacket!","review":"I’m 6’4” and slim. I normally wear a medium and this actually fit me perfectly! Has a little wiggle room too in case you have a little more meat on your bones than I do but I am genuinely happy with this! The fit is great and its a very comfortable and warm jacket. Now do be aware the patches just say “fashion” which I think is hilarious. When someone wearing high-dollar stuff asks what brand it is, you can just say, “oh, youre arent familiar?” And just walk away. Or take them off and put your own on. Either way, a nice jacket. ORDER YOUR NORMAL SIZE"},{"name":"Alejandro Andraca","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great Jacket for its Price","review":"I cannot say this is the warmest jacket I have ever bought, but it is up there. The cotton fleece lining on this jacket is comfy and warm. I like the style of the jacket. It's not a heavy jacket per say but it is not light for it to feel useless in winter. Overall, I recommend this nice jacket. Great price for it."},{"name":"Joe","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Nice jacket, unreliable shipping","review":"I've ordered from this company twice, and both times it took about a month to receive the product. They kept changing the date of delivery. First, it was a week. Then they said it was delayed and would arrive in two weeks, then three weeks, then four weeks.\n\nAlso, the jacket is nice, but their sizes run small, so order a size larger than what you normally buy."},{"name":"Edgardo Acevedo","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Very nice prosu t","review":"If you are large in shirts you can buy a Large jacket or if you want a jacket loose choose XL.\n\nIm 6'2\" average body size: I can fit in L but I prefer XL for extra space between shirt and jacket."},{"name":"Shannielle Baird","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" good quality but runs small","review":"For this for my son. He loved it but it was too small. I'd order up a size."},{"name":"spottedwolf","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Good warm jacket","review":"Jacket is great, ordered a 2x should've got a 3x, they stretch though after you wear it, so no biggie!. Keeps you nice and warm, nice fur lining.. Zippered attach hood, hood is also lined with fur, big/roomy hood that you can pull over your hat.. Alotta pockets, I'm still finding new pockets I didn't know were there!...... (I think like 7 or 8) Haven't used the draw string yet around the waist.. Really nice jacket"},{"name":"Joe Kelly","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Wonderfully warm, good fitting and sturdy... but...","review":"This is a crazy good value for the money... it's truly warm, very well made, and a perfect fit... but mine came with some pretty silly patches sewn on. Having to return this for that reason alone is a bummer; I truly love the coat. But, at my age, walking around sporting \"Fashion\" patches is out of the question. It cheapens the overall presentation of an otherwise fabulous bit of winter kit.\n\nThat being said, if you like pointing out mismatched colors or white pants after Labor Day, this just might be the coat for you.\n\nI hope I can get a non-decorated one, pronto."},{"name":"Richard Flom","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Real nice jacket for the price","review":"This jacket is a little big in the midsection but the rope tie helps out with that so all in all I like the jacket"}]},{"id":"KWlFiC","title":"TBMPOY Men's Windproof Bomber Jackets Lightweight Running Windbreaker Outdoor Golf Fashion Coat","imageUrl":"https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/61aK5WXwBCL._AC_UX342_.jpg","price":"$37.99","description":"Product Details\nFabric Type\n100% Polyester\nAbout this Item\nMaterial: high-quality breathable Polyester shell\nLightweight and windproof fabric provides excellent protection against wind and sun\nDesigned with high collar and full-zip front, which makes it more well-fitting\n2 big hand pockets, 1 zippered pocket and one cargo pocket on sleeve, 1 zipper inner poakct\nTBMPOY Mens Windbreaker Jaclets Ideal for all outdoor & indoor activiyies: Runningm, Hiking, Camping, Traveling, Fishing, even daily wear","totalReviewCount":"2,739 global ratings","averageStarRating":"4.3/5","reviews":[{"name":"Richard","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Stylish","review":"I lost a navy bomber jacket a few years back. Looked around and the only one that caught my eye was this one. It's light but keeps you warm on a chilly day without making you sweat on a warmer day. the color is vibrant and gives off a more expensive look. would recommend. (navy)"},{"name":"Vivian","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Exactly like the picture! ♥️","review":"I loved this I got it for my bf. He loved it a lot and said it’s really comfy and super cool for hanging out! No doubt you should get it.\n\nOne thing I was expecting is to be more thick inside. After all he liked it."},{"name":"Mark Alan","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Great jacket, Camouflage color different","review":"The product is well put together, and fits quite well. The blue color displayed on  doesn't match the color I received. It looks like navy blue but actually shades of grey/black. I got the 3XL... so I don't know if that changes anything. Picture for reference."},{"name":"Stel","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great gift!","review":"I bought this jacket for my nephew and he loved it. It runs true to size and fit him perfectly. I recommend this product."},{"name":"C. I. Manorina","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Decent quality jacket.","review":"After having read several reviews for this specific jacket I can actually say that I am pleased with my purchase. For the price it fits and feels nice, looks great too.\n\nI was testing the water with my first purchase but I intend to pick up a few colors later on."},{"name":"Austin c","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Amazing perfect fit","review":"I’m a big guy 6,6 275 lbs 7,2 wingspan 19inch arms 2x fit perfect it’s amazing worth every penny getting 2 more colors over a hoodie you’ll be good in 20degree temps"},{"name":"Debra Henderson","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Bomber Jacket","review":"Used the jacket for my husband’s 65th birthday night outfit to attend a music concert. It was perfect and chic."},{"name":"Uncle John","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Very nice looking jacket","review":"Nice jacket except terrible pockets that are too shallow and don't like the zipper on the pockets but its the only way to keep everything from falling out"},{"name":"Ramiro","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Excelente","review":"La talla es correcta, mido 1.77 y pedí la talla mediana. Me quedó perfecta. Muy practica. La puedes combinar de muchas formas."},{"name":"Rigoberto López Morales","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" Rompevientos","review":"Esta muy bien pero creo que si le falta algo que mejorar"},{"name":"george t g Chan","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" product material","review":"Somewhat too large and material too stiff"}]},{"id":"DE8iDN","title":"Weatherproof Midweight Soft Shell Jackets for Men - Men’s Water Resistant Windbreaker with Stand Collar (S-3XL)","imageUrl":"https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/81ATEgfkzNL._AC_UX342_.jpg","price":"$52.50","description":"Product Details\nFabric Type\n95% Polyester, 5% Other Fibers\nCare Instructions\nMachine Wash\nOrigin\nImported\nAbout this Item\n✔️Comfortable Quality Construction: Outer shell constructed using a soft durable lightweight polyester/spandex blend that is both water and wind resistant. Lining bonded with a soft brushed polyester for added comfort.\n✔️Active Design: Fabric blended using spandex fibers giving the jacket a slight stretch enabling it to move with your body, making activities like running, hiking, yardwork or anything you may find yourself doing outdoors a whole lot easier. Size down for a more fitted look.\n✔️Intuitive Utility: Fully zips up to the stand collar protecting your body and neck from the elements. Also includes adjustable velcro cuffs and drawcords at the waist for a more customizable fit and added protection. Features 3 exterior zip-secured pockets at the side and left chest, as well as an interior chest pocket with a velcro closure.\n✔️Year Round Use: This jacket insulates in the cold weather using your own body heat, yet it's breathable fabric keeps you from overheating in higher temperatures. Perfect for a chilly summer night or a cold winter day.\n✔️Easy Care: Fully machine washable\nSee more\nAbout this Item","totalReviewCount":"2,529 global ratings","averageStarRating":"4.6/5","reviews":[{"name":"Martin","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Quality Jacket","review":"I ordered the Large and it fits perfectly. I like how you can adjust the cuffs to help keep cold air from getting in at your wrists. The bottom of the jacket can be adjusted as well so you have a snug fit around your waist. Jacket is very comfortable to wear."},{"name":"Karen","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Nice jacket.","review":"Mostly purchase Under Armor, Banana Republic and JCrew, husband is very happy with this jacket. Looks good and seems to be good quality. 88"},{"name":"TiredMama","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Best jacket he ever had!","review":"Got this for my brother as a gift. He says it’s the best jacket he’s ever had. Fabric is thick and quality. Fit and shape are flattering. Plenty of pockets."},{"name":"MATT NADLER","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Well made","review":"I bought this weatherproof jacket to wear when I'm dragon boat paddling in Seattle on cold nights. Then I found that wearing multiple layers of a variety of thicknesses was more than satisfactory to keep me warm. The jacket is too bulky to wear under a life jacket. I'm now wearing it as a midweight good looking jacket instead...not for paddling."},{"name":"Cedric R. Brown","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" The Jacket I wanted","review":"This jacket has all of the qualities that I wanted in a jacket. It stops water and the wind. It is light enough were I feel very comfortable wearing it. I like it and you will too."},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Comfortable fit","review":"The jacket is comfortable and I would have given it 5 stars but it came with loose threads in the inside pocket making it awkward"},{"name":"Lawrence J. Laffer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Nice jacket","review":"Had the same jacket before. This one is nearly the same. Good all purpose jacket."},{"name":"Wendy Ruano","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Cómoda","review":"Es muy cómoda y talla perfecto. Su material es suave y resistente. Es algo pesada."}]},{"id":"rjOfim","title":"Wrangler Authentics Men's Long Sleeve Quilted Lined Flannel Shirt Jacket with Hood","imageUrl":"https://m.media-amazon.com/images/I/61J2YWfGrXL._AC_UX342_.jpg","price":"$30.93","description":"Product Details\nFabric Type\nHeather,Flannel\nOrigin\nImported\nAbout this Item\nRELAXED FIT. Constructed with comfort in mind, this long sleeve quilted lined flannel shirt is a wardrobe essential for those cold Winter nights.\nHEAVYWEIGHT MATERIALS. Built with button cuffs and quilted polyester padding for more durability and added warmth.\nFOR ADDED WARMTH. Padded with diamond black quilted polyester to create extra warmth while also creating breathability, this is an extremely versatile flannel shirt.\nFUNCTIONAL STYLE. Lined with 100% cotton, this brushed flannel is made with style in mind. Wear it on the job or out to lunch, this essential closet staple can be worn for many occasions.\nADDED STORAGE: Constructed with (2) dual front chest pockets and (2) side seam pockets, this flannel has easy-access storage for all your basic necessities.\nDescription\n\nPerfect for the cold winter days, the Wrangler authentic big and tall long sleeve quilted lined flannel shirt jacket with hood features quilted body interior, 2 side pockets and a brushed flannel exterior. The jacket offers a cotton blend hood offering more warmth and comfort, making this jacket a go to item for any man this winter.\n\nSee more\nAbout this Item","totalReviewCount":"11,840 global ratings","averageStarRating":"4.6/5","reviews":[{"name":"cargru","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Comfortable, warm and stylish!","review":"Bought this a Christmas present for my husband and he absolutely loves it! For starters, he's always loved wearing flannels, so this jacket is like an upgraded flannel since it's lined and warm. The hood is definitely a nice add-on. Definitely great value for the price. Super happy with my purchase and hubs is happy with his gift!"},{"name":"Paige","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" So nice for the price","review":"I bought this for my husband for Christmas and he loved it, much nicer than I expected. Definitely worth it."},{"name":"M. Elaine Murphy","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" My Husband Loves This Jacket","review":"My husband, who got this for Christmas this year, has hardly taken it off since he got it."},{"name":"Pamela Yarborough","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Nice looking casual jacket.","review":"Bought this for my husband and he loves it. I love it on him, too. It fits well and is lightweight and comfortable."},{"name":"Joel Ostmo","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" A little big","review":"I usually wear a large but reviews said to go up a size. Just get the size you normally wear. Other than that’s it’s a very nice coat."},{"name":"cindy s","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Fits great","review":"She loves it, doesn't want to take it off"},{"name":"Winters Run","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Good Insulator on Those Frosty Mornings","review":"Perfect before the hard winds and sub-zero temps of winter set in. Finally a quilted flannel shirt that fits well and keeps you warm before its time to break out the heavy coats. Good quality and workmanship."},{"name":"Dave Reksnis","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Great purchase","review":"It’s a great hoodie! Fits good and is comfortable! We are happy with it ."},{"name":"Bradford Christian","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" I'm impressed with it. It's warm.","review":"Quality is great. Inner lining is great. Color is great (I got blue).\n\nIt fits a little large on me. Some reviews said it fit a bit small. (Especially on the other Wrangler one like this with no hood)... I was worried I was going to have to get an XL. I got a large and it's a bit huge on me. No worries because I'm currently bulking up. (I'm 6ft tall and 210lbs) However, it makes me wonder how much shrinking I can expect from washing it. Normally I'm about 170 lbs and probably would've still taken a chance on Large... but apparently I would've been swimming in it. Even as it stands, it makes me look like I'm almost 300lbs because it's quite big.\n\nI also wondered (based on another review) if the color would be faded... but the blue is nice and vibrant.\n\nIt's a LOT more like a jacket than a regular hoodie. Partly due to the sort of quilted inner lining, partly due to how big and warm and cozy it is I guess. If it's around 0 degrees I can get away with just this plus t-shirt under, no REAL winter jacket/coat.\n\nLike some other options out there, the design for this one could've probably benefited from an inner zipper and then the buttons... and of course some dudes would prefer snaps instead of buttons.\n\nLady loves it. I'm impressed with it. It's warm. Pockets are useful."},{"name":"Merardo Garcia Gonzalez","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Chamarra Ligera, amplia y muy cálida.","review":"Ligera, Caliente, Ideal para utilizar por debajo de la misma algún suéter, playera o similar, buena manufactura, botones resistentes y bien fijos, ojales de buen tamaño, bolsas amplias, gorro muy calientito y amplio.\n\nEs la primer prenda de esta marca que compro y quede muy satisfecho con mi compra, me gustó su color y lo ligera y abrigadora que resulta ser.\n\nEn mi caso soy talla XL, me gusta andar holgado y no muy justo de talla, de igual forma pudiera haber sido la talla L pero no me quejo, en realidad muy satisfecho con la calidad del producto en relación a su costo, entrega en 1 solo día y si problema.\n\nAmpliamente recomendable."},{"name":"Telnets","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" not a shirt","review":"Id never wear this as a \"shirt\".. but as a light spring/fall jacket i would. Its got a quilted material liner, and the material is decently thick. Its heavier then a shirt, but lighter then a jacket.. It also fits slightly large, maybe by an inch more then i expected, but thats okay if wearing a shirt under it."},{"name":"Eric the great","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Was as expected. Happy for the price.","review":"I would describe this as a light outer jacket. Costco sells a similar product if you’ve ever seen it you should know what to expect here. Fit me well, i sized myself as I would usually for clothing and went for a small. I’m male 5’5 and 130lbs I’m happy with how it fits.\n\nThe hood I would say is it’s weak point. Kind of an odd shape and the material was a little light there. Nice that is had that feature at all though honestly. I got this to wear at work and in that environment it won’t last forever (nothing would) and I would buy it again."},{"name":"Bruce Yamamoto","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Very lightweight and comfortable","review":"It’s lightweight and comfortable to wear during spring, fall or around the house. I usually wear XL but I bought 2XL because I thought it would shrink after I washed it.\n\nIt didn’t shrink as much as I expected and it’s still about the same size, but the hood is HUGE. It’s so big that I can easily wear it over my bike helmet. LOL"}]},{"id":"AlR5nJ","title":"Columbia Men's Granite Mountain Fleece Jacket","imageUrl":"https://m.media-amazon.com/images/I/71pQfI+ZFpL._AC_UX342_.jpg","price":"$45.00","description":"Product Details\nFabric Type\n100% Polyester\nOrigin\nImported\nAbout this Item\n100% polyester.\nMockneck collar.\nTwo Zip Close Front Hand Pockets\nDrawstring Adjustable Lower Body\nImported.\nDescription\n\nThe next generation of a Columbia classic, this outdoor staple features a finely tuned fit and a soft-yet-rugged filament-fleece fabrication to keep you warm when temperatures plummet. Stay protected from the elements in the Granite Mountain Fleece. Made from MTR fleece, this jacket is as lightweight, warm, and durable as it is soft. The elastic at the wrists will block out the wind, and you can stow essentials in the secure pocket. It's perfect for an evening around the fire, a weekend out at the cabin, or an early morning hike. With a modern classic fit, the Columbia Men's Granite Mountain 2.0 Full Zip Fleece Jacket will keep you warm in style this season.\n\nSee more\nAbout this Item","totalReviewCount":"3,176 global ratings","averageStarRating":"4.6/5","reviews":[{"name":"SWW","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Light Weight Jacket","review":"Light weight, good for days that start out a little cool or for layering when you don’t quite need the full blown winter gear. True to size meaning most shirts I wear an XL and that’s the size I got and the fit is perfect."},{"name":"cindylsnyder","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great quality.","review":"Love the quality. My husband has worn his old one every morning for over 15 years and was getting worn. So happy to see him in a new one. He loves it. So cozy and warm."},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Comfortable","review":"So comfortable ! Thick but lightweight...keeps me warm even when it's only 57 degrees outside"},{"name":"Grammy","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Warm and nice looking.","review":"This jacket has a quality look about it with a warm thick fleece fabric.\nIt’s definitely worth the price."},{"name":"Kala Mavity","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great jacket.","review":"Great jacket. Very soft. Runs a little large but overall fits pretty true to size."},{"name":"Julie B","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Comfortable and warm","review":"I got this for my son and it is very soft and warm and washes well in the machine"},{"name":"Alejandro Rocha","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" If you’re 5ft 6in, M is a little large","review":"M is a bit large on me."},{"name":"Dan","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect","review":"It’s a great jacket. For the cool days or as layer to go along with my winter coat. I have a 44 1/2 in chest with a 37” waist. Great fit. Not tight or loose. I ordered a large."},{"name":"Riggs","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" BUEN PRODUCTO","review":"No le he dado el uso rudo para el que esta hecha, pero en el día a día es un producto muy resistente. Y cumple sin dudas el objetivo de proteger del frío."},{"name":"R Morggendorffer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Cumple 99% mis expectativas. Me encanta!","review":"Es calientita y ligera. Tela de buen grosor. El único detalle es que viene ligeramente grande, la compre para alguien talla M, pero no fue motivo para cambiarla."},{"name":"Stephane Plante","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Bien. Bonne qualité.","review":"Rien à redire. Satisfait."},{"name":"Cliente de ","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Esta muy bonita","review":"Buen material"},{"name":"Francisco M.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" excelente producto","review":"solo que es mas gris que negra"}]},{"id":"EPDKJy","title":"MOERDENG Men's Waterproof Ski Jacket Warm Winter Snow Coat Mountain Windbreaker Hooded Raincoat","imageUrl":"https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/51aqP+WdDyL._AC_UY445_.jpg","price":"$49.99","description":"Product Details\nFabric Type\n100% Polyester\nCare Instructions\nHand Wash Only\nAbout this Item\nWaterproof Windproof Snow Ski Jacket, also can fights bad rainy or misty weather, Keep your body always dry and comfortable when you are outside.\nAdjustable cuffs help to seal and keep warm, and the inner wear-resistant soft shell is highly wind-resistant.\nProfessional water repellent coated, fluff lining and durable fabric guarantees the best heat retention, Relaxed-fit style with quick-dry material.\nMultipurpose：Downhill Skiing, Snowboarding, Snowsports and other winter outdoor sports.\nSize notes: Jacket offers a standard fit. Please choose by US size.\nSee more\nAbout this Item","totalReviewCount":"20,515 global ratings","averageStarRating":"4.6/5","reviews":[{"name":"JavaInMyCup","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Retains Body Heat!","review":"Pros:\n1) This jacket is great at trapping your body heat! Great for Fall and Winter.\n2) Looks good\n3) Fits\n4) Good casual wear for regular outings\n5) Good at blocking wind.\n\nCons:\n1) The textile used to make the zippers are indeed delicate. Will tear if you're brutish with it otherwise it's okay. It's about 1 tier below regular zippers we're all used to.\n2) Can tear if you're wearing this jacket for high activity outings like skiing etc.\n3) The first few minutes after donning the jacket and stepping outside may be a bit chilly (winter season) until you warm it up with your body heat. Like I said it's great at trapping heat.\n\nPro tip: After measuring the size to fit; buy 1 size larger. I had to return my first jacket b/c it fits too damn well; exposing the shape of my beer belly. My second one was 1 size larger (still fits) and that is where I gave it my 5 stars. And no you don't see my tummy."},{"name":"Natnat","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect gift for my frequent skier, live in mountain's brother.","review":"I bought is as a Christmas gift. My sister and brother in law live in the Sierras and are on the slopes every chance they get. I was concerned about the size (as I always am). He loved it! It fit perfectly as stated and has a sleek look. It is also lined and has pockets and waterproof. Tested on the slopes and lives up as described. I got it at a good price. In fact, I ordered a womens for my sister."},{"name":"MattyTao","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Did not expect how good this ski jacket was 😂","review":"Loved how warm it was! I brought this to Vancouver with me while it was snowing and it has kept me warm the WHOLE TIME. Def something I will keep on me for a while and don’t have plans to return this at all. Espeically for such a good deal from a brand I didn’t know of. I would highly recommend it again and again for someone lookin for a ski jacket without hurting to much in the bank. They’re an honest brand and I would recommend again!"},{"name":"Max","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Looks Great and Feels Nice on the Inside","review":"I purchased this mainly as a snowboarding jacket because of the waterproofing abilities and the great deal! I've been eyeballing this jacket for a while and when I saw it go on sale I pulled the trigger and I'm glad I did. It's nice and cozy on the inside and the outside performs as intended in the snow/cold. This will definitely be used off the slopes as well"},{"name":"Enid","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Look great. Fits very well","review":"These look great and fit perfectly. My son used these for a ski trip to Canada and was in love. These kept him very warm and were lightweight enough for him to do many activities. Totally waterproof. He wore these with thermals and snow bibs did not need anything else. It was around 17F."},{"name":"Laura G","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect for deep sea fishing.","review":"I bought this for my husband. He went deep sea fishing and his last waterproof jacket was not so waterproof. This one fit great, kept him warm and dry, and is super easy to clean. Plus he can use it for snow trips too. Would recommend."},{"name":"Nelda R.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Super Warm","review":"This jacket has been the best jacket I have ever worn. I did not feel the cold going to my chest nor anywhere on my torso area on a 10 degrees weather. It was windy as well and I did not feel any of it. I had two shirts on and these jacket. I bought two more for my kids."},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great","review":"Used for my recent travel to Colorado. Use while exploring the Rocky Mountains with temperatures of -1*F and it did the job. I use a long sleeve shirt under it, and i never had a problem with te temperature. Warm enough also light. Very good product. I recomend it."},{"name":"Owen","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" Zip broke within 2 days of wear","review":"This was bought for my son's skiing trip and the side pocket zip broke on day 2. I am now struggling to find out how I can return this as it was bought more than 30 days ago, but believe I should be able to return for a full refund. Anyone know who to contact?"},{"name":"Philippe Lamontagne","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" very hapy with it","review":"definitly surprised at the quality\n\nthe people who complain about the pocket sippers must be gorillas...\n\nvery nice quality for the price\n\nbeen abusing it in quebec winter ( ice fishing , fat biking, ski etc ) and i dont have anything negative to say\n\nits light and thin so perfect for winter sports but also very warm\n\nvery happy\nthe sizing was perfect. i am 5’8 very wide shoulders and just like all my other jackets i went for XL and its perfect fit"},{"name":"Dana Bellagamba","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect winter jacket","review":"This jacket fits great. It looks great and is warm. Very good quality and at a great price point. The sizing chart is true to size. My husband is 6’1 and weighs 230lbs. The XL fits perfectly."},{"name":"Certified reviews","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" Oversized | Not warm | Heavy | Defective","review":"I am giving it two stars as I liked the color, style, and vacuum packing of the jacket. Apart from it, there was nothing good about it. The size is not as per the chart. It is oversized, It is not warm at all. maybe for +8 C, it is ok. The inner lining of the jacket was defective in terms of threading and a big tear on the side.\n\nIt was not for me. Not satisfied with the product as per the price of it"},{"name":"darren tierney","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect jacket for the price","review":"After looking on  for a couple hours at jackets, I was frustrated with the so so reviews. I went into an Atmosphere store and looked at jackets only to be shocked by seeing $300 price tags… in the clearance section. So I gave Amazon another go and landed on this jacket.\n\nI’ve been really happy with it. It’s warm. Size was great (XL for a 6’6” 220lb guy). I’m not sure how long it will last but so far this winter I’ve worn it a lot and there’s no big signs of wear or breaking. Really happy with this jacket considering it’s price and it’s competitors prices."}]}]