[{"id":"dJFIwr","title":" Essentials Men's Regular-Fit Cotton Pique Polo Shirt","imageUrl":"https://m.media-amazon.com/images/I/A1c0oQTtp1L._AC_UX342_.jpg","price":"$5.39","description":"100% Cotton\nImported\nButton closure\nMachine Wash\nThis short-sleeve polo is made with comfortable pique fabric, a double-button placket, and ribbed cuffs for a classic look that never goes out of style\nRegular fit through the chest for a relaxed, unrestricted fit with a printed neck label to maximize comfort\nGet these colors before they sell out!\nShow more","reviews":[{"name":"Mark M. Rochester Hills, MI","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Excellent value, consistent fit, cool, comfortable and durable.","review":"I have purchased 20 plus of these shirts in the past six months. The first batch in spring, figuring if any inconsistencies or quality issues arose upon delivery, no problem. 's return policy has always been hassle free. After trying on the fourth shirt and noticing no outstanding flaws or differences, all were simply opened, laundered and hung on a hanger. The material is 100 percent cotton, but assuming they are removed from the dryer immediately (medium heat) - no ironing necessary. No appreciable shrinking is observed and no outliers in the batch.\n\nMy sport shirt size is men's US large regular fit. Other relevant sizes - 17.5 inch neck, 46 inch shoulders, 34 inch sleeves and 36 inch waist. Overall fit of these shirts is of appropriate roominess without bagginess. Shirt tail length is spot on, work dress code requires tucked in, and they stay tucked in. Casual requires not tucked in, and unless I am reaching for the sky with both hands while on tip toes, the shirt tail/ belt line is not breached. The sleeve length could have been extended by an inch since they taper to an elastic cuff, requiring that the sleeves are pulled back to original position following an extended reach. But given the choice, the sleeves as is are preferred over a straight cut without the elastic cuff.\n\nAs an upgrade to the T shirt appearance of the shirt tail when not tucked in, the side seams end with a reinforced, one inch inverted V, a feature not typical in this price range.\n\nTo date, durability has not been an issue. Fraying, fabric pilling and fading have not occurred. It is quite difficult, if not impossible, to differentiate the age of two duplicate color shirts purchased in two separate batches.\n\nAgain, excellent value, consistent fit, cool, comfortable and durable!"},{"name":"HonestReviews","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Sizing is right on!","review":"After reading the reviews on this shirt, I was hesitant, but went a head and ordered down in size. My husband wears an XL in all shirts and so many people said the shirts were sized way too big and they had to return them for a smaller size, so I bought a large. I bought 2 shirts in black and sure enough, they were a true size large! Imagine that!  has the sizing right! Thanks to Amazon being such an amazing company I was able to return the 2, size large shirts and exchange them for 2, XL shirts. The XL shirts are a perfect XL fit! The quality is pretty good and the price can't be beat so I will be ordering many more of these shirts for my husband. I am excited to now check out more things in \"Amazon's Closet\"! Trust me, stick to the size you normally wear."},{"name":"Nicholas Parker","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Seems like a good shirt but the large is more like an XL and it it's cut big","review":"Off the bat, here are two photos of this shirt to help you out: (1) My arms are up and it shows you how big the Large version of this polo is. There is room to spare and plenty of sleeve length. (2) I am holding up one side of the shirt at belt level to show you how long the Large version of this polo is. The photo of the GREEN shirt is NOT THE SHIRT ON THIS PAGE. The green shirt is the slim-fit version.\n\nIt's a perfectly good shirt. The problem is that the sizing is unlike any polo I have. I'm 6' 175 lbs, I would say my body type is over on the thin side. I usually buy size Large shirts. When I put this size Large shirt on, it was much bigger than I expected.\n\nI admit, I have been wearing Gap polos for a long time and a few years ago, they went through this process of progressively cutting their polos more and more narrow. At this point, I consider Gap’s polo a fitted polo, and it’s their only polo. In other words, I have only been wearing fitted polo shirts for a long time.\n\nI thought I would switch to a more standard polo, save a little money, and buy some of these  shirts. Same size I buy in all casual shirts. Large. I was expecting a looser fit but, to me, this Large was more like an Extra Large. Much bigger than any Large shirt I had worn in a long time (maybe ever?).\n\nI can't suggest one buy a medium to compensate because I haven't tried one. I also can't say if washing it would shrink it enough. Maybe if I washed it in scalding hot water and ran it through a dryer on the \"surface of the sun\" setting, it might shrink enough. I’m going to opt for returning them.\n\nDon’t forget to take note of the length of the shirt. It’s long. My Gap polos land a couple of inches below the waistline. These shirts fall much further down (see photo). This is actually great if you tuck it in but not if you don't\n\nBottom line – it strikes me as a good shirt. You just need to know these are big shirts. I’m going to give the slim-fit version a shot.\n\n*UPDATE* The slim-fit version is a MUCH better fit for me. It's almost, but not quite, too tightly cut. It is a looser fit than the 2018 Gap polo. It does shrink a bit in the wash. I've added a photo of me in a slim-fit green shirt. Also much shorter in length."},{"name":"Indy Jeff","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Awesome shirt, but order the size you normally wear!","review":"Great quality and value for the price. I will see how this holds up as I'll wear it a lot for business, but it seems as nice as the $50 ones I get at some retails stores. I'm fine if it only holds up for one summer. I don't mind buying a few new ones each year at this price. CAUTION regarding size. Based on many reviews I read regarding size I ordered a medium when I normally wear a large. This is totally incorrect advice. Maybe the sizing is different on my order, but medium was a very tight fit. I'm a fairly normal size person and I tuck the shirt in so I'm not concerned with the length but I am returning the medium for the large I normally wear and will update this in a few days, but I'm sure large will be fine! Order the size you normally wear and you'll be fine!"},{"name":"Tiffany Cordova","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Waaaaay better than any womens polos.","review":"I am a female and I needed shirts for work. All of the womens polos are always thin for some stupid ass reason. But thank effing lord for mens polos because these are made with thick material, not effing see through. Also women must not need shirts that are long enough to stay tucked in. Because aaaaaaalllll of the womens polos are waaaaaaaaayyyy too short to stay tucked in. These bad boys though... these will stay tucked in with plenty of extra material left over to be comfortable. They are true to size. I enjoy these shirts."},{"name":"ajw_1974","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Massive shirts","review":"These shirts are ok. I bought 3 of varying patterns and colours. Seem to be good quality. Good stitching and the buttons are on tight.\nThey wash well and (unfortunately) don't shrink in the wash.\n\nThe one big flaw is that they are simply huge. This is not helped by the confusing mess that is supplied by  in size selection. They are way way beyond the given size. They are probably two sizes too big on me (nominally I am a XXL). It's just about wearable. I am in the middle of losing a bit of weight so I'll be lucky to see them last till the end of the summer before they swamp me.\n\nVote up if that's helpful!"},{"name":"Raymond Mathieson","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Twice the size they are supposed to be","review":"Terrible it’s massive clearly ordered a large cake with large on label but easily 4 inches wider than a normal large shirt avoid these polos ... if I wanted a shirt this big I’d have ordered tent"},{"name":"Androo","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Large for its size","review":"I don't like this very much. The advice was to buy a size down, which I did, and it's still arguably a bit on the large side. The collar hangs unattractively too, somehow. It's like a supermarket garment. Not very stylish or fitted. And the colour is way off what the photo shows. It's much more green in real life. Adequate but disappointing."},{"name":"D. Smith","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" Not a recommended buy","review":"I bought the XXL version of this shirt over 6 months ago. I like the shirt very much and decided to order the XL version. It seemed fine when it arrived but on washing the fabric coarseness was evident.\n\nSo I pulled out my old XXL and compared it to my prior purchase. The XXL fabric is smoother, more pliable, breathable, and more comfortable. The fabric on this XL is courser, stiff and more uncomfortable. I ordered a blue XL and it was made of the same course fabric.\n\nObviously, to me, it seems .ca has re-sourced and is making these shirts of a significantly different fabric and, in my opinion, less comfortable one. I cannot recommend this Amazon Essentials polo shirt any longer. It is substandard as far as I am concerned.\n\nI understand that constant sourcing of new and cheaper materials are needed to control pricing but I think the switch in materials for these shirts goes too far down the scale to warrant purchasing them."},{"name":"Karl","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Go one size down, nice fit and good quality material.","review":"I checked some reviews before buying and chose to buy 3 shirts at one full size down from normal.\n\nGot them out of the packet and the length is spot on, fit is regular and relaxed, but sized very nicely on my fairly broad frame.\n\nReally pleased with these, great quality fabric, fantastic value! I’ll get some more colours when they’re in stock."}]},{"id":"D_2J2J","title":"5 Pack Men’s Active Quick Dry Crew Neck T Shirts | Athletic Running Gym Workout Short Sleeve Tee Tops Bulk","imageUrl":"https://m.media-amazon.com/images/I/81gHzitlpsL._AC_UX342_.jpg","price":"$39.95","description":"Polyester, Spandex\nDesigned in USA, Imported\nMachine Wash\nVARIETY & VALUE - Set of 5 men's premium short sleeve t shirts in different colors and styles. Versatile athletic shirts for every man's wardrobe. Designs engineered for comfort and performance. Ideal wear for running, weight-training, bodybuilding, or even just everyday activities.\nFIVE STYLES - Huge variety with features such as reflective stripes for greater visibility on low-light runs, stretch-mesh underarm / shoulder/ back panels for strategic ventilation, and contrasting inserts for your personal fit.\nQUICK DRYING - Polyester Spandex fabric is quick-drying, ultra-soft & has a more natural feel. Moisture wicking knit that keeps you cool and dry while training. Soft to the touch and easy on the skin. Designed for excellent ventilation and breathability, dissipates heat easily. Note: Material percentages may vary depending on styles. Check label for actual content.\nERGONOMIC FEATURES - Fuller cuttings for complete comfort. Athletic crew neck, stretchy short sleeves and elastic closure for optimal range of motion. Not too tight, not too loose. Free your upper body during every movement. 4-way stretch construction allows better moves in every direction.\nREGULAR FIT - U.S. standard sized shirts for a relaxed, easy feel. New, streamlined fit & shaped hem for enhanced coverage during every movement. Kindly go for one size larger if you prefer a loose fit. Care instruction: machine wash cold with like colors.","reviews":[{"name":"Taylor Swan","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great shirt for casual wear and working out","review":"I am 6'0\" and about 205-210 pounds. My chest and shoulders are a little bigger from working out in the past than compared to an average build.\n\nI was hesitant buying this because I couldn't settle on a size. I am in the awkward zone where my size sits in between a Large and an XL size and it entirely depends on the brand of shirt to get a good fit. I ended up buying the Large shirt instead of the XL and it fits great. The material is light and breathable and working out is great with these! The designs and colors are cool, but I mostly bought these shirts for the material. Upon opening, the shirts do have a weird smell but if you air them out a bit it goes away. I don't notice any smell anymore."},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Nice workout shirts","review":"The shirts came as expected, no major complaints. I'm just under 5'11\" and about 180-185. I originally bought size Large, but these shirts are long in length and didn't fit my body as expected. Normally I buy Large sizes, but with these shirts, I went back for the Medium to get a more snug fit. I'm satisfied currently and they have held up over a few months of wearing 5 times a week. So far I would recommend them."},{"name":"Michael Lewis","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Clinging Shirts","review":"The shirts are of a clinging material, so no matter what size, they will cling to your body. It doesn't matter to me because I'm losing weight. They are well made and rather thin, so they will be great summer shirts. This is the second set of shirts I've bought, and they are all excellent."},{"name":"Frank Cardenas","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" 👌","review":"Yooo these shirts are the best active shirts I've ever gotten for the price!\nChest : 41in\nWaist from bellybutton: 38.5in\nFor me, they fit great!\nAt the chest, they're not too tight not too loose, i love it.\nAt the waist, loose which works out to hide my love handlers.\nThe quality in these shirts are very impressive.\nThey feel great, feel durable.\nChoose these shirts to keep up with your training, i did and I dont regret it!"},{"name":"Coin Collector","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Not for thick guys","review":"I’m 5’9 200+ lbs. with very large muscles. I ordered the xl and I loved it. The material is seriously the best. I’ve never wore a shirt that felt better on my skin. It fit my body perfectly. Unfortunately it was too long. I like to wear my shirts untucked and the bottom hung down past my butt. I sent it back and ordered the large. I hoped the fit would stay the same but the length would be cut down. Half was true. It was now the right length but the chest and arms are too tight. So aggravating. If you’re a lean guy then this shirt will fit you perfectly. If you’re taller this shirt should fit you well too. If you’re 5’9 and super stocky it’s going to be too long or too tight. Take you’re pick. Hope this helps somebody. If anybody finds a shirt like this that fits a little more loose or not so long please let me know."},{"name":"William Tseung","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Best shirts for your money.","review":"Good quality shirts overall. No problems with mine.\n\n6' 150lbs so rather skinny and I got the medium. It's a nice loose fit"},{"name":"JB","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" 👍🏼","review":"Good quality and price, it look and fits perfect 👌I’m around 5’10 and 185 lbs medium size . I would buy again for sure also fast delivery"},{"name":"TCB IN A FLASH","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great substitute for higher-priced options","review":"I purchased these shirts only because my go-to source for work-out shirts (Lulu) was back-ordered due to the pandemic. I’m a tall guy and was worried that less expensive shirts would be geared for regular (i.e. shorter) guys. Turned out that these shirts are, frankly, perfect. I’ve actually order another set. Can’t recommend highly enough, particularly given the price."},{"name":"Adan","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Vienen una talla más grande","review":"Son playeras cómodas, solo que vienen una talla más grande. Yo siempre soy talla mediana y las playeras me quedan justas debido a que voy al gimnasio, pero por las opiniones que leí pude ver que venían más grandes de lo normal y por eso pedí small y me quedaron como cualquier otra mediana.\nEn general son de calidad regular, es lo que se espera por el precio.\nOjo: son solo UNA talla más grande (no dos como dicen otros comentarios)"},{"name":"Julio Zamudio","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Me gusto el producto","review":"La tela es de buena calidad y tiene muy buen diseño.\nEs una camiseta holgada que permite la libertad de movimiento, está bastante larga como para que no se te ande encaramando. No aprieta, por lo que te sientes bastante cómodo.\nLa recomiendo."},{"name":"juan h","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" TALLA CORRECTA","review":"DE CALIDAD ESTAN MUY BIEN SOLO HAY QUE TENER CUIDADO YO SOLICITE 2 X L PORQUE SIEMPRE HE COMPRADO OTRAS MARCAS Y SALEN MUY JUSTAS EN ESTA OCASION ESTAS CUMPLEN MUY BIEN CON LA TALLA YO HUEBERA PEDIDO SOLO XL Y ME QUEDARIAN PERFECTAS ME QUEDARON UN POCO HOLGADAS PERO SI LAS RECOMIENDO"},{"name":"DC.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Buenas para el precio.","review":"Son delgadas, pero tienen muy buen corte. Mi esposo le encantaron. Vienen en la talla correcta. Mi esposo es talla L exacta, pedí M porque decían que venían grandes y efectivamente no le quedará, volví a pedir la L y le quedaron perfectas. Para el precio y la cantidad tampoco se puede pedir más."},{"name":"Alberto Vidal","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Es ropa de usa pidan una talla más chica y les quedará Perfecto","review":"Al ser talla norteamericana se debe pedir una talla más chica, yo soy L y pedí M y me quedo perfecto, ese es el único detalle por lo demás, son cómodas, buena calidad, se ven bien y están perfectas para llevar al gym"}]},{"id":"7lT7MI","title":"Polo Ralph Lauren Men's Classic Fit Cotton Crew Tee","imageUrl":"https://m.media-amazon.com/images/I/51Qwzsgj1NS._AC_UX385_.jpg","price":"$24.95","description":"100% Combed Cotton\nImported\nPull On closure\nMachine Wash\n1\" Polo Pony Embroidered Logo at Hem\nSoft, Combed Ring Spun Fabric\nWicks Moisture\nTag Free","reviews":[{"name":"Annette","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Thank you!","review":"I ordered the same 3 package of shirts from macys,\nBoth orders came in the mail and they are the exact same thing!\nThese are not fakes, These are legit.\nOnly thing is that they are cheaper on the Macy's website.\nNote that these are not fakes!"},{"name":"Rob K.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Finally! A shirt for taller fit men!","review":"Longer and narrower than crap standard fat American sizes. I’ve noticed throughout the years that American shirt sizes got wider and wider. These RL go back to the “fitter” dimensions... a bit narrower and longer. Thanks RL. Also, the embroidered Polo logo on the wearer’s Front bottom left of the shirt is nice. Nice to have no-graffic “I’m not a kid anymore” classic shirt."},{"name":"S.HUNTER","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Giving the side eye","review":"I honestly don't know how to rate this. So, my closet is about 85% Ralph Lauren and this is the first time I decided to get my RL on . All the RL T Shirts I own are Pima cotton and modal, so they're very soft. This isn't that. These are 100% cotton which I didn't even know RL made... My bad. The material is ok though. I have to see what happens when I wash it.\n\nI also have to admit I was sceptical buying RL on Amazon. People sell imitation stuff everywhere. So when I got my package I did investigate a bit. The packaging was kind of loose... Like it seemed a little big for only 3 shirts. I know when I buy my shirts from the store, they're pretty tight and secure in the. But I'll give benefit of the doubt and say maybe the heat from shipping expanded the plastic.\nBUT I looked at the consistency of the logo compared to what's in my closet. To be honest, I'm not all in. Maybe I'm look too hard but for one, the tail on the horse is a bit too short, and also the mallet looks kinda curved... But again, maybe it's just me. Purchase at you own risk. I'll just stick to the polo store/website."},{"name":"Ali Tariq","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" My favorite shirts!","review":"My favorite shirts I’ve been searching for more polo shirts, but a variety pack and my criteria was basically a light blue, darker shade of blue, and another black shirt. To find this pack felt awesome haha I’m very happy to have found these! You’ll never regret buying these t shirts they last forever, keep its shape very nice, over the course of time becomes significantly more comfortable, and somehow these t shirts just look sharp. I can’t really describe it, but Calvin Klein also does a good job doing this. Not quite sure how they do it, but I’ll never complain about that!"},{"name":"C. Wintizer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Bacon Neck","review":"Been ordering these Polo undershirts for years and never had an issue until these. The necks are horrible, they look like a strip of bacon and just suck, so disappointing. I thought maybe it was a fluke, so I just ordered another pack a couple of months ago and they're already showing signs of doing the same thing, ugh. I'm extremely disappointed, do not order these if you want a nice firm collar that will stay and the length won't overly shrink! See the pic of the newer ones and the older ones side by side."},{"name":"Rich","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Terrible Collars!","review":"The fit was ok...but the collars are terrible. They are bunched up and look like a $2 shirt from Walmart."},{"name":"David Lee","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Excellent package","review":"I like the new Polo t-shirt design. The Polo logo is no longer on the left chest area, it's now down on the left bottome corner instead, thumbs up for who ever thought of that one. Also love the fabric material and the colors, royal blue, grey, and navy blue are all good t-shirt colors. Most of all, at less than $10 per t-shirt, that just can't be beat!"},{"name":"Mark Farris DDS","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect weight of Cotton","review":"Soft and the perfect weight of cotton for warm weather. Well made and good colors. Washed and dried on low heat. Very little shrinkage. All cotton will always shrink a little bit at first wash and dry. Low heat is the key, not medium. I buy my t-shirts big for a loose comfortable fit. These are a keeper."},{"name":"Jon","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Nice","review":"I like that they are longer than most t-shirts. They are not short and wide like most shirts. I bought medium and shrunk them in the dryer and they fit me well. I am 6ft and 140 lbs. I could've probably got small, though. The fabric does seem a little on the thin side but it's still good enough. Could've been thicker fabric."},{"name":"Alejandro Mendez","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Excelente calidad de algodón","review":"Excelente calidad de algodón y el fit es excelente. Yo las uso para dormir y son una maravilla. Muy cómodas y frescas. Las de cuello V las uso para vestir. Las recomiendo ampliamente."},{"name":"Patrick Mitchell","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Top quality T shirts at US prices","review":"Always loved the Ralph Lauren shirts, have bought them for 30 years and nothing lasts better and more importantly\ndon't shrink when I use a 40C wash, the minimum I need to get the best results.\nI know these are thinner than the T shirt range we get here in Australia that start around $50AUD but for $20AUD delivered and with the mostly warm climate where I live it means I can afford to wear quality Ralph Lauren clothing every day.8 weeks in, they wash well and I look forward to the next order arriving.\nIf the quality stays the same I will buy these for life."},{"name":"Andy Carey","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Logo is not on breast","review":"Just be aware - as I couldn't find it anywhere in the description and the photos are deceptive enough to hide it - the logo is on the bottom left hemline. Shirts are legit though, and the material is very nice."},{"name":"Viann Rea","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Buena playera","review":"La calidad de la tela es muy buena, le pongo tres estrellas porque una de las playeras llegó con las mangas mucho más grandes que las demás, tanto que tuve que llevarla a arreglar.\nQueda un poquito justa pero muy cómoda (si te gustan holgadas no es opción)"}]},{"id":"-WAqqV","title":"Hanes Men's Essentials Short Sleeve T-shirt Value Pack (4-pack)","imageUrl":"https://m.media-amazon.com/images/I/71eI5N9s05L._AC_UX385_.jpg","price":"$9.97","description":"100% Cotton\nImported\nNo Closure closure\nMachine Wash\nYour Best Value in Comfort\n100% Cotton (Ash 99% Cotton, 1% Polyester; Light Steel 90% Cotton, 10% Polyester; Charcoal Heather 50% Cotton, 50% Polyester)\nHigh-quality comfort at an affordable price\nShow more","reviews":[{"name":"Erinz","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect! Just what I wanted","review":"I’m 5’10” and ordered a size large in blue. I saw all the reviews saying these shirts shrink in the wash and they do a bit! But they didn’t shrink as drastically as some of the other reviews said. The photo with me wearing shorts (not visible) is fresh out of the package and the others are after being washed. You can see the collar, length, and width are a bit decreased but not anything really noticeable. They feel smaller than they look smaller.\nThe post-shrink shirts fit exactly how I like them though, so that’s great! I recently started as a cashier at Ross Dress for Less and wanted some shirts designated for work. These match the company color perfectly and they’re thin but solid cotton so they don’t get hot while I’m working but also don’t fall in that weird drapey way some vans shirts hang etc."},{"name":"Viktor","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" See how much they shrink","review":"These t-shirts will shrink bad. I am including a picture of my 6 month old t-shirts (same brand, black) vs. brand new white ones. They're tagless and all, very comfortable and won't fade much, but the shrinking factor might be of your concern especially if you order \"L\". Mine are \"S\" and now they fit like a slim-fit t-shirt which is fine for me but for some this may be relevant."},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Fits as expected worn by a female","review":"Hey not sure how helpful this will be given Im a female an this is a mens tshirt. But long story short needed a red shirt for a job didnt matter the style just had to be red. I buy smalls in hanes mens tshirts at the store just for around the house so i knew my size atleast for the plain white ones. I dont like it fitted but i dont wanna look like im drowning either. Im more of a athletic build size 4 or a 26 pants or 3-5 in juniors. Tops in womens i always get smalls im not overly busty 34c an these fit great. I prefer hanes for the simple fact the are longer than other brands an dont look boxy after a few washes not to mention no tags truely a great tshirt. Fyi i notice white tshirts always tend to shrink more than the colored shirts not sure why but in my experience thats what happens but still fit just a bit more form fitting. An just an fyi if a female is lookong for a tshirt for lazy days or whatever or just to wear on ick days if you have a little belly on ya nice cover for those days but if you have yourself a belly that is more obvious this may not be what your looking for or maybe try a size up."},{"name":"Jenn","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Not Comfort Soft..read before buying! Rip off!!!","review":"These are definitely NOT comfort soft as advertised. My husband has been getting Hanes for years and we made the mistake of ordering them here because we found a good deal. Well, you get what you pay for..these must be a knock off or something. They were rough and itch even AFTER a wash. When we got them we realized there was no way they were true Hanes shirts. We submitted a return request but the seller was going to charge a 20% restocking fee and we had to pay for shipping so beware prior to buying. We tried washing a couple times to see if they would get any better but no luck. So we are now using as cleaning rags. So if you’re okay with low quality itchy and rough undershirts, then buy these!"},{"name":"Rick Brownlee","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very Soft & Breathable!!!","review":"Great Deal. Great Feel! Nice & Long to tuck in. Comfortable around Neck"},{"name":"Jason","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" Hane's needs to seriously improve this product line.","review":"I bought a couple packages of these in black to use as undershirts for my work dress shirts. I tried them on when the first arrived and the length was good. After a single wash (cold) and dry (warm) they have lost at least 2\" in length, making them near impossible to tuck in and remain tucked in. So for anyone wondering... Yes, these shrink quite a lot in the length. Interestingly they did not really shrink at all around the chest/waist dimension.\n\nA couple other issues I had with these, that I have not had with other brands is that the seam along the bottom of the shirt and around the ends of the arms was not flat. If these were not meant as undershirts I envision I would be going through and having to do some serious ironing to ensure all the seams were down nicely.\n\nLastly, the elastic around the neck seems to be of lower quality material and is not as taunt as I guess I would prefer. It definitely seems like a few washes in, the neck is going to be very loose and \"bacon-ie\" looking.\n\nI certainly will be looking to other brands from here on out."},{"name":"S Mart","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Just ordered second order very happy.","review":"Ok read all the negative stuff bought with skepticism but as luck would have it I am pleasantly surprised and the shirts are very comfortable and fit me great. I normally wear medium but lately mediums are not really the same as before so I washed the Large in Hot Water and had minimal shrinkage now a perfect fit just in between a Medium and A LARGE. I would say a cold wash there would probably be little to no shrinkage as I first washed in cold. They have tags which doesn't bother me but makes identification easier in my mishmesh stack of Black T Shirts. Over all very satisfied just ordered 4 more on  Prime Wardrobe. Good Luck..."},{"name":"Eric","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Not soft and very itchy when wearing","review":"Nothing close to \"ComfortSoft\" at all as stated. Even after several washes and dry, these shirts are still itchy and uncomfortable and if you are wearing it during warm days you will sweat in them and it will become itchy on your skin. I wear this as my undershirt for work while wearing my uniform-issued short sleeve button down shirt and I'm already sweating within minutes. I had 3 older versions of Hanes ComfortSoft Ts just like these ones before and they were very soft and not itchy to wear. The material was perfect and not too thick or too thin. These newer ones here are just ridiculously too thick and itchy."},{"name":"fivelampboy","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" Poor stitching","review":"Poor stitching\nOrdered 2 different colours and have found in both that the stitching is coming apart at the arm pit. Clearly a quality control issue that needs addressing"},{"name":"Cesar Grajeda","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Terrible, no es comfortsoft. Ni se parece, no comprar!!","review":"OJO, NO COMPREN ESTO!! El producto NO es lo que se anuncia.. Por ningún lado tiene la descripción comfortsoft, solo trae una etiqueta genérica, eso y que el embalaje es una bolsa de plástico transparente me hace pensar que el producto no es original.\n\nAdemás la tela es sumamente incómoda, con una constante sensación de picazón. Es una pena que al haber usado ya la prenda no la pueda devolver.\n\nHáganse un favor, lean esta reseña y no compren estas cosas. Son pésimas."},{"name":"Michael B.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" NOT “ComfortSoft”, NOT 100% cotton and NOT tagless","review":"These are NOT Hanes COMFORTSOFT T-shirts. The description of these T-Shirts as “Comfort Soft” is extremely misleading. COMFORTSOFT is a Hanes brand for tagless 100% cotton T-Shirts. The T-shirts I received are not branded Comfortsoft, are not tagless and are NOT 100% cotton. I will be returning this product."},{"name":"Wayne","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" Not good","review":"Poor stitching. Not soft. Made in Mexico."},{"name":"Rene Bear","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" HORRIBLE quality","review":"Horrible horrible shirts. I bought them because I thought it was a good brand but boy was I wrong. Look at my picture, the seams are sewn very poorly so they look saggy and all bunched together and when you wear them it looks horrible. The seams around the collar and the arms are all sewn very very badly. Do not buy these unless you want to throw away money and not be satisfied. Look for something better."}]},{"id":"WtOFRL","title":"BALENNZ Workout Shirts for Men, Moisture Wicking Quick Dry Active Athletic Men's Gym Performance T Shirts","imageUrl":"https://m.media-amazon.com/images/I/81pqHKtWXoL._AC_UX385_.jpg","price":"$9.99","description":"Pull On closure\nATHLETIC PERFORMANCE WEAR: These mens athletic shirts help dissipate heat quickly and offer more breathability while being gentle on your skin. We use a 4-Way Stretch Fabric that allows you to move seamlessly making sure you stay comfortable through any activity\nBREATHABLE & QUICK DRYING: Our mens quick dry shirts are made to enhance your workout performance. Thanks to their lightweight and quick-dry fabric, they allow more air to pass through and dry quickly to help you stay cool and dry while looking good\nDESIGNED FOR COMFORT: These moisture wicking gym tee shirts are made with comfort and performance in mind. We combine a non-restrictive crew neck with short sleeves to bring you men’s athletic performance shirts that deliver more flexibility and a wider range of motions\nSUN PROTECTION: Whether it’s winter or summer, our mens active shirts will help you deliver optimal performance while staying comfortable and safe from the sun. The sun protection material helps protect you from harmful UV rays making it ideal for all outdoor activities\nPUSH YOUR LIMITS: Whether you’re training, exploring or adventuring, our mens moisture wicking short sleeve shirts will give you the right support and comfort so you can push yourself further. Ideal for training, exercise, running, hiking, climbing, biking, cycling, sports and much more","reviews":[{"name":"Dave Davis","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect for the Price","review":"I bought three of these and just ordered three more. I love them. They are so comfortable. As others have stated, there are no tags in the inside back neck line, so it is easy to put them on backwards. But I finally figured out an easy solution. There is a tag on the inside left. So I just make sure that the tag on the inside left is on my left side as I put it on. Easy."},{"name":"Logan","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Nike drifit on the Cheap","review":"I absolutely love these t-shirts. I had looked for a bit on  and ended up purchasing the shirts. Upon arrival, the shirts fit great and felt great. These shirts remind me of the Nike Dri-FIT material however the five shirts alone cost less than one Nike shirt. I wear one of these shirts every day underneath my scrubs at work for over half a year and I also wear them during workouts. I have had no issues with the durability and the one thing I do like is that there is no tags on the shirt. They feel great and wick away moisture. I will definitely be buying a second pack in my future."},{"name":"T Wagaman","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" I work outside in the heat and these shirts fit the bill.","review":"These shirts work for me (husband) while I am working outside. The only issue I have is it is hard to determine which is the front and which is the back. Otherwise they wick moisture and keep me comfortable all day."},{"name":"Carolina gonzalez","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Más de lo que esperaba","review":"Esta opinión es de mi esposo. Se las regale para el día del amor en un juego de amigo secreto.\nMe sentí un poco triste porque no vi gran entusiasmo, ni siquiera las uso rápidamente, hasta que le dije \" cuando vas a usar tu regalo\", pues lo hizo y ahora no usa nada más para hacer sus ejercicios. Por alguna razón tiene un sistema rápido de secado (él llegaba con sus camisetas de algodón húmedas y me daba hasta cosas tocarlas) ahora con sus nuevas camisetas llegan como si hubieran sido usadas.\nSi me preguntan que opino. Es un buen precio, para un excelente producto."},{"name":"Kerry Snyder","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" A real bargain for a great set of attractive and practical athletic shirts!","review":"I was a little worried about quality with 5 shirts for $30, but I am very happy with these. The variety of colors is great, and the design pattern is very attractive. I have been wearing these shirts on many grueling hikes over the past 5 weeks. They show no signs of fraying from backpacks, shoulder straps, etc. The moisture wicking is very effective and the shirts dry quickly. Best of all, they are attractive enough to wear out to casual dinners and events. Only minor issue I had was a small area on the back of one shirt where no color was applied in the dying process -- looks like there was a small crease in the fabric during dying. I just touched it up with a Sharpie and all is well!"},{"name":"Jay Inkredible","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Pefect for gym, size down for anything else","review":"These are super lightweight and make it easy to move, twist & turn when working out. A size L was just a bit too big for me (perfect for working out in) so if I wanted something to just wear when grabbing groceries I'd prob go down 1 size."},{"name":"Anthony Lerro","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great workout shirts","review":"Needed some new, better fitting workout shirts and these fit the bill perfectly. Light weight and super comfortable. I got a size large which fit as I would have hoped. Definitely recommend. Good value for the $$$. Saw some complaints about no tag on the shirts so it’s fought to tell back from front but it’s not an issue at all as far as I’m concerned."},{"name":"Leoncio J. Delgado","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Loving it","review":"I work outside and wear a sweet sweat over my undershirt. I switch to this today and now I don't have a puddle of sweet when I take off my sweet sweat. Material is light. Also noticed people around where hotter than I was. Shirt does Not cool you but difinetly better than cloth."}]}]