[{"id":"MnsANe","title":"Roxy Women's Oceanside Pant","imageUrl":"https://m.media-amazon.com/images/I/51G0nvZk56L._AC_UY445_.jpg","price":"$19.53","description":"55% Flax Linen, 45% Viscose\nImported\nPull On closure\nMachine Wash\nEASY FIT: Have some fun in the sun with the Roxy Oceanside pant featuring an easy, slightly looser fit with flared leg; Lightweight, linen blend fabric and elastic waistband with drawcord provide maximum comfort\nLIGHTWEIGHT: The Roxy Oceanside Pant is made in a linen and viscose blend that allows for lightweight comfort and breathability; Wear the Oceanside Pant as a coverup to the beach or for other daily activities or occasions\nCOMFORT: The Oceanside's easy fit, lightweight fabric, and elastic waistband with drawstring provide ease and comfort throughout the day\nShow more","reviews":[{"name":"Freak","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Awesome linen pants","review":"Love these pants, very comfy and stylish!\nI can't wear flip flops with them though because they are too long. I am 5'2\" 108lbs, I am wearing 3in wedges in the last pic and the pants still touch the ground.\nI always wear flats/flip flops with linen pants because that's what looks best and goes with the style so a lil sad they are so long. I will most likely try to shrink them when I wash/dry them.\nIf they shrink enough I would definitely buy more in different colors."},{"name":"Mallorie","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect for what I was looking for","review":"Perfect for what I was looking for! Great for beach, lounging, but in my opinion they would not look great for dressing up... might just be my body type though. These do run a little large for juniors sizes, and I'll need to hem them. I'm 5'3\", 150lbs, and 40 inch hips. The medium is snug (in a good way) across the hips with no pulling on the fabric, and absolutely no cut-in at the waist."},{"name":"Mrs. Leal","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Best Linen Pants!","review":"Love these linen pants and the quality is great, but unfortunately they did not fit me. I'm 5'4\" and weigh 175 lbs. I have a curvy body and ordered the XL. Linen has no stretch to the material so keep that in mind when ordering. I wish they fit me for my trip to Cancun because they are truly great linen pants. The waist measurements on these pants for an XL is 36\", Inseam 32\". My hips are 50\" and didn't fit into the XL. I wish there was an option for 2XL or 3XL."},{"name":"Zoe G.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Sizing is off!","review":"Okay here is the problem with these pants. Bought them in white medium (knowing they are a bit of a Juniors fit) and they fit great. Bought the same size again in Black - totally different fit. Smaller and even lower on the waist. Guess what? One was made in Vietnam and the other in China. Kind of hard to do quality control in two different countries. I think they could be worth buying for a casual pair of beach pants BUT I recommend trying them on first and just know that 2 different pants of the same size may fit totally different! Had to return the blacks!"},{"name":"M. muse","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Super cute","review":"Love these pants so much. They are so comfy and fit well. I am 5.7 and weigh 125 pounds the small fit great!"},{"name":"Kaylie","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" They are low rise but so amazing!!!!","review":" @kaylie.mclean Obsessed! They are low rise though, but I prefer mid- or low rise over high rise! I sized up to a M because I wanted a relaxed fit and so thankful I did. They are so comfy, definitely my new favorite pair of pants. Will order in other colors :) I am 5’5 so they were perfect length. They are not too see through but if you wore a bright colored suit or panties they would probably show through."},{"name":"Shopping Queen","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Truly for juniors or super models - \"super low waisted\" should be in the description","review":"If you're a \"junior\" or super skinny with absolutely no fat around your waist or hips, then these will be perfect for you...especially if you have long legs. I hesitated when I saw the junior sizing, but after reading the reviews and description and looking at the model picture I figured they looked pretty normal in size. I got drawn in due to the long inseam - hard to find for my 34\" long legs. I was wrong. I wear a small or medium (6/8) and ordered the medium. They were so low rise that I felt like a complete idiot in them...and this is coming from a short waisted person who can typically pull of low rise. Even if I went up a size, I feel sure they'd be to low. They created a nice spare tire around my hips/waist. The inseam, however, was perfect. Really more of a 34\" than a 33\" but probably because the crotch starts so low on your body due to the low hang around the waist. Sadly, I'm returning. Again, they'd be perfect for a teenager with an amazing body."},{"name":"Leah Lytle","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Love these!","review":"I love these beach pants! Good quality fabric, comfortable, and good fit. They are a little long, I wear high shoes with them. But I’m 5”2, AKA a shorty lol. I got the small and it fits perfectly. Can be dressed up or down. Highly recommend these pants!"},{"name":"nc","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Very low rise","review":"Much lower rise than I thought and quite thin linen, so quite transparent....great if you're young and sylph like, not good if you have lumps and bumps to hide! Had to return"},{"name":"Jay","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" not the nicest linen, hem came undone.","review":"the material feels a bit deckchair. Not the best weave, sort of scratchy.\nAlso the hem has come undone after wearing twice.\nFor a decent brand the quality should be better.\nThey're a nice cut. Shame about the rest."},{"name":"Dee","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Comfortable and light","review":"Well made and comfoetable.\nSizing isn't great if you have bigger hips and thighs like me. UK Size 12ish is more an L.\nXL a UK 14-16"},{"name":"KK","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Great fabric, low rise","review":"I felt the rise wasn’t high enough"},{"name":"Miss K M CRUMPLER","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Really good trousers","review":"These trousers are perfect. I am a normally a size 10 in bottoms and ordered my size and they fit really well. I'm 5ft 5in and the come just below my ankles and so they are trailing on the floor. The material is nice too. Would definitely recommend."}]},{"id":"l1iVLx","title":"LEE Women's Relaxed-Fit Austyn Knit-Waist Cargo Capri Pant","imageUrl":"https://m.media-amazon.com/images/I/61fFzr6+QhL._AC_UY445_.jpg","price":"$20.49","description":"98% Cotton, 2% Spandex\nImported\nZipper closure\nMachine Wash\nRELAXED FIT. These women's cargo capri pants feature a relaxed fit from through the hip and thigh. These capris hit at the calf for a versatile fit.\nSTRETCH COMFORT. Made with comfort in mind, these cargo capris are constructed with stretch twill fabric. Finished with a knit waistband and a roll hem for fit customization -- these capris are perfect for everyday wear.\nCARGO STYLING. Updated style and all-day comfort in a cargo-inspired capri. Made for comfort with a touch of cargo-style, these cropped pants feature an adjustable\nShow more","reviews":[{"name":"Nani G","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very comfortable and not \"clownish\"","review":"When you are in your 50's and your waistline is not what it used to be, it can be a challenge to buy capris. Other capris I have purchased have very low waistlines that cut into my tummy, and when I get a larger size they look like clown pants. These have a stretchy waistband that runs slightly on the large size. I run between a 14 and 16 depending on the brand, this 14 fits great and is SO COMFORTABLE. Cuffs are not huge nor the silly tie cuffs that are often the only choice in looser capris. Material is lightweight but loose enough to look nice -- doesn't cling where I don't want it to. I have ordered another pair. Wish there were more color choices."},{"name":"Pryce","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very Comfortable","review":"Very comfortable. It is perfect for hiking."},{"name":"LilliR","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great cargo pants.","review":"Very good quality and fit. I am 5’4” tall 149 lbs. 40” hips and I bought size 10. I like the color and fabric. The fabric is not too thin or thick. Perfect for spring and summer. The length can be made shorter by rolling the cuff. In the photo I didn’t roll the cuff and it hits 7” below my knee. The waist band hits at my belly button."},{"name":"Opinionated","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Sizing Inconsistent","review":"I initially bought these capris in black in size 14, to have something comfortable and casual to wear around the house. I was so pleased when I tried them on - I'm 5'7\", weigh around 185, and am big through the butt and thighs, but have a small waist. Although the capris were a bit loose in the waist, they fit everywhere else.\n\nI liked them so much I decided to buy a pair in Cafe (khaki) too. I ordered the same size, but when I tried them on, discovered they were too tight, fitting more like a size 12. I've sent the Cafe pair back and ordered a replacement pair in Frost Gray. I'll report back if they, too, are too tight.\n\nUPDATE: Received my Frost Gray capris, and they hit somewhere between the relaxed fit of the black pair I ordered and the too-tight Cafe pair. (They're also less silvery than the picture; I'd decribe them as a light charcoal gray.) I'm going to keep this pair as they're still wearable, but be forewarned that finding the right fit with this capris can be tricky."},{"name":"Denise","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Love these!","review":"Love these!! I suggest buying your regular size. I had read that some bought them one size smaller and I'm glad I didn't because the size 12 fits me perfectly.. and I'm 5'2\", 155lbs...especially in the waist. Bought in two colors! I don't usually leave reviews but these fit so well I was very pleased."},{"name":"Jeaniem","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great capris","review":"I’m 5’2” a 33 inch waist and 40 inch hips/150 lbs and these fit like they were made for me. Very comfortable, not too long. The fabric is medium weight, not see thru at all.\nI bought them for a pending car trip hoping I could wear them 2 or 3 times before they are too wrinkled. After 2 days at home sitting at my desk I’m pretty sure they will work great for traveling."},{"name":"devlynch","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" These are the most comfortable capris I've ever owned","review":"These are the most comfortable capris I've ever owned. Just ordered my third pair and a pair for my sister! stretchy knit waist, loose fit. They are perfect for summer. And the price is amazing. I have been looking at other at about $60 a pair. I strongly recommend these. As a lady of a certain age whose waist has disappeared and who's going for comfort, and pockets, these are the pants for me."},{"name":"OCR","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Leve these gray capris","review":"Loved them! Before purchasing these pants I read several reviews. I am borderline size 6 and 8, and bought a 6. I like them because they are not really relaxed fit -- I chose a smaller size considering that I am working out and watching what I eat, and expect to lose weight. I like the color (gray) and, although I wish the waist line were a bit lower (half an inch perhaps), I'm glad I bought them. Love the side pockets by the knees.\nUPDATE:\nStill love them. For your reference, I'm 5'5\" and weigh approximately 140 lbs. Highly recommend them."},{"name":"Mary Beth","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" No place for a phone but they fit \"ok\"","review":"I wear a 14-16, got the 16 to be extra comfy but find that they *just* fit.\n\nPros:\n- essentially elastic waist, comfy!\n\nCons:\n- no back pockets\n- my phone (nothing big, just a Samsung S5) doesn't fit in the cargo pockets??\n- they are almost a brushed cotton which means they pick up every bit of lint, dust and cat hair. A quick lint roller helps, but it's too much up keep for casual summer pants."},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Cute Capri","review":"I was looking for some nice capris. These fit the bill. On top of that they have stretch. During this last year my weight has shifted so I was in between sizes. I am normally size 12. But as mentioned I gained weight which meant I had to go up a size or two. I went with size 14. I was so happy they fit nice. Maybe a little tight however still comfortable to wear due to the stretch. The great thing is when I loose weight I can still wear them. Ps I bought 3 in total different colors I am happy I did."},{"name":"JA","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Amazing pants! So impressed","review":"I find it super difficult to buy pants that fit me properly. I’m about 197lbs currently and carry most of my weight in my bum and thighs. For reference my hips are 47” around. I read reviews that said to go with the a bigger size. I usually wear a 14 so ordered a 16 and they fit perfectly! I never thought I could order pants online and have them fit so great. I live in my lululemons in the summer but wanted something to wear I could dress up just slightly and these are perfect. They have a little stretch which makes them comfortable but not enough stretch that they will bag out and fall down. The waist has a stretchy elastic waistband and is very comfortable as well. My waist is 34” for reference I also have wide calf’s and these aren’t too tight around them. I’m in love with the fit for my curves!"},{"name":"Lisa Martens","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Comfy and light","review":"I do love the fit. I have an apple shape, so not a small waist, and this elasticized half waist was comfortable without being pinchy, hides the muffin top quite nicely. Length might be long for some, I'm 5'9\" and they hit me a little below the knee."},{"name":"Anna R. Fraser","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Fit as expected. I haven't washed them yet.","review":"Fit as expected. I haven't washed them yet.\nSnap is stubborn to unfasten, but I'm a bit of a weakling. Legs were rolled up and pressed, fine but if you choose to wear them rolled down get your steamer out to get the creases out"}]}]