[{"id":"gfhA7j","title":"Womens Winter Warm Jacket: Front Zip Jacket Coat Jacket Up Zipper Retro Ladies Outwear Casual Womens Floral Women's Coat","imageUrl":"https://m.media-amazon.com/images/I/61ryDWpR3QL._AC_UX385_.jpg","price":"$42.54","description":"100% Polyester\n🔥🔥🔥2022 Deals Big Clearance🔥Buy 2 get 5% off, Buy 3 get 8% off, Buy 4 get 10% off, Buy 5 get 12% off. Offered by WYTong.\n💐Size Tips:Please refer to the size chart we offer not the  size.Our size runs a little small.We commend that you can choose a larger size than your usual wear.💐💐💐white faux fur coat women halloween t-shirts for women drink up witches s flannel jacket with hood flannel shirts for women long sleeve long fleece coat women zip oversized thermal tops for women flannel jacket women with hood plus size womens tops dressy casual fall plus size thermal tops for women fuzzy flannel jacket women cropped streetwear women shirts womens flannel shirt plus size petite women's coats for winter plus size black fleece jacket women rain jackets for women waterproof\n💐long sleeve womens lightweight hoodie shirt womens fuzzy fleece jacket open front hooded color block patchwork ladies sweater with zipper leopard print tops for women flowy long sleeve tops black sweater sweater cardigan womens zip up hoodie oversized hoodies sweaters for women womens fall open front cardigan faux fur coat vintage parka shaggy jacket warm long black cardigans for women sweatshirts for girls size 7-8 casual jackets for work ladies sweater for winter blazer jackets for women closure\n💐jackets for women fashion jackets for women fashion casual white winter coats for women short long jackets for women fashion fleece jacket women with hoodie womens winter coats with hood womens jackets fashion fall cute winter coats for women plus size fall coats for women womens jackets fashion for work womens jackets fashion with hood winter jackets for women plus size 4x white jackets for women casual short blazer jackets for women jackets for women fashion dressy light rain jackets\npumpkin cardigans women flowy button down shirts ladies oversized long-sleeved jacket slim fit jacket womens fashion strapless t-shirt blouses patchwork graphic teacher shirts hooded sweatshirt y2k streetwear zip up sweater coats tops ladies oversized long sleeved jacket slim fit jacket womens fashion strapless t-shrit blouses patchwork graphic teacher shirts suit cardigans womens jackets outerwear lightweight casual office blazer stretch gathered sleeve breasted tailored blazer jackets\nwomens blazer jackets for women women's blazers suit jackets men's sport coats blazers black blazer for women womens blazers for work professional white blazer for women blazer dress for women tie dye blazer dress women blazers cute blazers for women one button blazers for women business casual oversized blazers for women fuzzy womens blazers casual women blazers for work casual sexy shorts and blazer outfit for women rain jackets for women waterproof loose denim jacket rain coats for women\nShow more","reviews":[]},{"id":"ym2jwz","title":"Winter Thicken Warm Jacket Front Zip Jacket Coat Jacket Up Zipper Retro Ladies Outwear Casual Womens Floral Women's Coat","imageUrl":"https://m.media-amazon.com/images/I/71S466ToDsL._AC_UX385_.jpg","price":"$15.47","description":"100% Polyester\n🔥🔥🔥2022 Deals Big Clearance🔥Buy 2 get 5% off, Buy 3 get 8% off, Buy 4 get 10% off, Buy 5 get 12% off. Offered by WYTong.\n💐Size Tips:Please refer to the size chart we offer not the  size.Our size runs a little small.We commend that you can choose a larger size than your usual wear.💐💐💐trench coat womensdenim trench coat womens black trench coatfall trench coat rain trench coat trench coat women black trench coat women trench coats for women plus sizewool trench coat women womens trench coatswomens trench coat longwomens trench coat slim fitbrown trench coat womens trench coatlong trench coatwomen 's trench coatsladies black leather trench coatwomens wool trench coattrench coat double breasted trench coat women the drop trench coat women womens winter woman dress vest winter yellow sweaters women long raincoat gray blazer for women jackets for adults fleece sherpa pullover womens fall maternity tops big comfy sweatshirts for women coats winter womens flannel hoodie womens fall tops womens motorcycle jacket concealment jacket summer women fashion fleece womens jacket plus size tops for women fall rain jacket women waterproof with stripe liner faux fur wrap for women fuzzy sweaters for women plain jacket white wool coat cardigan sweaters\nwomens flannel shirt with hood plus size womens tops dressy casual fall winter shacket jacket women plus size 2x button down shirts for women white plus size oversized button down shirts for women plus quilted shirt jacket women white white tunic blouse plus size tight long sleeve shirts for women pack shacket jacket women corduroy shirt jackets for women fashion cute fall jackets for women plaid womens flannel jacket with hood and pockets white fur coats for women blazer jackets for women closure\nsherpa plush fleece zip up fuzzy shaggy jackets long sleeve hoodies casual warm thicken outerwear black blouses for women short sleeve long sleeve for girls sweaters for girls 10-12 ladies sweaters cardigan crewneck sweatshirts men pullover hoodie men sweater dresses for women sexy crewneck sweatshirt short set women sweatshirt dress women hoodie long long sleeve shirts for women slim fit printed jackets for women fashion hooded sweatshirt dress cardigan sweaters for women women's raincoats\nplaid sherpa jacket women plus winter coats for women plus size womens jackets lightweight casual white blazer jackets for women womens jackets fashionable fleece jacket women plus size with hood long fleece jacket women with hood waterproof winter jackets for women rain jackets for women waterproof lightweight fleece jacket women full zip no hood winter coats for women long length wool sherpa jacket women plus size white winter coats for women fall plaid jackets for women\nwhite winter coats for women fur rain coats for women womens jacket rain jackets for women waterproof long lined rain jackets for women waterproof light trench coats for women black fleece jacket women blazer jackets for women plus size fleece jacket women full zip 4xl plaid sherpa jacket women winter coats for women plus size 5xl long winter coats for women plus size womens jackets fall peacoat fall jackets for women trendy long winter coats for women long winter coats for women\nShow more","reviews":[]},{"id":"Ezli4T","title":" Essentials Women's Classic-Fit Long-Sleeve Full-Zip Polar Soft Fleece Jacket (Available in Plus Size)","imageUrl":"https://m.media-amazon.com/images/I/91w+tXovQcL._AC_UX342_.jpg","price":"$5.61","description":"100% Polyester\nImported\nZipper closure\nMachine Wash\nThis midweight polar fleece jacket with a high collar, works as a finishing touch to a cool-weather look or a comfy base layer when it's time to bundle up\nEveryday made better: we listen to customer feedback and fine-tune every detail to ensure quality, fit, and comfort\nContoured side seams for a fitted look\nWinter made better: we listen to customer feedback and fine-tune every detail to ensure quality, fit, and comfort","reviews":[{"name":"Dawn","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Super Soft Fleece Jacket","review":"This is great fleece jacket. I ordered a medium instead of a small because I knew I would be wearing the jacket over other clothing. Being a golfer also means I needed a bit larger to ensure I would be able to swing freely. As noted in many reviews the sleeves are a little long but they roll up perfectly and stay rolled. If I had ordered my normal small perhaps the sleeves would have been a perfect length. As shown in the picture the collar does fold down.Totally zipped it is like a turtle neck. The jacket is super soft and was a bit warmer than I expected. The pockets are deep with zippers."},{"name":"Leanne","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Really nice quality and runs true to size","review":"This is such a nice jacket, and the quality is on par with a similar fleece jacket I have from Columbia sportswear. In fact, I like this one even better since the fleece is softer and it doesn't have any logos on the exterior.\n\nAt just under 5'4\", 125, and a 32D chest, I'm usually a small in tops and jackets. I ordered this in an XS since that was the only size available. It fits well, but is snug across the bustline when zipped, so a small would definitely be better.\n\nThe quality of the zippers is also nice. There is a pull on the main front zipper, and the side pockets also have heavy-duty zippers. The only thing that lets you know that it's an -branded product is the interior tag.\n\nThis is the first piece of clothing I've tried from Amazon Essentials, and I'm very impressed with it!"},{"name":"Earth For Humanity~","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very cozy~","review":"I'm a nurse and needed something cozy and professional for the winter months at work and this exceeded my expectations. The only problem is it's so soft and cozy I find myself washing it after my work week so I can wear it at home (so far no noticeable shrinkage). I bought two additional colors so I stay cozy and stylish all Winter."},{"name":"Grandma Debbie","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" AMAZON ESSENTIALS FLEECE JACKET","review":"I started purchasing  essentials wardrobe pieces and was very pleased. So, when I saw this soft fleece zip-up jacket, I decided I would try it. It arrived in a nice package and it's so soft. I'm f\n5'6\" and about 200 lbs. I ordered 2x. It is perfect. It's zips all the way down the front and has two slash zippered pockets. The sleeves are not tight at all and they come to the wrist. A really nice jacket."},{"name":"H and K","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Soft, good quality","review":"Update: I love the grey so much, I also bought the light blue. Not exactly the same shade blue as the picture, it is slightly darker, but also nice.\n---\nThis is my 1st  essentials clothing order. And I have to say that I love this item. I'm between a medium and a large, depending on brands and how I want things to fit. I ordered a large and it was too big. I think if I wanted to wear this as an outdoor coat, then it would be ok with a lot of layered clothes underneath. But I intended to wear this indoors. So I reordered this in medium and it fits fantastically.\nThe material is soft and smooth/compact, not full of fuzz or lint like some other fleece jackets I see from other popular brands. The stitching is also good in quality. Even the inside seems are sewn down (have you ever had jackets where the flaps along the zipper are sticking up inside? messy!). Pockets are deep and can fit my whole hand (believe me, I didn't know this could be a problem until my last raincoat could barely fit my phone in there). There are also pockets inside the jacket!\nOverall, I would purchase again if I wanted more colors!"},{"name":"Brianne","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" Not holding up well","review":"I bought this for work, I am an RN. I was thrilled with this jacket at first. It fit as expected, doesn’t seem to fade or pill and it was warm for my night shift. Unfortunately it isn’t holding up to frequent washings, 1-2x a week. The elastic at the bottom of the jacket is unraveling. Granted it was an inexpensive jacket, but for what I paid I expect to get more than a few weeks wear."},{"name":"Madam Curie","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" A solid and functional jacket","review":"This is a very high quality fleece jacket, very similar to a North Face jacket that I bought a couple of years ago at half of the price. The zippers are not at all flimsy. The zipped pockets are useful for keeping my phone or keys. The thickness is probably warm enough for temperature around 40's to 50's. The sizing is accurate. I normally wear either a Small or an Extra Small (5'2 and 115lb) so I ordered both sizes. The sleeves are a bit long on the Small and I could layer the jacket on top of a shirt. The Extra Small fits like a glove and feels just right if you don't want to layer. Overall, a great purchase. I highly recommend it."},{"name":"Karen R.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great jacket!!!","review":"I am short, chunky, and apple shaped. Some jackets fall so low on me, I look dumpy. I must say, this jacket is a good length, that really surprised me. I LOVE IT!!!!!!! I've looked at many, and for the price, style, and cut, I thought I'd try it. Got it today, and very happy with what I received. I read the reviews, and I ordered 3 sizes up. I like to layer, and I wanted it loose, that borders baggy. It's exactly what I wanted. It's cozy, and thicker than I thought it would be. I buy from  all the time, my family loves them.👍I wanted to let you know how I felt, I don't write on here much, but I'm very happy, sometimes I just want to know how stuff fits other people. T Y"},{"name":"Laura","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Bought it for myself, but my dobbie loves it, so it is hers now :)","review":"I got this jacket for the multi-day backpacking trip. My dog chewed on a zipper a day prior to it, but I still decided to carry the jacket for extra warmth in the evening when walking around the camp site. However, the dobbie got cold during the trip so I decided to just give it to her. I give this item 5 starts on her behalf as she was very warm and comfy.\n\nP.S. The material is really soft and warm, I wore it a bit during the first day of backpacking and it felt great. It is light, but takes quite some space in the backpack, so it might not be the best choice if your backpack is already full. I might order another one for my next backpacking trip"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" A bit different and comfy and smart.","review":"This is a really nice warm fleece, however it's more like a cardigan as it would not be warm enough in the UK without wearing something else on top. I originally ordered an XL, which was far to small. I am a size 18. So I ordered an XXL which was perfect."},{"name":"ellie","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" This does not run small! Good for the Price","review":"After reading a number of reviews and answers saying that the sizing runs small on this fleece, I ordered a size up. I tried it on as soon as it arrived and... it was huge!! Please find attached an artists impression of the incident, as I didn't take a photo.\n\nI'm assuming these were small in the past but the sizing has since been corrected. I'm a UK size 12-14 and, after exchanging the huge one, ordered a Medium. The fit was perfect!\n\nRegarding quality, you get what you pay for. I love the pattern, the fleece is soft and the zips work fine. It's only a thin fleece, so good for milder weather or layering. Pockets are a good size too.\nAfter wearing this regularly for 2 weeks, some threads around the trims and seams came loose (nothing is actually coming apart) and I've had to snip them off. This is why I've given 4 stars instead of 5.\n\nOverall, it's a good lightweight fleece with a nice choice of patterns & colours. Decent quality for the price. Just be sure to order your actual size!"},{"name":"Adrienne","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very Smart","review":"This is a really lovely fleece. In terms of weight, it is more cardigan than jacket but certainly warm enough for spring. It's nicely shaped and the contrast edge around the neck makes it look smarter than most fleeces. I bought the red and It looks exactly like the photo. It is true to size but not generous. I'm a size 8 and ordered a small. I can get a thin jumper under it. i usually buy Regatta and this compares well. Really pleased and would take a chance on  Essentials again."},{"name":"m a coelho","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Wrong sizing!","review":"It's a lovely fleece, it does look good. It's a shame the sizing does not correspond to reality. I usually wear size 16 (Large) that's what I ordered but it was so small. Taking into consideration how small LARGE was I've now ordered XXL. Fingers crossed it will fit. The retailer should look into their sizing because this is quite annoying."}]},{"id":"JysWEc","title":"Columbia Women's Switchback Lined Long Jacket","imageUrl":"https://m.media-amazon.com/images/I/61rMJf0GfsL._AC_UX342_.jpg","price":"$50.00","description":"100% Polyester; 100% Nylon\nImported\nZipper closure\nMachine Wash\nCOMFORTABLE RAIN JACKET: The Columbia Women’s Switchback Lined Long Rain Jacket is a longer version, fully lined and waterproof rain coat with elastic cuffs, and a drop tail, designed to keep you cozy and dry.\nADVANCED TECHNOLOGY: This all-season rain jacket features our waterproof Hyrdroplus 100% nylon shell with full polyester lining, designed to take the edge off, while keeping you dry and protected in even the hardest of downpours.\nMODERN CLASSIC CUT: When the weather is on the edge, this is a universal rain jacket great for everyday use, with a long feminine cut and comfortable range of motion.\nShow more","reviews":[{"name":"mylyric","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect lined windbreaker! YAY","review":"Great jacket with a cotton lining. I’m super happy with the fit. As always, order a size up because Columbia runs small. I ordered a 3x and I wear a 18/20."},{"name":"Wendy","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Beautiful fit =) See my measurement 👀","review":"Bust is 46\", Waist is 43\", Hips are 50\", Weight is 227#, Height is 5'7\", Size I got was 1X. The fit is perfect! See photos. Love this jacket! Will buy more in the future =) Hit like if this review helped you."},{"name":"Nizerifin","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great length","review":"I really like this rain jacket. It’s a great length and covers your upper thighs. I’ve used it in both light and heavy rain and have remained dry. The light lining is nice as well. It keeps the waterproof material from sticking to bare skin without being too warm."},{"name":"Savannah Giddings","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Goodish purchase","review":"I needed something lightweight and durable for a solo hiking trip and this jacket pulled through. Kept me warm on a 40° boat trip and dry during a light rainstorm. I like the length in the back as I’m 5’8 and prefer not to get pelted with rain while hiking.\nIt does fit true to size and allowed me to fit a flannel and sweater underneath for a cold morning, but don’t expect to wear a hoodie under this thing.\n\nEdit after 2 years: I went backpacking on Isle Royale National Park during May (aka RAIN). I was SOAKED after hiking 4-6 miles in steady rainfall. The water went through the jacket and the inside mesh was so wet, it took 2 days to dry with cold temperatures and daily rain. I was so bummed. Not made for more than light rain!!!"},{"name":"OreoBlizzard","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great fit, excellent quality. Perfect for the rainy season!","review":"This jacket is exactly what I wanted, and considering the quality it was absolutely worth the price. I bought the 2x. If you are used to buying 2x in other shops, do know that this jacket runs on the larger side. It fits really well on me, and I would suggest it for people who wear 2x or 3x.\n\nThe biggest plus for me is the lining. It’s such a joy to wear in spring, when it’s all rainy and a bit cold.\nAdjustable sleeves are nice too.\n\nOnly downside is that petite people may have an issue with the length of the sleeves and the torso. The sleeves are too long on me but thank goodness it’s adjustable!"},{"name":"onk416","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect Fall Jacket","review":"This is the best jacket purchase for rainy fall days! It’s keeps you dry and warm, but it’s not too thick of a jacket. I’m usually a size small, but I bought a medium to layer. I recommend sizing up for extra room."},{"name":"keylimejet","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Love this jacket!","review":"I've been looking for a hooded rain jacket with a soft lining for about a year (since I ruined my previous one during a renovation project). Every one I looked at had the same material inside as out, and I like a soft t-shirt or sweat-shirt type lining. I finally found this one and I like it even better than my old one. It has a great tailored fit, without being tight, and the length is awesome. I'm 5'9 with long arms and the sleeves are a bit long on me with the small size, but it has a velcro strap to make it tighter at the wrists, so it works great.\n\nI wear a size 4 -6 dress, and I originally ordered the medium, thinking I'd need the extra room for layering underneath. However, it was too big, so I exchanged it for a small, and that one fits perfectly. I thought the price was very reasonable too."},{"name":"Jessica","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Does exactly what it says, keeps you dry!","review":"I purchased this jacket prior to a hiking trip I was taking in Vermont and the Adirondacks knowing the weather would be questionable on the day we were arriving. I'm SOOO glad I did, while hiking in Vermont we rain into a rainstorm on our way down the mountain. And when I say rain, it POURED BUCKETS AND HAILED and HIGH WINDS. This jacket kept my entire upper body completely dry minus my hands and part of my chest where I had it exposed to the elements (my doing). But underneath I was dry and stayed warm the ENTIRE way down, I've owned rain jackets in the past that haven't even come close to how waterproof this jacket was. It's very light weight and easy to carry in a pack if you're traveling. I ordered a small and had room to layer underneath. I love how the back end is longer to cover my butt when hiking with a backpack on. It never rode up or anything which is always a plus. If you're looking for something lightweight, want to layer underneath (or not) this jacket is well worth the money. I've been bringing it with me hiking ever since. I literally don't go anywhere without it now, I'm so glad I purchased this before my trip or else I would of been soaked like my hiking mate was with her non waterproof jacket 😞. Would highly recommend! Thinking about ordering another color. If you're going for warmth though this jacket wouldn't be it, it's quite thin like a windbreaker but honestly I'd rather layer with my own clothes than have a thick jacket. 10/10 would recommend."},{"name":"Judy B.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" No surprise, exactly as advertised","review":"Well made jacket, ordered a 2X and it fits exactly as I expected it should. I'm not tall so it covers my butt nicely, and there is a gather cord to draw in the bottom hem. Nice and light but has a warm flannel lining, perfect for spring walks by the river. Delivered the next day. Very pleased."},{"name":"Thrifty Bargain Hunter","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" I love this coat! 5 stars.","review":"I just got this coat and love it. I'd tried a couple of other spring jackets but they were horrible so sending them back. But this one is perfect! The 2x is roomy enough for a thick sweater underneath but still fits very well. The sleeves are long enough for my arms (I'm 5'7\") and don't rise up when my arms are fully extended, unlike others I tried. I could not be happier with this coat! To me, the \"nocturnal blue\" looks black. That's fine with me, as I would have ordered black if it was available. I haven't had a chance to wear this jacket yet, but I can't wait until spring to try it out. I'd rate this jacket 5 stars and recommend it."},{"name":"Jocelyn","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Quality, style and fit!","review":"This product arrived two days early, the fit is perfection and the colour is better than I expected. I bought this coat in the pink/ salmon colour in size Medium for hiking/ camping/ everyday wear and it’s so stylish! Also, the darting in the back of the jacket (around the waist and rear) makes it such a flattering fit on the female body. I usually am a size Small in Columbia products. I read the sizing chart and was so glad that I sized up to a size Medium (I’m a size 6-8 in dress sizes and I’m 140 lbs. and 5”4) and the M fits perfectly. The length (with it hitting just below my rear) is really desirable for a rain coat. And the lining is a thin fabric (in my opinion this is better than a simple mesh lining) and it’s soft and just a little bit warm to cut the chill of a rainy day. Highly recommend this product. I bought this jacket on sale for $63 on  and it’s full price at $90.00 (written on the tag) is an indicator of the quality of this jacket. I’m in love with it! I can’t wait to test this jacket camping."},{"name":"Berry","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Love!","review":"This is my second time buying this (I purchased this in a medium in dark nocternal and a large in black)\nI am 5'3, 130-135 lbs, wear a 34B bra, and am pear shaped.\nThe medium fits great, with enough room for a hoodie undernieth, and it covers my bum. I love how its not super long though (being short thats a problem i run into a lot) The large i bought so that i could layer with even thicker sweaters.\nThe arm length is just right (usually arms are way too long on me)\nThe only thing thats a bummer is at first the rain beads off and it seems great, then after around 2 months of heavy use it starts to leak through on the arms**\nI had the arcadia ii for two years before it leaked and i wore that sucker constantly, so this one isnt as waterproof buuut i like the style better.\nIf youre looking for something super waterproof, this isnt the jacket for you.\n**to be fair, i do live on the wet coast**"},{"name":"Mara","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Lightweight Jacket","review":"This is a lightweight jacket for spring, fall or if you need some wind protection.\nIt's hard to find jackets that cover your backside. I'm 5'7, 105lbs, straight up and down and got the Medium.\nIt's not too baggy or too tight. I could have gotten the Small but it would have been a bit too tight and I wanted to put a hoodie or thicker layer underneath. If you are straight up and down this will fit you and drape nicely. It has darts in the back. The pockets are decent and zippers are thicker. The hood just covers your head but doesn't fall forward so don't expect it to shield your face from a lot of rain.\nThe jacket would not work for heavy rains or downpours. It's just a good all-round jacket."}]},{"id":"91WuO7","title":"Levi's Women's Faux Leather Classic Asymmetrical Motorcycle Jacket (Standard & Plus Sizes)","imageUrl":"https://m.media-amazon.com/images/I/81YKjX5JK9L._AC_UX385_.jpg","price":"$23.48","description":"100% Polyurethane\nImported\nPolyurethane lining\nZipper closure\nMachine Wash\nFUNCTIONALITY: Snap down lapels; Center front zipper closure; Adjustable zipper cuffs; Two lower welt zipper pockets\nSTYLISH FEATURES: Classic faux leather motorcycle jacket; Attached jersey fleece hood for added comfort\nVERSATILITY: This faux leather classic moto jacket makes this jacket a staple in every woman’s closet; It is perfect to transition between seasons or to use as a layering piece","reviews":[{"name":"emme","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" 40 42 53 18/20. 255lbs 5'6","review":"I was nervous about the fit because i am plus size but small chested 40b. I am 5'6, 255lbs pear shaped (42'' waist 53'' hips). I usually wear 18/20 lane bryant and 20w in levis jeans. After careful review i got the 3x and i love the fit. It is roomy especially at the chest level of course but without looking frumpy. The sleeves fall a little below my wrists even after adding a thick sweater I was afraid it might be too short but my ample bottom looks goooood!!!\nI love it!!!!!\n\nI tried to include the kind of information i myself was looking for. I hope it was helpful."},{"name":"MsDC16","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" I’m in love with this jacket!","review":"Bravo Levi’s! After much searching I’ve found the perfect moto jacket! The faux leather looks real! All hardware is top quality plus it’s waterproof and machine washable! I first had a medium but sleeves were way to long and worn open had too much room! Although would be good for Sweater or Hoodie underneath, however I intend to wear with tee shirts or tank tops in the Spring so sizing down too a small is perfect! Not too tight could still wear with thin sweater and the sleeve length is much better! Still a tad long but that’s the look! Don’t hesitate this jacket is perfect!"},{"name":"Sally O'Malley","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very impressed!","review":"Beautiful jacket. Very well-made. I don't wear leather, so I was thrilled to find a quality, vegan leather jacket. I ended up returning it though because of the slim fit. I'm top heavy (36DD) and the medium was snug around my chest, but fit everywhere else. I didn't go up to a large because I was afraid it might look too bulky around my shoulders. I may try one of the other faux leather Levi's moto style jackets because the quality is amazing."},{"name":"JustACustomer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" I'm in love. Surprised at quality and fit.","review":"First off the jacket does look like fake leather almost like couch leather but that doesn't really bother me that much. The detail on the jacket is awesome there's little bits of design everywhere which I love. The zippers on the sleeves are just for show when you unzip them they reveal a fake pocket. The hand pockets fit my hands and take a lot of work to fit my phone in. the chest pocket can't fit my phone I'm pretty sure but maybe an ID or something. The buttons for the collar do make a weird tapping sound if you don't make sure to button them. There were also a few loose threads on the back that I cut off. I was wary about buying a leather jacket on  but I'm glad I did. I got a small and I'm 5'3 almost 5'4 and 125 pounds with a big bust and it fits perfectly. The sleeves are snug but that's how I wanted it to fit. At first when I looked at it I thought it might be too big and would make me look bulky but when I put it on it was fitted and looked very feminine. It's also pretty warm but if you get snow you might want to wear a similar colored hoodie underneath."},{"name":"Nancyjua","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Get It!","review":"This is the jacket I didn’t know I needed. I waited a while to get it. Once I did, I was so glad. It’s a quality jacket and feels luxurious. It keeps you warm and elevates any outfit. I ordered a large and the fit is perfect. For reference, I wear a size L top."},{"name":"Tom F","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Beautiful and cool jacket","review":"Fit is awesome. It is a bit short for what I usually wear, but that's the cool style I hear and so I got it. Man am I glad I did. It's so comfy and so cool, but without being TOO cool. I think if you're someone who likes classic styles but wants something feminine with a bit of edge you'll love this.\n\nIt's also super comfy and almost seems like it has some stretch, which makes no sense. It's very supple and fits beautifully. I love it."},{"name":"mis_iz214","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Well fitted jacket","review":"Nice fit...at waist. Leather looks real."},{"name":"Paul P.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great jacket !!","review":"I bought this for my 24 year old daughter...she absolutely loves it. It was difficult to find a nice jacket at any of the stores that we usually shop at. So we went to our \"go to \" store - ."},{"name":"Helena","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great looks and value","review":"The quality and design are excellent. It is slightly tight in the arms but has some stretch so that it will loosen somewhat in time. This jacket is not meant for wearing bulky sweaters underneath. It will be great for the fall weather. It could also be worn indoors. Love the true red colour."},{"name":"Parissa Nikbin","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Too big","review":"It was too big for me. I usually take XL but it was not available so I had to order xxL and it was too big. Too bad. I loved the color"},{"name":"Anne Cheesman","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Super stylish classy jacket.","review":"Love this jacket. Looks very stylish and is soft and durable. It feels and looks like leather but is totally cool, durable and washable."}]},{"id":"lUZHcY","title":"The North Face Women’s Venture 2 Waterproof Hooded Rain Jacket","imageUrl":"https://m.media-amazon.com/images/I/81HdO2S8dDL._AC_UX342_.jpg","price":"$67.17","description":"Recycled Polyester\nRAINY ADVENTURES. The Women's Venture 2 Jacket is a packable year-round rain jacket designed to withstand backcountry storms and styled for everyday use. It features our waterproof, breathable and seam-sealed DryVent 2.5L fabric.\nPREMIUM FABRIC. Made from 100% recycled materials with DryVent performance tech and coated with a Durable Water-Repellent (DWR) Finish, this waterproof, windproof and breathable jacket delivers cozy comfort for casual nights or adventure days.\nSTANDARD FIT. With a flattering shape and ample mobility, this jacket is perfect for easy wear or layering up. Whether for a casual look in town or active days in the wilderness, you'll experience freedom of movement through the shoulders and chest.\nOUTDOOR VERSATILITY. Never Stop Exploring with thoughtful features that help you go further — this jacket creates a compact storage pouch by packing into its own secure-zip hand pockets, which can protect your hands and valuables from the elements.\nEXPLORATION WITHOUT COMPROMISE. Easily find our most sustainable products with this badge. To qualify, apparel, equipment and accessories must be made with 75% or greater recycled, regenerative and/or responsibly sourced renewable materials by weight.","reviews":[{"name":"geimVEIRA","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Counterfeit alert!","review":"Just received this item, seller: Champaign Surplus, and it is an obvious counterfeit. Poor quality seams, zipper very stiff, it was lacking the holographic sticker, the logo stitching is off, am terribly disappointed.\nIt does not have laundry information label, nor season/year label which are things upon contacting The North Face confirmed this is not their product at all."},{"name":"Mac Since 1987","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Wonderful coat for the money- but you need to size up!","review":"I’m 5’6” and 120-125 pounds on a good day. I ordered a large because I like my rain coats to feel oversized. Over all TNF models, I chose the Venture, because it’s lightweight and still protects you from the wind, cold, and rain. The huge collar and mesh linings on the Resolve jackets (Resolve Plus, Parka, and regular Resolve) ends up making me feel hot and weighed down. The length of the Venture is 25-26 inches- where the Resolve is 24 inches, the Resolve Plus is 26 and the Resolve Parka is 27 inches. Confusing, I know! Overall, the Venture is lightest with the most protection. If you want a more form- fitting look, I would go for a medium (with my height and weight). There are so many great colors, but I couldn’t decide, so I got black. I ended up getting my tween girl an XL in Sodalite blue, and it’s gorgeous. We walked in a downpour the other day and stayed completely dry. You can’t go wrong so buy it! You won’t regret it!"},{"name":"FIniestra","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" FITS EXACTLY AS I HOPED IT WOULD !","review":"So i purchased this jacket based on my significant other’s recommendation since we’re hiking up Mt. Herard out in Colorado in a few weeks. Needless to say, i’m so happy i bought this ! I’m 5’1 and weigh 110lbs, chest size 32c. i purchased an XS. I was so afraid this jacket was going to be extremely fitted but once it arrived i could immediately tell it wasn’t going to be that way at all. i’m petite so it’s a tad roomy but i’m fine with that bc now i definitely have the option to layer it when the cooler weather hits but the jacket by itself is still so comfortable and fits so nicely and is so lightweight. The only “dislike” would be the arm length but i have pretty short arms so this tends to be the case with a lot of jackets.... Fortunately the velcro at the wrists of the sleeves fixes that length issue entirely!(: i also took that custom sizing test to see what i would be and it told me i should get a Small... which would’ve been massive on me. Glad i listened to my gut and went with the XS! But overall i highly recommend this product if you want something that’s functional/practical for almost anywhere except the extreme cold."},{"name":"Dee","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" North Face, Can't Go Wrong","review":"You simply cannot go wrong with North Face. We have purchased NF for our daughter every year for Back to School shopping. Living in the Seattle area you need a good rain jacket. We like the weight of the jacket and the air venting is cool under the arm pits. The vents can be unzipped. Everything arrived as expected and within the timeframe expected. The fit is great and has room to grow."},{"name":"MyGuidedSelf","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect fit, great length and comfortable","review":"Love this jacket. Ordered and wore this for a trip that was calling for rain. Kept me very dry. It was very lightweight and comfortable. Some reviews said the jacket was very noisy, this didn’t bother me. I’m just shy of 5’10” and plus-size so, I was worried about purchasing online. Not only did this fit me perfectly, I loved the length and the large inside pockets. Usually hoods tend to leave my hairline exposed. This one did not, it was great. My only complaint is that there is no lining in the sleeves. When it’s warm and wet out, the sleeves tend to be a bit sticky. Otherwise, I love it.\n**2020 UPDATE**\nStill LOVE this jacket. Perfect on rainy and windy days. Still haven’t found a solution to the sticky sleeves when it’s really hot and humid out (NC weather 🙄) but it’s perfect in the spring and fall when I layer."},{"name":"Amanda Noordyk","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect Rain Jacket","review":"I've always loved North Face products but really only had heavy winter jackets. This rain coat is super lightweight. No warmth at all but it's the perfect wind breaker and completely water proof. It could be packed super small if you were traveling. I just plan to wear it while walking my dogs. I am 5'2\" and 135lbs. I could have ordered a small but I went with a medium so I could wear a sweatshirt under it when needed. I like the zipper pockets and the fact that it has a hood. The ONLY thing I somewhat dislike is the inside material sticks to your skin if you sweat while wearing it. Still would recommend this jacket, just something to be aware of."},{"name":"Lou","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" LOVE this jacket for spring, or fall.....I would definitely size up for a roomy fit!","review":"I LOVE this jacket, and the great thing was I got it for half off... I love North Face but sometimes it can become too expensive! I love that this jacket is light weight. To me, its perfect for Spring or Fall when its a little chilly outside where you still need a jacket & can wear a sweatshirt under it!\nI sized up, from reading reviews - I normally wear a Large, so I got a XL. I may have been okay in a Large, but I do like my jackets a little bigger so I can wear layers underneath! I am 5'3, 160 LBs, and the XL works for me! Highly recommend this product to anyone looking for a light jacket!"},{"name":"Heidi","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" I absolutely love this jacket","review":"I absolutely love this jacket. I can fold it and reduce it to nothing and throw it in my purse or backpack. Very light and practical. AND YES, it will protect you from the rain girls!"},{"name":"K. D. Wogan","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Good jacket","review":"This is a very good jacket- the only reason I haven’t given 5 stars is that I wouldn’t say it was a relaxed fit. It is more shaped at the waist than it looks on the photo. However I an a medium usually and it fits well over a light fleece - anything bulkier might be a struggle."},{"name":"Loan","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great Jacket and keeps rain out!","review":"This is my third North Face jacket!\nGreat brand and this jackets keeps out the rain and is breathable!\nLove the under arm zip, that gives you the breathable option!"},{"name":"Arran","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Excellent quality and good fit.","review":"Excellent item! Found in the daily deals section. I needed a waterproof for long runs and this, with it’s hard wearing material, zipped arm pits and velcro cuffs was perfect. Arrived earlier than expected. Quality is excellent (as expected from North Face) and fit is as expected."},{"name":"Jessica S","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great quality","review":"Love this I’m a size 8-10 and this fit well size S with space for clothes underneath also tried the XS but returned as was too tight for me. Met my expectations."},{"name":"Catherine Bennett","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" NOT WATERPROOF","review":"Not really light shower proof even though the label says it is waterproof!\nVery disappointed that this was purchased as a gift and I have only just learned that it is only really any good as a wind cheater which I could have got for half the price!"}]}]