[{"id":"xeN9Lc","title":"Gatorade Thirst Quencher Powder, Fruit Punch, 1.23oz Packets, Makes 20 ounces ,80 Count (Pack of 1)","imageUrl":"https://m.media-amazon.com/images/I/81Q4pxAu1FL._SX425_.jpg","price":"$69.99","description":"About this item\nIncludes 80 (1.23oz) packets of Gatorade Thirst Quencher Powder, Fruit Punch flavor. Each packet makes 20oz of Gatorade Thirst Quncher.\nWhen you sweat, you lose more than water Gatorade Thirst Quencher contains critical electrolytes to help replace what’s lost in sweat\nTop off your fuel stores with carbohydrate energy, your body's preferred source of fuel\nTested in the lab and used by the pros","reviews":[{"name":"Josh","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Just what I buy at wal mart","review":"So I read alot of comments that was against this and some said it was exactly what they ordered. I was concern about that. However only reason I bought this off  bc my local Wal marts is having a time keeping it in stocked so for the same price I figured I just order it off Amazon. Well seeing g all the reviews I was like idk if I should order it. Well I did any way and needless to say this powder is the same I buy at Wal mart. I work outside in the heat so this works for me.. I'd be buying this again off Amazon."},{"name":"Jaclyn M Armstrong","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" So Convenient!!","review":"These are Amazing! It is so easy to throw in my purse, car, gym bag and if i am not feeling well, I have them with me and do not need to stop anywhere! Plus the to-go packets are thick enough that they don’t break or get punctured in my purse which I am really thankful for! Also, I leave some out by my coffee area so if I have visitors that don’t feel well, they can just grab one- they are a huge hit! There is no sacrifice on flavor, either- I will buy more!"},{"name":"Steven Chin","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Best bargain for Gatorade","review":"This is a fantastic product and a money saver. It comes out to 37 cent per pack to mix in 20oz water. Buying the drink normally is from $1.50 to $2.00. You can also mix to the level of sweetness you want. Great with water bottles or thermo type bottles in mixing the drink. Easy to carry around drink packs to use when traveling, running, riding bicycles, or any outside activities. I use it when I ride long motorcycle rides where you are in the hot sun and hydrations is very important. It helps with electrolytes and prevents cramping and dehydration. Water absorption is better with this mix than straight water, it has a better fluid absorption rate for the body."},{"name":"MI User","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" I never knew this stuff existed","review":"I like Gatorade, but I find it too strong so I always water it down. this is so much cheaper than buying premixed, plus I can make it whatever strength i want. I like to mix it at around 1/3 strength for use in my hydration backpack. I keep some at work, some at home, and some in my backpack. two packets in my hydration bladder is perfect."},{"name":"Fred Marshall","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Only thing I can stomach when sick","review":"I have known for years now that Gatorade is the only thing my stomach will tolerate when I am sick, either by virus or food poisoning which I think I have this time. It is getting increasingly difficult to get to the store to buy a 28 oz bottle for $1.39 when these pouches make a 20 ox bottle for a whole lot less. This is the way I am going to store it from now on... don't have to worry about it freezing in storage now... Great taste, makes me feel much better getting the fluids back in me."},{"name":"Sicily","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Love How Handy These Are","review":"If your kids are anything like mine, sometimes they just want plain water and sometimes they want Gatorade. These are perfect because I just throw a few in their supers bag, fill up their water bottles and head out. If they decide they want Gatorade, just crack open a packet and toss it in. The flavors are great and they cost a fraction of just buying a pack of Gatorade in bulk from Costco. Would absolutely recommend for any busy sports parent!"},{"name":"ReverendOlaf","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great for stocking up","review":"So I've become a bit of a food hoarder, but I'm trying to be practical. I'd rather have three of these tubs than 18 gallons of liquid. I add a bit of sucrolose to make it a bit sweater, and it tastes much better than I recall as a kid. I don't find it chalky or bad at all. I also stocked up on the liquid concentrate (fearing this would be chalky), and I haven't felt the need to try that (yet). This is much much lighter and compact, so I'll likely stick with this over the liquid."},{"name":"Jim Henri","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Gatorade","review":"Works for me 1/2 the price for buying in stores\n2 of the 1.23 oz.packets make 32oz bottles which I saved from a former purchase from store"},{"name":"nikhil shinde","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Not value for money","review":"Too costly.. u can make only around 16-17 500ml bottles.. which u can buy for a total of rs 800 in any supermarket and that to ready to use.. whereas the powder is almost double that price.. wont b buying the powder again"},{"name":"Yogesh","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" Not Gatorade","review":"I don't think so this is Gatorade powder. They have mixed some orange powder like glucose or something. This does not give gatorade taste at all."},{"name":"Nawaz","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" FAKE","review":"Don't buy its a fake product. It's not a original gatrode product"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" THIS IS FAKE!!!!!","review":"This is fake. Just compare the two images. I don't need to say anything. The writing is either blurry or like in this case absent."},{"name":"Eric","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" This only makes 2 gallons!","review":"This is way to small for the price I actually thought it was a mistake."}]},{"id":"apwMkr","title":"No Nonsense Women’s Yoga Flared Legging","imageUrl":"https://m.media-amazon.com/images/I/51MCSj++j5L._AC_UX342_.jpg","price":"$14.89","description":"57% Cotton, 38% Polyester, 5% Spandex\nImported\nMachine Wash\nStretchy elastic waistband\nFlared leg\nRetain their shape\nLightweight pants\nMade to stretch and move with your body","reviews":[{"name":"Autumn","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Pretty, sturdy, and great price","review":"I was hesitant to buy this because there was no reviews and the price was so low. I took the gamble and bought it. It is exactly as pictured. Easy to assemble and very sturdy. I wanted metal because my two year old splashes water on the floor in my kids' bathroom so I didn't want something that was going to have water damage so quickly. This is perfect!"},{"name":"Cindyshi","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Good for small bathrooms","review":"My bathroom is very small . It is very messy when I didn’t buy storage . Now the storage make my bathroom very clean also can put some things in the bathroom now.only one thing I don’t like is the storage very light .maybe my toilet floor is unbalanced and inclined, the shelf is a little unbalanced. If can add an adjustment base to the ground the will be better."},{"name":"Craig and Cindy","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" cheap but useful","review":"The product is pretty flimsy, however, I just needed it to put a few towels on and a cute nick knack for my basement bathroom. It is not very sturdy, and it definitely looks like a cheap stand but I didn't want to spend an arm and leg. I got what I expected."},{"name":"T.T","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Instructions suck!","review":" I hate the fact that the instructions are very vague. It’s a useless product to buy. It looks nice in the picture but I would definitely not recommend this product"},{"name":"BluStone","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Flimsy piece of crap","review":" This thing was $50 and has poor instructions, missing pieces you need has extra pieces you don’t. After about a solid hour and half I finally get it up as best I can (again, missing parts) and it is the flimsiest cheap piece of crap I’ve ever purchased"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Cheap paint","review":"Cheap paint, while putting it together the paint came off by the time I was done it looked like I had it for years.."},{"name":"Heather Hancock","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" I love these pants!","review":"These are unlike regular yoga pants. Given they are bootcut, they do not cling to your body and are not sheer. They have an extra wide waistband and are easily washed and dried with no shrinkage. I sit in a wheelchair for hours everyday and wearing jeans is too uncomfortable. These are perfect. The only downside is they do attract lint, but all black pants do in my experience."},{"name":"Princess_Wigglebottom","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great price. Good quality.","review":"Really comfortable and you can't beat the price. Ordered more of them because I like them so much.\nNot comparable to Lululemon, of course. But at this price, you can't expect them to.\nI'd say they're about the same quality as the yoga pants from Old Navy."},{"name":"M&J Taylor","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great fit","review":"I like the fit and the way they feel. The first pair I ordered was a little too big but the smaller size was perfect. They're soft and just the right weight for wearing around the house. They've been washed a couple of times now and still look good."},{"name":"golfgirl62","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Soft, light and comfy","review":"I’m just over 5’6 and 170lbs. I first ordered an extra large but they were to big so I exchanged them for the large and they are perfect. They are not winter tights people! They are a lighter weight yoga type lounge pant! The waistband is perfect and soft and I love that they are straight leg at the bottom. Based on other reviews I decided to wash the LG pants before I sent the XL back. I washed them alone in cold on a delicate wash and put them in the dryer for a few minutes on low and then washed them again on a quick wash and hang them to dry. They did shrink an inch or two in length only but that was a good thing because they are still a couple inches long but I don’t care. If I hadn’t put them in the dryer they would not have shrank in length at all. These will be fantastic for around the house or cool spring summer evenings on the patio."},{"name":"Amber Smith","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" AVOID BUYING THE WORST PANTS EVER!","review":"Pants fit in waist but too short and are cotton pants and they shrink regardless of how you wash them and not using a dryer. I expected to get something similar to stretchy yoga pants like in a sports or yoga store, but this just wasn't the case. I highly recommend that you steer clear of these pants if you're taller than 5\"8 and don't waste the time and energy on purchasing them. Plus the refund policy is a joke. Why should i have to pay to re-ship an item that was falsely advertised? Not impressed at all."}]},{"id":"TSjRND","title":"LEE Women's Relaxed-Fit Austyn Knit-Waist Cargo Capri Pant","imageUrl":"https://m.media-amazon.com/images/I/61fFzr6+QhL._AC_UY445_.jpg","price":"$24.93","description":"98% Cotton, 2% Spandex\nImported\nZipper closure\nMachine Wash\nRELAXED FIT. These women's cargo capri pants feature a relaxed fit from through the hip and thigh. These capris hit at the calf for a versatile fit.\nSTRETCH COMFORT. Made with comfort in mind, these cargo capris are constructed with stretch twill fabric. Finished with a knit waistband and a roll hem for fit customization -- these capris are perfect for everyday wear.\nCARGO STYLING. Updated style and all-day comfort in a cargo-inspired capri. Made for comfort with a touch of cargo-style, these cropped pants feature an adjustable\nShow more","reviews":[{"name":"Nani G","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very comfortable and not \"clownish\"","review":"When you are in your 50's and your waistline is not what it used to be, it can be a challenge to buy capris. Other capris I have purchased have very low waistlines that cut into my tummy, and when I get a larger size they look like clown pants. These have a stretchy waistband that runs slightly on the large size. I run between a 14 and 16 depending on the brand, this 14 fits great and is SO COMFORTABLE. Cuffs are not huge nor the silly tie cuffs that are often the only choice in looser capris. Material is lightweight but loose enough to look nice -- doesn't cling where I don't want it to. I have ordered another pair. Wish there were more color choices."},{"name":"Pryce","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very Comfortable","review":"Very comfortable. It is perfect for hiking."},{"name":"LilliR","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great cargo pants.","review":"Very good quality and fit. I am 5’4” tall 149 lbs. 40” hips and I bought size 10. I like the color and fabric. The fabric is not too thin or thick. Perfect for spring and summer. The length can be made shorter by rolling the cuff. In the photo I didn’t roll the cuff and it hits 7” below my knee. The waist band hits at my belly button."},{"name":"Opinionated","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Sizing Inconsistent","review":"I initially bought these capris in black in size 14, to have something comfortable and casual to wear around the house. I was so pleased when I tried them on - I'm 5'7\", weigh around 185, and am big through the butt and thighs, but have a small waist. Although the capris were a bit loose in the waist, they fit everywhere else.\n\nI liked them so much I decided to buy a pair in Cafe (khaki) too. I ordered the same size, but when I tried them on, discovered they were too tight, fitting more like a size 12. I've sent the Cafe pair back and ordered a replacement pair in Frost Gray. I'll report back if they, too, are too tight.\n\nUPDATE: Received my Frost Gray capris, and they hit somewhere between the relaxed fit of the black pair I ordered and the too-tight Cafe pair. (They're also less silvery than the picture; I'd decribe them as a light charcoal gray.) I'm going to keep this pair as they're still wearable, but be forewarned that finding the right fit with this capris can be tricky."},{"name":"Denise","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Love these!","review":"Love these!! I suggest buying your regular size. I had read that some bought them one size smaller and I'm glad I didn't because the size 12 fits me perfectly.. and I'm 5'2\", 155lbs...especially in the waist. Bought in two colors! I don't usually leave reviews but these fit so well I was very pleased."},{"name":"Jeaniem","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great capris","review":"I’m 5’2” a 33 inch waist and 40 inch hips/150 lbs and these fit like they were made for me. Very comfortable, not too long. The fabric is medium weight, not see thru at all.\nI bought them for a pending car trip hoping I could wear them 2 or 3 times before they are too wrinkled. After 2 days at home sitting at my desk I’m pretty sure they will work great for traveling."},{"name":"devlynch","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" These are the most comfortable capris I've ever owned","review":"These are the most comfortable capris I've ever owned. Just ordered my third pair and a pair for my sister! stretchy knit waist, loose fit. They are perfect for summer. And the price is amazing. I have been looking at other at about $60 a pair. I strongly recommend these. As a lady of a certain age whose waist has disappeared and who's going for comfort, and pockets, these are the pants for me."},{"name":"OCR","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Leve these gray capris","review":"Loved them! Before purchasing these pants I read several reviews. I am borderline size 6 and 8, and bought a 6. I like them because they are not really relaxed fit -- I chose a smaller size considering that I am working out and watching what I eat, and expect to lose weight. I like the color (gray) and, although I wish the waist line were a bit lower (half an inch perhaps), I'm glad I bought them. Love the side pockets by the knees.\nUPDATE:\nStill love them. For your reference, I'm 5'5\" and weigh approximately 140 lbs. Highly recommend them."},{"name":"Mary Beth","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" No place for a phone but they fit \"ok\"","review":"I wear a 14-16, got the 16 to be extra comfy but find that they *just* fit.\n\nPros:\n- essentially elastic waist, comfy!\n\nCons:\n- no back pockets\n- my phone (nothing big, just a Samsung S5) doesn't fit in the cargo pockets??\n- they are almost a brushed cotton which means they pick up every bit of lint, dust and cat hair. A quick lint roller helps, but it's too much up keep for casual summer pants."},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Cute Capri","review":"I was looking for some nice capris. These fit the bill. On top of that they have stretch. During this last year my weight has shifted so I was in between sizes. I am normally size 12. But as mentioned I gained weight which meant I had to go up a size or two. I went with size 14. I was so happy they fit nice. Maybe a little tight however still comfortable to wear due to the stretch. The great thing is when I loose weight I can still wear them. Ps I bought 3 in total different colors I am happy I did."},{"name":"Lisa Martens","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Comfy and light","review":"I do love the fit. I have an apple shape, so not a small waist, and this elasticized half waist was comfortable without being pinchy, hides the muffin top quite nicely. Length might be long for some, I'm 5'9\" and they hit me a little below the knee."},{"name":"Anna R. Fraser","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Fit as expected. I haven't washed them yet.","review":"Fit as expected. I haven't washed them yet.\nSnap is stubborn to unfasten, but I'm a bit of a weakling. Legs were rolled up and pressed, fine but if you choose to wear them rolled down get your steamer out to get the creases out"},{"name":"susana pliego","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" No es muy lucidor","review":"El pantalón tiene una tela bonita y el color es fuerte, pero el corte no es como en la foto, es más amplio en la pierna, por lo que se ve muy aguado a abajo y eso lo hace más informal y a mí, en lo personal, no me gustó. No lo voy a regresar pero no será mi pantalón favorito. La tela es pesada y gruesa, por lo que en condiciones de mucho calor serán incómodos o calurosos."}]}]