[{"id":"3dETA3","title":"Women's Sunflower Summer T Shirt Plus Size Loose Blouse Tops Girl Short Sleeve Graphic Casual Tees","imageUrl":"https://m.media-amazon.com/images/I/618m05bNSJL._AC_UX385_.jpg","price":"$20.99","description":"65% Cotton, 35% Polyester\nImported\nPull On closure\nMachine Wash\n🌼【Premium Fabrics】This summer sunflower graphic tops for women is made of high-quality material. Soft and smooth. 65% Cotton, 35% Polyester t-shirt. Comfortable and has a good stretch. Comfy sunflower printed tee tops, novelty funny sunflower shirts top women.Soft fabric with a little stretchy, breathable to wear. It's not only light but also absorbs sweat.\n🌼【Design】Sunflower shirts for women. Unique and cute design.Classic round neck design tee, short sleeves shirts. Women's camping graphic T-shirt is simple but energetic, show your charm. Basic tees with front sunflower print decoration, you will love it.\n🌼【Occasion】This sunflower blouse shirt for women are very suitable for any occasion, especially for dating, shopping, work, school, beach, vacation holiday, traveling, parties, concert, sports, coffee cafe, gym, etc. Perfect gift for Mother’s Day, Birthday, Carnival，Anniversary, Graduation, Valentine's Day, Halloween , Thanksgiving, Christmas, New Year, etc. These funny letter tops are suitable for giving your lover or female friends around, they will really like them.\nShow more","reviews":[{"name":"Cynthia C. Grimm","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Not over-sized","review":"I'm between a M and a L. I ordered a M thinking it was over-sized. It's not. I'm going to exchange for a L. Hope this helps!"},{"name":"Lori","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Order up a size","review":"The shirt I received does not look as described. The color is supposed to be purple, and the picture is a true purple, which is what I wanted. But the shirt I got is a soft heathered purple. Also, the shirt as shown has the sleeves rolled. The shirt I got doesn't look at all the same when I try to roll them. The sleeves end up small and tight. I normally wear a medium, but a medium in this shirt is too fitted. I would order up a size if you want it to look like the pictures."},{"name":"Linda","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Nice T-shirt","review":"Cute, soft, and stretchy shirt. Im 5’4” height and 160lbs. Ordered a large to get that loose look."},{"name":"Tori C.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Soft, soft, soft.","review":"I love this t-shirt. It is such a soft fabric and it washed well. I hung it to dry, as I do all my tops. No wrinkles and it kept its shape. Planning to order more.\n\nFit as expected and was true to the color depicted.. I’m in-between a L and Xl and ordered XL for a bit more room."},{"name":"Nicole","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great shirt","review":"This shirt is a nice weight. Not too thin. Super soft. Good stretch. I usually wear a medium and that’s what ordered. Fits perfectly. Would buy again."},{"name":"Brendan","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" MUST WANT BURGUNDY","review":"Very nice T-shirt but the color was much more burgundy than I expected. I was after more of a red color. I took a chance that it was not quite as dark and lost. And this is why I love being a prime member. If it doesn't work you can send it back. It truly is a lovely tee..."},{"name":"Audrey Poole","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great fit and very soft.","review":"These are true to size, very soft, and an overall great fit. I am 5 ft and 190lbs, and carry most of my weight in my lower half. I got a 2x and it is perfect. I loved the red one I got that I came back and brought the black and the green. I washed inside out on cold water and hand dried. It did not change the size or shape of the shirt. Great shirt, super cute, great price."},{"name":"Erica Rose","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Love love love!!!","review":"Absolutely love this shirt. It looks exactly like the picture. I bought my normal size and the fit is right on. For reference, I’m 5’2”, 145lbs and bought a medium. The color is absolutely beautiful."}]},{"id":"ypyCw3","title":"Floral Find Women's Scoop Neck Tank Tops Sleeveless Henley Shirt Loose Fit Summer Basic Tanks Cami","imageUrl":"https://m.media-amazon.com/images/I/61d9lLyBqaL._AC_UY445_.jpg","price":"$19.98","description":"Polyester, Rayon, Spandex\nImported\nButton closure\nMaterial: stretchy , lightweight, soft and breathable.\nFeatures: womens casual summer tops, scoop neckline, button down, sleeveless, lightweight, snapped henley detail, relaxed fit.\nButtons are functional. They can be untied or buckled according to your preference. You can open buttons for a sexy look or close them up for subtle sexy look.\nThis henley tank top that's easily become one of the favorite basics to mix into any outfit, such as pair with shorts, jeans, sandals, great to wear daily, work, party, shopping.\nHand wash or machine wash with cold water, do not bleach, lay flat or hang it to dry.","reviews":[{"name":"Amy","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Good, easy, everyday tank","review":"I waited until after I had washed and worn this to leave my review. It didn’t shrink or change shape from washing or drying so that was a plus!\nI just ordered it in two more colors not that I know it holds up well.\nFor reference, I am 5’7 and weigh about 150. I ordered a large. I have broad shoulders so I always tend to order up a size to make sure it isn’t too tight across the chest. It has a loose fit to it but still has reasonable size arm holes so I don’t have to worry about my bra showing."},{"name":"CL","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Simple straight forward tank top","review":"A simple straight forward tank top. The sizing was accurate to what I expected - loose. Soft material, but thick. Will work for me. I'm 5'5, 170#, broad shoulders and most of the weight is at the belly. XXL is fine, not huge, not tight. Will work for weekend or non office days."},{"name":"Macy's mom","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Runs small","review":"Beautiful quality material, but too form fitting for me. Sizing up increases the underarm where you can see your bra."},{"name":"Masor","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Cute and comfortable","review":"I use this one to everything. Jeans, skirt shorts, etc you can dress up or down will buy more\nBought a medium and sit loose but not too loose"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" the look of fashion and comfort.","review":"I love the shirt and it was everything it said it would be. Fast delivery."},{"name":"Cheri","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Love it","review":"It is so confortable,the loss fit makes it cool."},{"name":"denise","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Not impressed with the material","review":"Don’t like the material, good for work but that’s it"},{"name":"Alison","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Comfortable, nice tank","review":"Received as specified. Quick delivery!"}]},{"id":"rBgwI9","title":"Womens Summer Tops Short Sleeve V Neck T Shirts Tee Petal Sleeve Tunic S-XXL","imageUrl":"https://m.media-amazon.com/images/I/712mP0SWV3L._AC_UY445_.jpg","price":"$16.99","description":"65% Cotton, 35% Polyester\nButton closure\nMaterial:Solid color shirts are Made of 65%Cotton/35%Polyester；Printed shirts are made of 95%Rayon/5%Spands.The fabric is Lightweight fabric with great stretch for comfort,Not see-through.We accept 30 days money back!\nFeatures:Sexy V Neck T-shirts with Tulip Sleeves, short sleeve tees shirts, baggy loose-fitting, casual-chic style, basic short sleeve blouse, solid color, plain, trendy and elegant,this casual top comes in a variety of colors for you to choose from.\nLoose fit shirts. You can Pair this basic tops under a jacket, with jeans, leggings or a skirt in spring, summer, fall and winter. A wardrobe must-have!\nPerfect for daily life, Family Gathering,party, beach, vacation,office or Any Special Occasions.\nSuggest checking our size chart before you place the order (Not  Size) for your happy order.As different computers display colors differently, the color of the actual item may vary slightly from the above images.","reviews":[{"name":"Carolyn H Mack","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Stretchy clingy and wrong for a woman of my age.","review":"This very cute shirt is far too small. It is made of stretchy material and that is not a look I like at my age. I am planning on returning it."},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Not what is advertised","review":"This blouse is advertised as 65% cotton. It is 65% polyester. Not what is advertised"},{"name":"Diane W","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Summer Tee","review":"Lightweight Spring-Summer tee is casual but with fun flirty cap sleeves!..Need 1 in every color!"},{"name":"Bardanlai","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Cozy, comfy. Great price. Good quality.","review":"Casual. Comfortable and great color. Recommend!"},{"name":"SpoBrat","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Fabric too thin","review":"It's cut right and the fabric is soft but very see thru"},{"name":"Aa","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Not as expected","review":"Not flared at bottom. Sleeves are shorter. Sizing is small."},{"name":"Suzanne","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" It suns small and long","review":"It’s a little narrow and long."},{"name":"Virginia Bradfield","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" I was disappointed","review":"Runs small\nand pattern looks \"cheap\" compared to the picture in the advertisement. Would like to return it."}]},{"id":"elWkrI","title":"Under Armour Women's Tech V-Neck Short-Sleeve T-Shirt","imageUrl":"https://m.media-amazon.com/images/I/41aR4ofH-dL._AC_SX425_.jpg","price":"$14.39","description":"100% Polyester\nImported\nUA Tech fabric is quick-drying, ultra-soft & has a more natural feel\nMaterial wicks sweat & dries really fast\n4-way stretch construction moves better in every direction\nDeep V-neck collar & slimmer fit deliver a sleek, more feminine silhouette\nMetallic silver front chest logo\nLoose: Fuller cut for complete comfort.","reviews":[{"name":"M3","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Not an authentic Under Armour shirt","review":"I have reason to believe this is not an authentic under armour shirt. I have several authentic under armour shirts and they all say under armour on the back and the shirts I received does not have the words. The shirts I have say made in Jordan, the ones from  say made in Mexico. I won’t be buying again. The material is thin, the fit is off and I’m very disappointed."},{"name":"Kristin B.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great Shirt but This One Runs Big!","review":"I'm an active person and I love to walk and exercise whenever I can. I typically opt for the racerback tank top style for my workout shirts but I'm also very fair-skinned and I wanted a bit more protection from the sun for my shoulders and back when I'm outside during peak sunshine hours. I own a number of Under Armour products so I was well aware of the quality when I decided to purchase this shirt. Like a lot of people, I was hesitant on the sizing since Under Armour's clothes fit differently depending on the style. Under Armour classifies this shirt as a loose fit as opposed to semi-fitted, fitted, or compression fit.\n\nFor reference, I am 5'6\", 150 pounds, with a 36D chest and a medium fits me perfectly! I wear a medium or large depending on the style and fit of the shirt but, thanks to the help of other reviewers, I was able to successfully order my correct size for this shirt. This shirt is part of UA's Heatgear line which is meant to keep you cool when it's warm out. I've already worn this shirt several times and it is incredibly comfortable. It is made in Jordan of 100% polyester and is very soft and lightweight. It is so comfortable that I don't have any problems with range of motion or anything while exercising. This shirt is a V-neck style which is nice since it adds a little bit of a design over the scoop neck style shirts and it still has good chest coverage so I don't feel like I'm indecent while bending over. It has an UA logo on the left side of the chest as well as one on the back of the shirt, just below the neck. The length is also really nice and comfortably rests on my upper thighs. I've worn this shirt while walking and playing basketball and have still managed to stay fairly cool. Even though this shirt is lightweight, I don't feel that it's sheer and would show anything that's not meant to be seen. The shirt also washes up nicely. I typically hang dry these shirts so they don't get caught on anything in the dryer and so far, they've been great!\n\nI'm so happy I found this shirt because it's become my go-to t-shirt for working out when I don't want to wear my racerbacks. I originally ordered the Montana Teal/Metallic Silver color and loved it so much that I also ordered Flint/Metallic Silver and Coho/Metallic Silver. I've included a picture of my three shirts so you can see what they look like. At first I thought the Flint/Metallic Silver was a gray color but when I got it, it's actually more of a dusky lilac and, since I love purple, I am even happier! I think the hardest thing for most people is to figure out what size to order for this shirt. My thoughts are, if you have two sizes of shirts that you normally order depending on the brand and style, order the smaller size for this shirt. That's what I did and these shirts ended up fitting me perfectly. They are even nice enough to wear out in public so they are definitely versatile. I highly recommend these shirts because they are great for exercising, there are a lot of colors to choose from, and the price is perfect so you can order more than one!"},{"name":"Julie A.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" One of my favorite workout tops!","review":"I really love this top - it's one of my favorite workout tops! It's lightweight and wicks moisture really well. It's flattering, with the v-neck and the flattering, feminine cut, and it's VERY comfortable to wear. I'm a 40C, usually wear a L/12 or XL/14 top and I purchased this in the XL. It's loose enough around my curves that it's comfortable and doesn't make me self-conscious. The only thing I'd change is for it to be just an inch or two longer. I'm 5' 5\" and this hits right at the top of my thigh/mid-butt, but because I've got a curvy backside it does tend to ride up a little when I'm working out (especially when walking/running). I really wish it was available in more colors - I would buy them all!"},{"name":"Lil Del Villar","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect for working out!","review":"Perfect fit! I think I'm somewhat muscular and love this shirt. Quality is amazing for working out. You can seey sports bra and tattoos but can really seey actual skin so not too transparent. But overall, love it. I'm 180, pretty flat belly and I'm 5'1\". My arms are bigger than a normal female and the sleeve are a bit tight but that's just cuz I have bigger than norm arms."},{"name":"C.A. Emerson","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" My go-to shirts","review":"Under Armour makes some of the best t-shirts around and for a really great price. I own several different styles and sizes and often wear these to the gym or for a walk around my neighborhood. They are stylish yet modest. I wear mediums and larges in most UA shirts but ordered two of these (black and gray) in XL because the description states they are fitted and sometimes \"fitted\" on me is a bit tight. They fit well....with just the right amount of room...and feel so comfy. I will probably order more of these in different colors. For reference I am currently 5'4\" and 150 lbs."},{"name":"Victoria","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Outstanding product!","review":"Outstanding! I am 53 years old, 5'7\" , 170 lbs , size 14 all around. I wear an extra large. It fits loosely on me.\nI have about six in several colors. I do a lot of walking, 4 to 5 miles a day. They are so comfortable! I wash them in cold and hang dry them :-)"},{"name":"Dee Lite K","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Good fabric, attractive v-neck","review":"I love this shirt for working out, not too tight in the bust (36D) and not too tight overall. For some with smaller busts, the medium might be too large. It's very slimming and the fabric, though you can tell it's a sweat wicking type, it's not too synthetic feeling. I like the feel of cotton and this is a good substitute blend. The v-neck is attractive and this goes with myriad workout bottoms. I wish there were more colors!"},{"name":"Southern Belle","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" As good as it gets","review":"Perfect fit! I was not actually expecting to like this shirt so much, but now I can't wait to get other colors. It came out of the package without a wrinkle so it will be perfect for my purposes. In planning for an upcoming trip, I needed to find some shirts for tours in a hot climate. I intend to wash in the bathroom sink and drip dry to keep my luggage as light as possible. This shirt weighs next to nothing, will dry very quickly, and still looks great. While on this trip, we will be doing some cycling so this shirt is a win-win, and is needed for additional cycling after our return home later. My husband has had to similar UA shirt for a couple of years... now I see why he loves it!\n\nIn certain styles of women's shirts, I have to buy an XL due to broad shoulders. In this shirt, the Lg fits me perfectly. It is NOT a compression shirt, but it is not boxy. It shows a lady's shape well, but doesn't cling at all so it nicely hides those extra unsightly bulges at the waistline. What's better than that?\n\nIf you find any information in this review to be helpful, please click \"yes\". Thanks!!"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect - great for wearing under scrubs in the hospital!","review":"I wear this top under my scrubs in the hospital and it's perfect. The V neck means you can't see it under them.\nThe material means it's also great to keep perspiration at bay too as it's very lightweight & breathable.\n\nIt's really soft & washes brilliantly. After nearly a year the colour hasn't faded & it's kept its shape. I'm a size 14/16 and went with XL which was perfect.\n\nWorth the money!"},{"name":"Belaura","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Love this top!!","review":"I had been looking for an exercise top since giving birth that skimmed over my big belly but didn’t look like a tent at the same time - and I have found it. This top is nicely moisture wicking and dries very quickly after washing. The v-neck is flattering without being too revealing. I am 5’5” with a generous bust and the top just covers my bum. A great find!!"},{"name":"notcruella","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Decent length for a woman's top","review":"Terrific lightweight running top and long enough to not ride up when I move. Women's tops can often feel a bit short or sit above the backside and I never feel comfortable with that. Love this top because it is a decent length as well as comfortable when wearing it to run."},{"name":"Starfox","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Sehr leicht und angenehm","review":"✔️Material:\nDer verwendete Stoff ist sehr leicht und atmungsaktiv. Er trägt sich zudem sehr angenehm auf der Haut und ist auch nach einigen Runden in der Waschmaschine immer noch in Form. Die Farbe ist zudem kräftig und gleichmäßig. So soll es auch sein!\n✔️Passform:\nDie Passform ist sehr gut! Die normale Größe bestellt und es passt super.\n\n🏁Fazit:\nTolle Verarbeitung und ein angenehmer Stoff, für den Sport einfach bestens geeignet😇\n\n⭐️Anmerkung⭐️\nIch hoffe meine ehrliche Rezension war für Sie hilfreich. Mein Ziel ist es, die positiven sowie negativen Eigenschaften des Produktes aufzuzeigen und vor einem Fehlkauf zu bewahren.\n\nBesten Dank und viele Grüße\n\nStarfox 🥰"},{"name":"Miss Laura Wilson","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Initially great but not lasted 6 months","review":"Initially really pleased with the t-shirts, I actually purchased 3 in different colours. Comfortable, good fit, easy to wash and kept their shape. After about 6 months each t-shirt started to develop an odd smell; damp and plastic smell. Washed them several times but when they came out of the wash and dried they each had this smell that got worse with each wash. All 3 can no longer be worn as the smell is awful. So initially loved these but wearing them maximum once a week (not for sport just around the house), washing in different loads as all different colours they all went off so to speak so will not be buying any more."}]}]