[{"id":"uP2azU","title":"Columbia Women's Tamiami Ii Ss Shirt","imageUrl":"https://m.media-amazon.com/images/I/61l-S-NmUeS._AC_SX425_.jpg","price":"$33.58","description":"100% Omni-Wick Ripstop Polyester\nImported\nOmni-Shade UPF 40 Sun Protection\nOmni-Wick Moisture Management\nAntimicrobial Trement Protects This Product From Bacterial Growth\nVented in Back","reviews":[{"name":"LadyNavy","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Flattering, high quality!","review":"LOVE these shirts! The feminine cut is SO flattering and the snap closure stays shut and doesn't bunch over my chest. I was very worried about it being too snug around my girls but it fit perfectly and falls at a really good, flattering length. I have a regular length torso and it hits a comfortable number of inches below my hip bones. I am 5'4\" and a 34DDD and the L fit perfectly. Even my boss commented that the shirt looked very nice and professional."},{"name":"ZooMa68","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Cool and comfortable and great tailored fit for curvy women.","review":"Super comfy, perfect fit. I am 5'9\" and 195# and got a large. Love the side zip pockets! Not sure what the velcro things are for on the lapels, though. Tailored fit for curves and lightweight enough for my trip to Africa next month. I can wash in sink and it looks like it will dry quickly. I wish my size had been available in darker colors."},{"name":"Waterprisms","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Casual Cool","review":"Even with a dark color this shirt was cool in hot weather. It washes great per instructions. I usually wear misses 8 or 10 in tops and bought a large in this blouse to get the soft drape like the picture since I have broad shoulders."},{"name":"N. Ellenwood","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Runs small in the bust but otherwise great value","review":"I like these shirts because they look nice, are comfortable, and can be dressed up or down while traveling. Don't be fooled, they aren't as comfortable as cotton but I still use them as my go to shirt while traveling to adventure destinations. I am busty so had to go for the bigger size making the rest of the shirt baggy so I may try to take them in on the sides on my own or price it with a tailor, same with the hem that I wish were the same length all the way around."},{"name":"Cruiser 1","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great travel shirt","review":"This shirt is of excellent and consistent quality. I have ordered three in different colors. It is fitted to the body but not tight. The shirts are exactly as described, cool, easily washed & dried. If you are looking for a camping shirt for hot weather, this is the one."},{"name":"Dolores Jones","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" It’s Columbia!!!!","review":"It’s Columbia!"},{"name":"Leah","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" SO many good features","review":"Where to start. Fabric - fabulous. Light weight, soft and comfy. Fit - FINALLY a slightly fitted shirt that isn't boxy or way too fitted and tight. It is tapered at the waist just enough to have a contoured fit, plenty of space across the shoulders, length is exactly the right front and back with a curved hem, there is a small split in the sleeve hem which is functional and decorative. Pockets are hidden with zipper closures, but add NO bulk to the shirt.....can be used if you want to, but invisible if you don't. SNAPS NOT BUTTONS......this is such a nice touch. Easy to get on and off with no button to pop off. Love everything about this blouse so much I bought it in 5 colors. As soon as Covid is a mere memory, I am ready to pack and head for the airport....."},{"name":"yessica perez","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Amazing quality, true to size!","review":"Love this shirt it us true to size, I bougth one size larger and it dita a little bit loose but it’s ok!"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Quality","review":"Quality item. Great fit. Fast delivery."},{"name":"Animal Lover","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Do fit smaller than other brands.","review":"I like really these shirts. They are cool for the summer, and I'm able to get away with them for our office dress code. I order xl in Columbia where medium/large usually works with orher brands. Mainly because as a DD I find the Columbia brand tight in the chest. (Yet it if order the shirt in a mens, small will work kind of odd.) I like the snap closure buttons, but do wish they'd add an additional button or even Velcro closure between the button at the chest on their women's shirts, they do have that gap lots of button down shirts do with larger chested women. I'm also not a fan of that PFG logo on the back and had to add an additional shoulder guard to my work delivery bag because the strap catches in the stupid logo. But overall do recommend."},{"name":"Olive","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Très léger","review":"Chemisier très léger; sèche rapidement. Taille non ajustée, très confortable. Belle couleur rose vif. Boutons pressions (en plastique, cependant). Bonne longueur (la taille Medium arrive aux hanches pour une femme de 5'4''). Excellent achat."},{"name":"resquive","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Ligera","review":"La prenda esta muy bonita, pero me quedo justa a punto del botonazo"},{"name":"Sonia","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Chemise columbia","review":"Une chemise pour tous les jours, très confortable et passe partout autant pour faire du sport que pour des renc9ntres"}]},{"id":"DxNlOJ","title":" Essentials Women's Classic-Fit Long-Sleeve Button-Down Poplin Shirt","imageUrl":"https://m.media-amazon.com/images/I/81gKY1EhQGL._AC_UX342_.jpg","price":"$20.10","description":"100% Cotton\nImported\nButton closure\nMachine Wash\nClose-but-comfortable fit with easy movement\nSoft, durable and cozy tumbled poplin for a lived-in feel right away\nSingle button cuff\nAn  brand","reviews":[{"name":"Hedera Femme","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" “boyfriend”/androgynous fit, excellent value","review":"I love clothing cut to look kind of gender neutral, so these shirts are perfect for me. They have a somewhat androgynous fit, with a more or less straight cut from armpit to hip. I have a few slim fit men’s shirts because that’s my look, but these are far better, since they are made to fit a figure with hips (which means it fits all the way down without buttons straining to the bottom of the shirt). Bonus: great price.\n\nSo if you are looking for a straight fit (as opposed to tailored or princess seamed, which is made to create an hourglass), this is a great shirt with lots of fabric options. See pics for a few I got!"},{"name":"ReviewerX","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" A very decent \"Basic\"","review":"I wear a lot of button-downs, mostly as over-shirts with cami's and tanks.\nThis one meets my expectations.\n\nThe fabric is a little thin, but not see-through by any means. I would consider it summer-weight.\nWrinkles sort of easily while worn, so this might be more suited for casual wear. Comes out of the dryer not needing to be ironed, if you remove it promptly. I launder on warm and dry on lukewarm and have noticed no shrinkage.\nStitching is top-notch - no flubbed seams or errant threads.\n\nI am 5'7\" and 175, very full B cup, waist is 37\" and hips are 45\" - I typically wear a L-XL top, in major US brands. I ordered this in the XL and the fit is pretty good. I have \"beefy\" arms, and this shirt is NOT too tight in the arm for me - I have plenty of arm room.\n\nManufactured in Bangladesh.\n\nGratefully received through the 🌿Vine Program🌿 for my *honest and unbiased* review.\nIf my opinion changes, I will be sure to update this review."},{"name":"TTR79","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Good buy!","review":"Really nice reasonably thick good quality and pretty! Totally love these shirts. This is my second one in a different color/pattern. They need a light ironing after wash but really nice business casual and will probably get more."},{"name":"Izzy and Finn","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Ordering more!","review":"Presently surprised. This shirt sits perfectly. I have a hard time finding button up shirts. I wear a large but after reading the reviews I ordered a size down. I’m 36D and no gap."},{"name":"Nyx","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Fit isn't for everyone","review":"This shirt has an extremely baggy cut to it, and is also fairly thin in terms of material. I saw another review call it a \"boyfriend cut\". I'm 5'8 and about 120, and it's baggier than a lot of the standard cut men's Goodthread shirts. I know I didn't order the wrong size though because it fits just fine in the shoulders. I like the aqua striped pattern, it's a cute shirt overall but the fit/cut just isn't great for my body, so I'm probably gonna return it, since the slim fit men's Goodthreads in XS are so much better on me. It's probably a better shirt if you're plus sized or wider than you are tall, and I like the pocket and pattern. I wish there was just a little more of a women's shape or brought in on the waist.\n\nIt does wrinkle easily but I don't really mind, it's kinda cute. You could easily starch this to prevent that if you wanted."},{"name":"Lauren Fuquay","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" @xosimplylo for more  fashion","review":"I love this top!\nIt's hard to find a button down that isn't thin and cheaply made, at an affordable price.\n\nThis one hits the mark. Great quality. Holds its structure and isnt thin.\n\nI'm 5'2 135lbs and wearing a medium"},{"name":"Heidi S","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great shirt, Great price!","review":"I liked this shirt so much that I ordered another, one pink stripe, one blue stripe. I plan to wear it with my Levis and white chino shorts. I was on the fence between a SMALL and MED and ended up ordering SMALL. Glad that I did. Fits perfectly. I’m 5’6”, 150 lbs. 34C, 32 rib cage, 28 waist, 40 hips. I’ve got room under the arms. A Med would have been too big under the arms I’m sure. I am able to button all the way down, even around my ample behind but not too baggy around the waist and back! Feels nice, lightweight and crisp, cool enough for our 100+ days in Arizona right now."},{"name":"Claude","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" So comfy, soft","review":"I love this shirt! Wore today for the first time. It is so soft and comfy. I'm a pear shape figured woman so I always buy large shirts. I'm 5'9\", 150#. Fit is good, not too bulky to tuck into my pants. Length was as described. I'm going to order more of these in other colors. I haven't washed it yet. If it's too wrinkly and I have to iron it...well...that won't do. 😜 But I'll get back on here and update if I need to. Otherwise I give the black/white gingham shirt 5 stars!\nUpdate: 2020, I just ordered the black in medium and am so happy! These wash up beautifully. I recommend popping them in the dryer alone for 2 minutes to begin drying then hang to release the wrinkles. They dry QUICKLY! LOVE THIS SHIRT. I'll be ordering more colors."},{"name":"Chat Persan","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Really good quality","review":"Really good quality shirt. Did not lose shape, nor shrink after machine wash. Easy to iron. I wear it at work with jeans; received many compliments. I am a size 14 and the size Large fit me really well. I like it so much that I got a second one in a different pattern."},{"name":"LMH","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Crumpled fabric","review":"Disappointed with this blouse.Parcel arrived intact but the blouse itself had been stuffed into a plastic bag and not folded as it should have been, so it was just a crumpled mess. It was clear to see that it had previously been folded round card to make it presentable. I can only assume someone has returned this blouse at some point and it has been sent out to me in the state it was returned, a crumpled mess. Very poor customer service. The sleeves were a good length and roomy for a comfortable fit. However the front buttons barely fastened. Overall a poor fit."},{"name":"Lady of Kirkella","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" My poor fingernails!","review":"I know the buttons are small on these shirts but the buttonholes are miniscule and it is really difficult to undo the buttons without breaking fingernails. That is the only fault with them - but it is enough that I won't buy more than the three I got this time"},{"name":"Jofudge","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" buy bigger size","review":"I'm size 14uk & having read other reviews I bought the large size and fits perfectly. I couldn't make one for myself for this price! It's well made & checks all line up. button holes are a little tight but for this price its a fantastic quality bargain"},{"name":"Annie","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Nice shirt","review":"I like thin cotton in summer so this was just right the pink is same as photo which so often is not the case ....if I have one niggle a little big on hips for me but we all have different size hips.....I would really like shirts that are straight to wear outside over pants and skirts they are so hard to find and whoever comes out with them will have a winner (preferably cotton of course) all In all a good buy for £12..."}]},{"id":"D5AvLF","title":"Striped T shirt Women button up Roll up Sleeve Blouses Top V Neck Striped Collared Casual Tunic Shirts Blouse Tops","imageUrl":"https://m.media-amazon.com/images/I/71-XEPHht5L._AC_UX385_.jpg","price":"$6.98","description":"long sleeve blouses for women\nMade in USA or Imported\n✿✿Dear Queen, Please read the size chart before purchasing, then choose the right size according to our IMAGE SIZE CHART!\nPull On closure\nMachine / Hand Wash in Cold Water, Line Dry.\ntops women patriotic tank leggings summer undershirt mustard blouse top dress casual fall Juniors tunics bodysuit shirt teen girls deep neck racerback cami lady cute jackets criss crop loose plus size one shoulder 90s silk\ncotton shirt for women button down shirt blouse for women button down blouses for women long sleeve tunic xl gray women shirt light gray point collar lightweight fabric women long slim fit chambray for women casual club gray xl\nShow more","reviews":[{"name":"Florene A.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" luxurious feeling","review":"Cool light feeling fabric for a long sleeve blouse . Can wear comfortably in warmer weather ."},{"name":"judith robey","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" LOVE IT!","review":"Feels so airy, light and perfect! Great quality, nice length in back w/perfect shorter length up front! PERFECT FOR TALL GIRLS!"},{"name":"Sydney","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Striped shirt","review":"Love shirt, fits as advertised. Happy with purchase!"},{"name":"shoe lady","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" I love this blouse I like the way it fits","review":"I like the feel of the material and it looks good with jeans"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" So so","review":"Material pretty thin. Tight in the arms. Looks very different from picture. Look like pajamas to me"},{"name":"Peggy W","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Love It!!!","review":"Great quality. Will buy again."},{"name":"River","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect top!!! Lots of Compliments!!","review":"I’m 5’6”, 145 lbs and 34D bra, I ordered XL after reading reviews and it’s the Perfect top!!! I get Lots of Compliments!! It’s nice and light, super comfy cool and elegant, casual or dressy with pants or shorts! Washes easy and no ironing required. I ordered 3 more colors!"},{"name":"marie arend","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Love this shirt","review":"Love this shirt"}]}]