[{"id":"b-CGx6","title":"Levi's Women's Faux Leather Classic Asymmetrical Motorcycle Jacket (Standard & Plus Sizes)","imageUrl":"https://m.media-amazon.com/images/I/81YKjX5JK9L._AC_UX385_.jpg","price":"$51.19","description":"100% Polyurethane\nImported\nPolyurethane lining\nZipper closure\nMachine Wash\nFUNCTIONALITY: Snap down lapels; Center front zipper closure; Adjustable zipper cuffs; Two lower welt zipper pockets\nSTYLISH FEATURES: Classic faux leather motorcycle jacket; Attached jersey fleece hood for added comfort\nVERSATILITY: This faux leather classic moto jacket makes this jacket a staple in every woman’s closet; It is perfect to transition between seasons or to use as a layering piece","reviews":[{"name":"emme","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" 40 42 53 18/20. 255lbs 5'6","review":"I was nervous about the fit because i am plus size but small chested 40b. I am 5'6, 255lbs pear shaped (42'' waist 53'' hips). I usually wear 18/20 lane bryant and 20w in levis jeans. After careful review i got the 3x and i love the fit. It is roomy especially at the chest level of course but without looking frumpy. The sleeves fall a little below my wrists even after adding a thick sweater I was afraid it might be too short but my ample bottom looks goooood!!!\nI love it!!!!!\n\nI tried to include the kind of information i myself was looking for. I hope it was helpful."},{"name":"MsDC16","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" I’m in love with this jacket!","review":"Bravo Levi’s! After much searching I’ve found the perfect moto jacket! The faux leather looks real! All hardware is top quality plus it’s waterproof and machine washable! I first had a medium but sleeves were way to long and worn open had too much room! Although would be good for Sweater or Hoodie underneath, however I intend to wear with tee shirts or tank tops in the Spring so sizing down too a small is perfect! Not too tight could still wear with thin sweater and the sleeve length is much better! Still a tad long but that’s the look! Don’t hesitate this jacket is perfect!"},{"name":"Sally O'Malley","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very impressed!","review":"Beautiful jacket. Very well-made. I don't wear leather, so I was thrilled to find a quality, vegan leather jacket. I ended up returning it though because of the slim fit. I'm top heavy (36DD) and the medium was snug around my chest, but fit everywhere else. I didn't go up to a large because I was afraid it might look too bulky around my shoulders. I may try one of the other faux leather Levi's moto style jackets because the quality is amazing."},{"name":"JustACustomer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" I'm in love. Surprised at quality and fit.","review":"First off the jacket does look like fake leather almost like couch leather but that doesn't really bother me that much. The detail on the jacket is awesome there's little bits of design everywhere which I love. The zippers on the sleeves are just for show when you unzip them they reveal a fake pocket. The hand pockets fit my hands and take a lot of work to fit my phone in. the chest pocket can't fit my phone I'm pretty sure but maybe an ID or something. The buttons for the collar do make a weird tapping sound if you don't make sure to button them. There were also a few loose threads on the back that I cut off. I was wary about buying a leather jacket on  but I'm glad I did. I got a small and I'm 5'3 almost 5'4 and 125 pounds with a big bust and it fits perfectly. The sleeves are snug but that's how I wanted it to fit. At first when I looked at it I thought it might be too big and would make me look bulky but when I put it on it was fitted and looked very feminine. It's also pretty warm but if you get snow you might want to wear a similar colored hoodie underneath."},{"name":"Nancyjua","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Get It!","review":"This is the jacket I didn’t know I needed. I waited a while to get it. Once I did, I was so glad. It’s a quality jacket and feels luxurious. It keeps you warm and elevates any outfit. I ordered a large and the fit is perfect. For reference, I wear a size L top."},{"name":"Tom F","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Beautiful and cool jacket","review":"Fit is awesome. It is a bit short for what I usually wear, but that's the cool style I hear and so I got it. Man am I glad I did. It's so comfy and so cool, but without being TOO cool. I think if you're someone who likes classic styles but wants something feminine with a bit of edge you'll love this.\n\nIt's also super comfy and almost seems like it has some stretch, which makes no sense. It's very supple and fits beautifully. I love it."},{"name":"mis_iz214","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Well fitted jacket","review":"Nice fit...at waist. Leather looks real."},{"name":"Paul P.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great jacket !!","review":"I bought this for my 24 year old daughter...she absolutely loves it. It was difficult to find a nice jacket at any of the stores that we usually shop at. So we went to our \"go to \" store - ."},{"name":"Helena","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great looks and value","review":"The quality and design are excellent. It is slightly tight in the arms but has some stretch so that it will loosen somewhat in time. This jacket is not meant for wearing bulky sweaters underneath. It will be great for the fall weather. It could also be worn indoors. Love the true red colour."},{"name":"Parissa Nikbin","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Too big","review":"It was too big for me. I usually take XL but it was not available so I had to order xxL and it was too big. Too bad. I loved the color"},{"name":"Anne Cheesman","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Super stylish classy jacket.","review":"Love this jacket. Looks very stylish and is soft and durable. It feels and looks like leather but is totally cool, durable and washable."}]},{"id":"c_6a_n","title":"Women's Waterproof Ski Jacket Warm Winter Snow Coat Hooded Raincoat","imageUrl":"https://m.media-amazon.com/images/I/715wuxeTVjL._AC_UY445_.jpg","price":"$49.99","description":"Polyester\nZipper closure\nHand Wash Only\nWaterproof:womens winter coat made of waterproof breathable fabric, and all the zippers are in waterproof design, waterproof fabric can prevent rainwater permeating into the ski jacket and meanwhile eliminate sweat in time.\nWarm:The windbreaker jacket shell with the adjustable and detachable hood, has a high density of textiles, which can prevent the cold wind entering inside.Lightweight warm cotton filled locks the body heat effectively and builds a perfect windbreak system.\nAnti-scratch&Wear Resistant:The Ski coats shell is made of the polymer blending material. The strong textile fiber fabric shell, which can reduce the risk of accidental injury, avoids being scratched by rocks and branches and at the same time protects your body.\nMulti Pockets:2 zippered side pockets, 1 waterproof pressing glue breast pocket and 1 zippered inner pocket.\nSize Note:The winter jacket offers a standard fit.True to size. Please order usual size.","reviews":[{"name":"Kristen D.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Love love love","review":"Love this ski jacket. It’s super warm but very light & not bulky at all. I live up in Buffalo NY where we get 4feet of snow and negative degrees do we need a good quality coat here! I’m 5’2 ,120lbs and bought a size up to layer under. I purchased a medium and it’s perfect for comfort of layers. My husband is 5’10 and 195lbs and his is perfect fit layers at a Xlarge. Love the quality ."},{"name":"Larka","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Marshmallow feels","review":"I bought a size up from my usual size, to the XXL, because everything comment wise stated it would be safest if you like to layer up. I tried it on and it makes me feel so tiny inside. (I am 5'9\" and weigh 230lbs.) Unless you layer up more than 2-3 items under this and those layers being thick, I don't see a point in going a size up as some have suggested. I think if your layers are thin and you buy your usual size, it shouldnt be a conflict. I don't plan to return it because I am fine with feeling like a marshmallow and the amount of layering I do will be sufficient for where I live, which is in the midwest. So it works perfectly for what I need."},{"name":"Sophia","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Probably the best Jacket I've had Yet.","review":"Bought this Jacket for my upcoming ski/snowboard trip and HOLY COW! It's super warm, super waterproof (I would know- I was one with the snow... a lot.), and also very breathable!! Love it!!!! On two occasions, I was so warm I had to stop to peel my second layer off and went down the slopes with just my base layer and this jacket just fine- no cold!. I am 5'4'', 110 lbs, and bought a Women's Small (even though I typically wear XS) in order to make sure I would have enough space to layer, and it fits well with and without layers. Not Bulky and not overly loose to the point where you're getting a cold draft up your jacket. Highly recommend it, and with that price- it's well and beyond worth it! Will be getting only this brand of jackets from now on- nothing else compares, really."},{"name":"freyawyn","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Pockets are awesome!","review":"Update: I've had this coat a full year now, and I still love it. I recommend that if you are even considering this coat, buy it and give it a try.\n\nOriginal Review\nI love this jacket. I'm picky about my coats. I live in Michigan, so they have to be warm, and I hate using a purse, so they need a lot of pockets. Looking good is essential too. And they need to be mess resistant and easy to clean. This jacket fits all my requirements.\n\nHonestly I didn't think I was really going to like any coat I picked off  without even seeing it first, but I was wrong. The pockets are nice and deep, enough to fit my large wallet, cell phone, gloves, keys, and sunglasses in one pocket. With 5 pockets, I can easily carry more than I need to.\n\nIt fits great, and it looks awesome. I gave birth about a month before buying this coat, and it easily accommodates my still large belly. Yet, its short enough I'm not drawing (I'm only 5 foot tall with short arms).\n\nI have not washed it yet, but the material is very plastic feeling - the kind that doesn't get dirty and keeps the heat in. I've been out in it several times and its kept me plenty warm. On the warmer days though, I actually get too warm and had to take it off. It is NOT a spring jacket.\n\nThe only con was the hood. I don't normally use a hood. This coat has a detachable hood, connected to the coat with a zipper. The zipper kept getting caught in my long hair. I just detached the hood and haven't had problems since. But I would avoid this coat if you want a coat with a hood and have hair longer than shoulder length.\n\nOverall though, I would recommend."},{"name":"Kristen","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Don't let the size fool you, it keeps you warm!","review":"After reading other reviews I decided that I didn't want it to fit to snuggly. I could have bought a large & probably been ok but I wear my sweatshirts bigger so I ordered an XL I am 5ft 2in around 145lbs. Yes it is big on me because I am not a big person lol but I wanted that extra room for my sweatshirts, if I wanted it tight I probably could have gotten a medium even. But to me it's perfect, & usually I don't wear colorful things, my clothes are blue, grey, & black so my boyfriend was in shock when he seen I bought a pink coat lol it definitely keeps me warm, I can pull my hands in & they are warm if I forget my gloves, not fond of the hat but I have a carhart beanie, lots of pockets too. Not too bulky which I hate when buying coats which is why I probably haven't owned one since I was in my teens. Lol but now I'm older & the cold hurts my body so I need to stay warm when I leave the house & I'll tell ya I didn't think this tiny coat could do it but it does the job!"},{"name":"Collins","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Runs Big","review":"I originally bought an extra large so I could layer, but it was way too big. Exchanged for a Large, still a bit big but will be good to layer on cold days!!"},{"name":"GrammyT","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Warm, Stylish & Great Fit","review":"I bought this for my daughter. We followed the recommendations on the size chart provided. The coat fits perfectly. It is super warm and really cute! My daughter loves all the zipper pockets in this amazing coat! Highly recommend this item! You won’t be disappointed."},{"name":"Spektrum32","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Beautiful, warm jacket!","review":"I ordered the purple medium. I love the color. I use it in the rain walking my dog, it’s warm and keeps me dry. It has plenty of pockets, and appears to be well made. I’d highly recommend it!"},{"name":"Perla","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfecta!","review":"Compre una talla más grande (soy M, compre L), y está perfecta para usar ropa térmica aparte abajo. La usé en fríos de 3grados y esta genial . Tiene muchas bolsitas donde guardar cosas."}]},{"id":"G-6kjW","title":"Lock and Love Women's Removable Hooded Faux Leather Jacket Moto Biker Coat","imageUrl":"https://m.media-amazon.com/images/I/819zfBTvcuL._AC_UY445_.jpg","price":"$24.95","description":"Shell: 100% Polyurethane; Lining: 100% Polyester; Sweater: 75% Polyester, 25% Cotton\nImported\nButton closure\nHand Wash Only\nFaux leather material for style and comfort / 2 pockets of front\n2-For-One Hooded denim style faux leather jacket\nButton detail on waist / Detail stitching at sides\nShow more","reviews":[{"name":"Savannah","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" love it!","review":"love this jacket! super cute and comfy. really good quality for being feux leather. I ordered a medium and it fits as expected (I'm 5 feet tall, about 130 lbs, 34c bust)"},{"name":"Nenerbeanz","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Nice, soft, leather like feel but too small","review":"The jacket has a beautiful soft, leather like feel. In the picture from the manufacturer the jacket looks like faded black but it is true black. The arms are somewhat fitted but not too much. The body of the jacket, however is VERY skinny. I am somewhat slim, 5'8\", 135 lbs but have a broad back. I ordered a medium and it is too small. I usually wear a 6 or 8 in womens tops and according to the sizing chart here a M should have fit me. The zipper was at least three inches from closing and it was very tight in the shoulders. It isn't as long as it appears in the picture either. It hits at the top of my hips, just below my waist. I just wanted to add my review to round out the sizes represented as it seemed the only reviews were from women shorter than 5'2\". I think the jacket is really nice and so I may buy a large. The bummer is that Lock and Love doesn't offer exchanges and you have to pay for shipping three times."},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" My new favorite jacket!! 10/10!","review":"I cannot recommend this jacket enough! The size is perfect, the quality is stellar....it's just a great buy! I am 5'2, 125lbs and I usually wear between a small and a medium. I got the small and it fits like a glove! I like a fitted look, so there's no room for a thick hoodie in this size. I would say buy a size up from your usual if you want to layer it. This is a VERY flattering jacket! This is my new favorite! I even want to start learning how to ride a motorcycle it looks so good! 10/10 for me!"},{"name":"ELWoods","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Awesome jacket!","review":"I'm 5'6\" 136lbs. 36 C. I ordered a large. I will be able to wear a sweater underneath. If you want \"fitted\" order a Medium. Sleeves hit mid hand! (Rare) No smell, not too wrinkled, soft and comfy. Bottom hits top of my hips, waist is not too tapered or tight, but gives a waistline. Tag says Lock and Love. Hood is not too small. Good quality for price, showed up a day and a half after I ordered it. If you're on the fence just order it."},{"name":"mollie easley","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" amazing quality for the price. Way better than expected","review":"Absolutely love this jacket! It seems to be made very well and the quilting is beautiful. I sized up as I assumed this was china-sizing and was surprised when I got it and noticed I could have stuck with my normal size. I'm 5'10\" and the sleeves are pefectly long as well! I love the fact that the hood is removeable as well. I cant recommend this jacket enough!"},{"name":"Luis","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Exelente","review":"Dude mucho en comprar este artículo no me convencían las fotos de los demás compradores sin embargo me arriegue y no me arrepiento queda perfecto a como yo la quería mido 5'3\" y peso 160 libras y la compre en L la compraría de nuevo"},{"name":"EM","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" excellent purchase","review":"I'm extremely picky when it comes to jackets and while I loved the way this one looked, I was a bit worried about purchasing this jacket, since some reviewers said that the jacket was shorter than they wanted.\nTo be safe, I decided to size up two sizes, I like jackets to be loose fitting, and I figured a bigger size would have a longer length. I got a size 2XL and it was perfect. It wasn't short at all, it rests just above my hips, which is the perfect length.\nIt also looks great on me, it's form fitting and isn't boxy. This is also very comfortable and versatile for both warm and cool weather.\nI really like how the hood is attached with a zipper, past jackets like this that I've had are attached with buttons or snaps and they have a tendency to get undone throughout the day, and I doubt I'll have that problem with this jacket, so there's another plus. The quality of the jacket seems pretty high as well, I imagine it'll last for a while.\n\nFor sizing comments, I'm 5'7\", 34\" waist, an athletic build, and wear a 38D. I usually wear a size L/XL shirt. Again, I got a 2XL solely because I like my jackets to be a little loose and I wanted the extra length on the bottom. It certainly doesn't run that small. It was a little smaller than I had anticipated for a XXL, so I would say to size up just to be safe, but I don't think it's a very significant change from your regular size."},{"name":"Anastasia","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Baby, this is the ONE","review":"I've been searching for my perfect leather jacket for ages. AGES. I have three others that are fine but this is the one. It doesn't have any stupid buckles or belts flopping around, it's tight in the right places and accentuates my shape but still allows me to move around and cross my arms. For reference, I'm 5'11, 6,'0 in shoes, 120ish lbs, and my measurements are 34/26/36, and I got a small in style WJC664"},{"name":"Elisha","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Not worth the money poor quality","review":"Quality isn't what I expected especially for the price\nFits smaller than expected\nSeller has been a nightmare from the get go"},{"name":"China","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Decepcionante!!","review":"Las tallas vienen muy reducidas y el color no se parece al de la imagen, la calidad del material es muy malo parece de plástico en lugar de piel!"},{"name":"renkma","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Classy and quality","review":"Just as shown. Classy and elegant looking. Very soft. Quality made. Great even in cool weather with sweater underneath. Love it."},{"name":"Brittney","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Love it so far","review":"Looks as pictured. Love the color. Comfortable and the quality seems pretty good. The sleeves are long on me but i tend to have that issue when petite sizing isn't an option. Might order another in a different color!"},{"name":"EEO","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Excellent fit and service","review":"Fits great. Came earlier than expected. Excellent service will buy again."}]}]